{"https://www.naturalnews.com/2018-02-12-trump-prepares-to-nuke-big-pharma-high-drug-prices.html": "(Natural News) The Trump administration is preparing to do something that no administration in the modern era has ever attempted must less expressed an interest in doing: Taking on Big Pharma and its schemes to maximize profits at the expense of patients.\n\nIf you recall, one of the big, fat lies Barack Obama and his sycophantic Democratic allies in Congress told in order to dupe Americans into backing their “healthcare reform” plan was that the wrongly-named “Affordable” Care Act would reduce drug prices.\n\nSort of. Well, not really. Obama talked around the issue a lot when he was pressed (as you can see in this interview from 2011) but when it came right down to it, the “reform” law contained no provisions for dealing with rising drug prices. Which is why they continued to rise during his administration.\n\nNow, President Donald J. Trump wants to take on Big Pharma in no uncertain terms.\n\nIn his State of the Union Address last month, Trump sent a signal that one of his administration’s most pressing priorities in the coming months and years is working to get the price of drugs down.\n\n“One of my greatest priorities is to reduce the price of prescription drugs. In many other countries, these drugs cost far less than what we pay in the United States. That is why I have directed my administration to make fixing the injustice of high drug prices one of our top priorities. Prices will come down,” the president said.\n\nThat plan is being put into action. Newly-confirmed Health and Human Services Secretary Alex Azar, along with White House Office of Management and Budget Director Mick Mulvaney met with a small group of reporters last week to provide them with a preview into the administration’s Fiscal Year 2019 budget which provides some details into how the president intends to bring prices down and make good on his promise (something he’s good at).\n\nAzar noted that the administration seeks to accomplish the president’s objective by framing the issue with two principal questions: “How can we try to start flipping some of those incentives in the system geared towards higher prices? How do we find pockets of our programs where we maybe don’t negotiate enough or have people negotiating on our behalf to get as good of a deal?”\n\nTrump officials are looking at policy shifts and changes in a number of federal agencies including the Food and Drug Administration, as well as current federal law and policies dealing with Medicaid, drug reimbursement, and other measures. (Related: Trump’s attack on Big Pharma’s cartel profiteering lost the drug industry about $25 billion in 20 minutes.)\n\nAs reported by The Western Journal, changes to Medicaid are key:\n\nThe administration is planning on asking Congress to clarify the definition of generic, over-the-counter drugs in an effort to avoid misclassifications that lead to exorbitant waste and provide potential loopholes for manufacturers to game the system.\n\nAzar said the goal of asking Congress to specifically clarify drugs is to ensure that “generic and branded drugs are paying properly on the Medicaid rebate program.”\n\nIn a recent investigation, the Health and Human Services Office of Inspector General discovered that drug makers misclassified perhaps as much as three percent of the drugs that qualified for Medicaid’s rebate program in 2016. Those miscalculations alone cost taxpayers a hefty $1 billion from 2012-2016.\n\nThe White House will also pursue legislation to give HHS the authority to permit a small number of states to see if they can manage to negotiate better prices with Big Pharma than the federal government currently gets under current Medicaid negotiation regulations.\n\n“If they would like to take a shot at managing their formulary and negotiating better deals than we can get, we would like to do a pilot where up to five states could do that,” said Azar.\n\nTrump will propose additional changes — to Medicaid and Medicare, the two largest government healthcare expenditures — and federal agencies like the FDA in order to get prices down.\n\nFinally.\n\nRead more of J.D. Heyes’ work at The National Sentinel.\n\nSources include:\n\nWesternJournal.com\n\nTheNationalSentinel.com Trump prepares to NUKE Big Pharma's high drug prices", "https://www.naturalnews.com/2018-02-11-green-leafy-vegetables-irrigated-with-wastewater-toxic-heavy-metals.html": "(Natural News) A study published in the IOSR Journal of Environmental Science, Toxicology and Food Technology showed that irrigating agricultural fields and green leafy vegetables with wastewater may result in potentially hazardous buildup of heavy metals including copper (Cu), lead (Pb) and zinc (Zn), as well as nickel (Ni), chromium (Cr) and cadmium (Cd).\n\n“On the survey of study area, it was found that continuous irrigation of agricultural land with sewage and wastewater may be possible reasons of heavy metal accumulation in the soil and vegetables. The pesticides, agrochemical and chemical fertilizers used in the agricultural field are also known to be major sources of heavy metal pollution in study areas,” the researchers said.\n\nAs part of research, a team of scientists form India’s premiere universities examined five agricultural fields in the city of Katihar in the eastern part of the state of Bihar. The researchers then collected soil samples from each field and used atomic absorption spectroscopy to analyze the presence of heavy metals in the samples. The scientists also selected five green leafy vegetables – including mustard, coriander and spinach, as well as bathua and cabbage – that were treated with wastewater. Parts of the plants such as shoots, roots and leaves were washed, air dried and crushed to detect traces of heavy metals.\n\nThe experts then assessed the people’s vegetable intake, heavy metal exposure and potential adverse effects following contaminated produce. The results revealed that both soil and vegetable samples showed heavy metal contamination that exceeded safety levels. The research team inferred that the higher heavy metal concentrations were due to higher transpiration rates from the soil to the plants, which played a central role in the growth and moisture content of the vegetables.\n\nThe experts observed that the highest transfer factor values were seen in zinc, cadmium and lead. The scientists added that vegetable samples that contained high concentrations of lead, copper and nickel were not safe for consumption.\n\n“In many plants, Pb accumulation can exceed several hundred times the threshold of maximum level permissible for human consumption. The introduction of lead in to the food chain may affect human health. Therefore, all vegetable plant samples that were analyzed in this study were more contaminated by Pb and they were harmful for the consumers,” the researchers noted.\n\n“The symptoms of acute oral Zn dose are tachycardia, dyspeptic nausea, vascular shock, diarrhea, vomiting, and damage of heptic parenchyma. Thus vegetables growing in soil having heavy metals contamination can accumulate high concentration of Zn to cause of serious health risk to consumers,” the experts added.\n\nThe experts stressed on the importance of routine monitoring of heavy metal concentrations in wastewater, soil and other food sources to effectively mitigate the risk of excessive heavy metal buildup in the food chain.\n\nSmart tips to eliminate heavy metals from the body\n\nHeavy metal accumulation from dietary sources may pose a threat to the body’s overall health and wellness. A wide array of techniques can be used to effectively rid the body of heavy metals. (Related: 10 easy ways to detox heavy metals from your body.)\n\nSauna and steam – Sweating it out in the dry heat of sauna or the moist heat of steam may open up the pores and remove unwanted heavy metals from the body, according to an entry posted on The Hearty Soul website.\n\n– Sweating it out in the dry heat of sauna or the moist heat of steam may open up the pores and remove unwanted heavy metals from the body, according to an entry posted on The Hearty Soul website. Physical activity – Exercise may help induce sweating and flush out toxins. Likewise, working out may boost blood circulation and speed up detox.\n\n– Exercise may help induce sweating and flush out toxins. Likewise, working out may boost blood circulation and speed up detox. Chelation – Health experts noted that the practice, which involves the use of an intravenous solution, may help accelerate the body’s cleansing process.\n\n– Health experts noted that the practice, which involves the use of an intravenous solution, may help accelerate the body’s cleansing process. Acupuncture – The alternative treatment was touted for its many health benefits, such as increased energy and better blood circulation. The therapy’s efficacy in promoting blood circulation may expedite detoxification.\n\n– The alternative treatment was touted for its many health benefits, such as increased energy and better blood circulation. The therapy’s efficacy in promoting blood circulation may expedite detoxification. Water enemas – An article posted on The Healthy Home Economist website revealed that simple warm water enemas contain powerful healing and detoxifying effects that may benefit both the liver and the gall bladder.\n\nVisit Pollution.news for more stories about the negative health effects of toxic heavy metals.\n\nSources include:\n\nScience.news\n\nIOSRJournals.org [PDF]\n\nTheHeartySoul.com\n\nTheHealthyHomeEconomist.com Green leafy vegetables irrigated with wastewater may contain high levels of toxic heavy metals", "https://www.naturalnews.com/2018-02-11-replace-your-afternoon-caffeine-boost-with-a-nap-research-shows-cognitive-function.html": "(Natural News) Get the same energy and cognitive boosts of caffeine without its side effects by taking a nap, according to a study carried out by a team of researchers from Flinders University. They found that taking naps re-energizes a person and improves cognitive function. The team also discovered that those who regularly take a nap feel more alert after doing so in the afternoon over those who only nap occasionally.\n\nThe study’s lead author Nicole Lovato wrote in The Conversation that she and her team found that around 50 percent of people report taking a nap at least once a week. She also wrote that another study discovered motor learning significantly enhanced after a short afternoon nap for regular nappers than non-nappers.\n\n“Naps are not only beneficial because they make us feel less sleepy and more alert, but because they improve our cognitive functioning, reaction times, short-term memory and even our mood,” said Lovato.\n\nIn their study, they found that the length of the nap is equivalent to the time you will feel refreshed after waking up. Long naps of one to two hours in the afternoon will result in making you less sleepy and will require less sleep in the evening. However, this will also cause you to fall asleep longer than normal. Thus, Lovato suggested limiting your nap for around one and a half hours if you plan to stay up later than usual or if you do not mind taking more time to fall asleep at bedtime.\n\n“This is the length of a normal sleep cycle. You will experience deep sleep for about an hour or so followed by light sleep for the last half an hour,” she said.\n\nShe also explained that sleeping for too long and missing the light sleep at the end of a nap will most likely make you feel sluggish and drowsy after waking up. Although, a drowsy feeling after a nap is temporary and will fade away after a while.\n\n“Waking up during light sleep will leave you feeling refreshed and alert. However, waking during deep sleep will not,” Lovato explained.\n\nTherefore, Lovato recommended having a short “power” nap of 10 to 15 minutes as it can greatly enhance alertness, cognitive performance, and mood almost instantly after waking. Moreover, its benefits usually last for a few hours. With power naps, you will not feel sluggish or drowsy after waking up because you do not enter any deep sleep within this short period. (Related: Expert recommends we take a 15-minute nap daily to function at full capacity)\n\nMoreover, research indicates that a short nap during early-to-mid-afternoon provides the greatest recharge in comparison to naps at any other time of the day. If you are having a hard time to stay awake, taking a short nap at any time can also help you stay alert.\n\nMaximizing the benefits of a nap\n\nA power nap usually lasts about 10 to 15 minutes. However, sometimes a nap takes longer which results in a drowsy and sluggish feeling. To avoid this and maximize the benefits of napping, here are some tips on how to make use of your naptime.\n\nSet your alarm – To avoid over-napping, set your alarm to 15 minutes to wake up feeling alert, cheerful, and productive.\n\n– To avoid over-napping, set your alarm to 15 minutes to wake up feeling alert, cheerful, and productive. Maximize its benefits – To maximize the benefits of your naptime, fall asleep fast. Take a nap in a cool, dark room that is free from distractions and turn off your phone to help you fall asleep faster.\n\n– To maximize the benefits of your naptime, fall asleep fast. Take a nap in a cool, dark room that is free from distractions and turn off your phone to help you fall asleep faster. Nap at the right time – Take a rest one or two hours after lunch since the blood sugar and energy levels drop.\n\n– Take a rest one or two hours after lunch since the blood sugar and energy levels drop. Get moving – Right after your power nap, resume to what you were doing earlier. Also, get some sunlight on your face, take a walk, jump in place, or splash some water on your face to wake up your body.\n\nRead more stories about the brain and its functions at Mind.news.\n\nSources include:\n\nDailyMail.co.uk\n\nSleep.org Replace your afternoon caffeine boost with a nap: Research shows it works just as well to improve cognitive function without the side effects", "https://www.naturalnews.com/2018-02-12-worlds-next-major-health-threat-ticks.html": "(Natural News) When you hear the words major health threat, what’s the first thing that comes to your mind? If you said Ebola, Zika, or some other foreign disease, you may want to think a little more close to home. According to a recent report on The Guardian, the next global health threat could be crawling right beneath you: ticks.\n\nTicks have been around for a very long time, and are known to be widely distributed all around the world. They are especially fond of places in warm, humid climates, so they can be found in many tropical countries. If you find a tick, chances are, you could be susceptible to a wide range of different tick-borne diseases.\n\nAs the Guardian report states, one of the best ways to describe ticks are as “the used syringes of the natural world,” based mainly on the way they feed. They are classified as ectoparasites, meaning they live by feeding on the blood of different animals, including birds, reptiles, amphibians, and even mammals. They are capable of jumping from one host to another, which is what makes them so dangerous and a risk for carrying diseases.\n\nTick-borne diseases\n\nTicks are most known for carrying the following diseases:\n\nLyme disease — Also referred to as borreliosis, lyme is an infectious disease that is caused by bacteria of the genus Borrelia. It’s the current most common tick-borne infection in the United States, and wasn’t formally described until fairly recently. It can cause a number of different symptoms in patients, including rashes, joint swelling, and various neurological disorders.\n\nBabesiosis — This malaria-like parasitic disease is also known as Texas fever, and is also transmitted to humans through ticks. It is considered to be under-reported because only specialized labs are said to be capable of adequately diagnosing it in patients. As such, it can be hard to not only detect but also treat. Its symptoms include fever, nausea, fatigue, and anemia — all of which are known symptoms of other diseases as well.\n\nCrimean-Condo hemorrhagic fever – Known as perhaps the worst out of all tick-borne diseases, it has a particularly high mortality rate of up to 40 percent in infected humans and has no real treatment available to this day. It is said that this level of mortality rate is similar to that in untreated cases of Ebola — that’s how bad it is. Although not as common as the other ones mentioned here, it is said that this disease has the potential to expand into newer regions like Europe due to a couple of different factors. Those who are in regions with a high number of sheep and cattle are at most risk.\n\nTick control methods\n\nFortunately, there is a silver lining in all of this: avoiding most tick-borne diseases is possible if you can somehow manage to take care of the source first. Getting rid of ticks is doable through a number of methods.\n\nIndoors, you can use boric acid products in order to kill ticks due to their low toxicity to people and pets. These products are usually found in powder form and can be applied through sprinkling onto your floors or carpets and brushing with a broom before vacuuming.\n\nIf a tick is already on a pet or some other animal that lives near you, you may want to try using certain products, such as your preferred brand of pet shampoo or Dr. Bronner’s soap. However, be aware that frequent bathing can also be harmful for your pets, and isn’t really adequate for controlling ticks in the long run.\n\nWhatever method you end up using, it’s important to know that you’re only trying to prevent ticks from getting the chance to spread the diseases that they may be carrying. Once actual symptoms of the diseases start appearing, then that requires different forms of treatment.\n\nLearn more about other types of infectious diseases in Outbreak.news.\n\nSources include:\n\nTheGuardian.com\n\nLymeDisease.org World's next major health threat could be of the domestic variety: TICKS", "https://www.naturalnews.com/2018-02-11-worlds-first-biofuel-flight-between-us-and-australia-quantas-dreamliner.html": "(Natural News) The world’s first biofuel flight turned out to be a huge success, and it was powered by 24,000 kilograms of mustard seed-based blended fuel. The historic achievement was made possible through a partnership between airline company Qantas Airways and Agrisoma Biosciences, an agricultural-technology company that’s based in Canada. The two companies announced a partnership back in 2017 and are only now beginning to realize their shared vision.\n\nAccording to a news article posted on the official Qantas website, the flight is only one part of the partnership between the two companies. Together, they have also planned to work with certain Australian farmers to grow the very first commercial aviation biofuel seed crop in Australia by 2020. It’s quite an ambitious team-up that should see some breakthroughs if they can keep up the progress.\n\nAlison Webster, the CEO of Qantas International, plainly states that the choice of the Qantas Dreamliner 787 as the designated aircraft to make the historic flight is quite fitting, and a proper way of showcasing the future of sustainable aviation. “The Qantas Dreamliner marks an exciting new era of innovation and travel,” said Webster. “The aircraft is more fuel efficient and generates fewer greenhouse emissions than similarly sized-aircraft and today’s flight will see a further reduction on this route.”\n\nThe mustard seed-based fuel used for the Qantas flight is said to be processed from Brassica carinata, described simply as a non-food, industrial type of mustard seed, which is sourced straight from Agrisoma. It is expected that Carinata-derived biofuel will help to reduce carbon emissions by up to eighty percent compared to traditional jet fuel across its entire lifecycle. And the amount used on the first ever flight, which is a ten percent biofuel blend, is said to yield a seven percent reduction in emissions based on the flight path taken.\n\nAccording to Steve Fabijanski, the CEO of Agrisoma, there are a number of wide-ranging benefits from the use of biofuel produced from Carinata. “Biofuel made from Carinata delivers both oil for biofuel and protein for animal nutrition while also enhancing the soil its grown in,” Fabijanski explained. “We are excited about the potential of the crop in Australia and look forward to working with local farmers and Qantas to develop a clean energy source for the local aviation industry.”\n\nIn justifying why exactly they opted for mustard seeds for their reliable source of biofuel, Fabijanski said that they are quite easy to manipulate and also offer many other distinct advantages. “It’s a tough crop. It grows where other crops won’t grow. It doesn’t need much water and it’s well understood by farmers,” he said. “They can grow it and do well with it.” For this reason, it has been chosen as the biofuel source of choice for Qantas, which aims to have flights regularly running on the processed biofuel by the time 2020 rolls around.\n\nAlthough a radical departure from the way that they usually do business, Qantas has no problem at all with adapting to the new protocols involving the use of biofuel. The company CEO himself has stated that it’s almost like a routine flight, by all accounts. “The biofuel goes through exactly the same certification and tests as standard aviation,” he offered. And it is said that this includes everything, even engineering, performance, and safety checks.\n\nFor now, the technology and methods used by Qantas may be clear on the benefits, but it will take a while before any real data becomes available for long-term analysis. There is hope that it truly does become a sustainable way of making flights possible, which would ultimately be a win for everyone — Qantas, Agrisoma, and of course, the environment.\n\nFind out more energy-related innovations in Power.news.\n\nSources include:\n\nTraveller.com.au\n\nQantasNewsroom.com.au World’s first biofuel flight between U.S. and Australia achieved with a Qantas Boeing 787 Dreamliner filled with 24,000 kilos of mustard seed-based blended fuel", "https://www.naturalnews.com/2018-02-11-believing-in-progressivism-requires-the-complete-abandonment-of-reality-logic-science-and-reason.html": "(Natural News) To believe the narratives of liberalism, you are required to utterly abandon reality, logic, science and reason. In this article, I’ll demonstrate that with a selection of compelling examples.\n\nWe’ll begin the irrefutable fact that the Winter Olympics now allows biological men to compete as “women” against actual women, allowing individuals with male bone structure, male musculature, and male physical development to defeat women in competition, claiming gold medals as “women.”\n\nThis is, of course, incredibly stupid and delusional. It’s also wholly unfair to women, but that never seemed to bother “progressives.”\n\nAs Breitbart.com explains, “The International Olympic Committee (IOC) confirmed that it would allow transgender athletes to compete in whatever category they wish to participate in during the 2018 Winter Olympics…”\n\nThis outright abuse of female athletes by biological men is, ironically, being carried out in the name of “progressivism” and “tolerance.” Yes, if you don’t tolerate biological men beating the crap out of women at some future Olympics wrestling event (or any other event), then you are an intolerant bigot. In this way, the Olympics has become a tool of the deranged, anti-science Left that requires people to believe in imaginary things or risk being called a person of “hate.”\n\nUnder the delusional banner of “progressivism,” it won’t be long before no actual women win “women’s events” anymore… the medals will go to MEN who are pretending to be women. This is how liberals actually view so-called “women’s rights” — as something to be deployed against women so that men can beat them into submission at the Olympics. Imagine a future where biological women never win any medals at all. This will be accomplished in the name of “social justice” by the very same left-leaning morons who routinely accuse Republicans of waging a “war on women.”\n\nIt won’t be long, by the way, before the very idea of a separate competitive category for women will be decried as “sexist.” After all, according to progressives, women and men have no differences whatsoever. Thus, we will be told that men and women should all compete in the same category in, say, olympic boxing, martial arts or even weight lifting competitions.\n\nBy the very same logic, liberals must now believe there is no such thing as a wife beater because the bigger, stronger male of the household who beats up his female counterpart can simply tell police that he self-identifies as a woman, thus it’s just a “cat fight” and not a wife beating. That’s the new delusional logic of the deranged Left.\n\nThe same liberal lunatics, by the way, also believe that women should not have their own bathrooms because that would be “intolerant” toward creepy pervert males who want to stalk women in women’s restrooms. Somehow, in the minds of Leftists, opening up women’s restrooms to biological men is all part of “feminism.” (Huh?) (See more examples of the lunatic CULTISM of the Left at LeftCult.com)\n\nLeftists love large cities where destitute populations are practically swimming in human feces\n\nPort-Au-Prince, Haiti, is the world’s largest city without a sewer system. Over 2.6 million people live in the greater metropolitan area, and all the raw human sewage they flush goes into actual (literal) “crapholes” which are bucketed out by government workers on a daily basis. Yes, in Haiti, government workers literally scoop buckets of human s##t out of a hole in the ground. The utter lack of sanitation, not surprisingly, spreads diseases like cholera, which has reportedly killed over 7,000 people there in just the last 18 months.\n\nAs left-leaning NPR describes it, “The cumulative sewage of 3 million people flows through open ditches. It mixes with ubiquitous piles of garbage. Each night, an all-but-invisible army of workers called bayakou descend into man-sized holes with buckets to remove human waste from septic pits and latrines, then dump it into the canals that cut through the city.”\n\nYet somehow liberals still Haiti is somehow not a “s##thole.”\n\nBill Maher, one of the many far-left cranks who attempt to brainwash gullible leftists into believing incredibly stupid and contradictory things, thinks Haiti is awesome. That’s why he touts a T-shirt that reads, “HAITI is Great Already,” attempting to take a swipe at President Trump’s “Make America Great Again” slogan.\n\nIs Bill Maher actually trying to claim that Haiti is a better country than the United States of America? It seems so:\n\nJust how great is Haiti, exactly? This photo shows you the unique combination of mass pollution, consumer trash, human waste, despotism and “awesomeness” that can only come from putting leftists in charge of society:\n\nSee more photos of the Haiti s##thole (and hilarious mockery of Conan O’Brien) by Paul Joseph Watson at this link.\n\nThis is the definition of “great” according to liberals. These are the same liberals, mind you, who refused to clap at the State of the Union Address when Trump mentioned the record low unemployment for African-Americans that has been achieved in today’s booming economy.\n\nJust to be clear, when black people live in filth and sewage in Haiti, that’s “great” to Leftists. But when American black folks get paying jobs and earn more wages than ever before, that’s not even worth applauding. Would Democrats be happier if Detroit looked like Haiti? (Give it another 10 years, and it just might…)\n\nBringing this back to the point of this article, always keep in mind that in order to believe Left-wing narratives, you must wholeheartedly proclaim that a horribly corrupt, filthy, third-world s##thole country is a radiant utopia of awesomeness. Yet have you noticed that no Leftists are scrambling to move to Haiti and live in all that filth?\n\nThe delusional transgender theology requires that you believe emotions are real, but biology is imaginary\n\nNot only does being a liberal require that you praise actual s##tholes as being awesome and “great,” you’re also required to believe that emotions are real, but biology is imaginary.\n\nA thought provoking book has just been published, entitled, “When Harry Became Sally: Responding to the Transgender Moment.” The book is authored by Ryan T. Anderson who correctly points out the following contradiction in the “theology” of LGBT delusional thinking: (via The Daily Signal)\n\n…[A]t the heart of the transgender moment are radical ideas about the human person—in particular, that people are what they claim to be, regardless of contrary evidence. A transgender boy is a boy, not merely a girl who identifies as a boy…\n\n…the rhetoric of the transgender moment drips with ontological assertions: People are the gender they prefer to be. That’s the claim…\n\nTransgender activists don’t admit that this is a metaphysical claim. They don’t want to have the debate on the level of philosophy, so they dress it up as a scientific and medical claim. And they’ve co-opted many professional associations for their cause.\n\n[T]he argument recently was that gender is only a social construct, while sex is a biological reality. Now, activists claim that gender identity is destiny, while biological sex is the social construct…\n\nThe thinking of transgender activists is inherently confused and filled with internal contradictions. Activists never acknowledge those contradictions. Instead, they opportunistically rely on whichever claim is useful at any given moment.\n\nOn the one hand, they claim that the real self is something other than the physical body, in a new form of Gnostic dualism, yet at the same time they embrace a materialist philosophy in which only the material world exists. They say that gender is purely a social construct, while asserting that a person can be “trapped” in the wrong gender.\n\nThey say there are no meaningful differences between man and woman, yet they rely on rigid sex stereotypes to argue that “gender identity” is real, while human embodiment is not. They claim that truth is whatever a person says it is, yet they believe there’s a real self to be discovered inside that person.\n\nThey promote a radical expressive individualism in which people are free to do whatever they want and define the truth however they wish, yet they try ruthlessly to enforce acceptance of transgender ideology.\n\nIt’s hard to see how these contradictory positions can be combined. If you pull too hard on any one thread of transgender ideology, the whole tapestry comes unraveled.\n\nAccording to the Left, creepy old guys can “self-identify” as 13-year-old girls and join those girls in the showers at gym class\n\nIn his essay, Anderson also asks the most important question of all … the same question I’ve been asking for quite some time: Where does the “self-identity” delusion end? Can a 60-year-old man claim to be a 13-year-old girl? Can a human being claim to be a rare spotted owl and demand special protections under the Endangered Species Act? As Anderson writes:\n\nIf those who identify as transgender are the sex with which they identify, why doesn’t that apply to other attributes or categories of being? What about people who identify as animals, or able-bodied people who identify as disabled? Do all of these self-professed identities determine reality? If not, why not?\n\nAnd should these people receive medical treatment to transform their bodies to accord with their minds? Why accept transgender “reality,” but not trans-racial, trans-species, and trans-abled reality? The challenge for activists is to explain why a person’s “real” sex is determined by an inner “gender identity,” but age and height and race and species are not determined by an inner sense of identity.\n\n\n\nTo dutifully follow liberal ideology, in other words, you have to suspend evidence of reality and embrace a hodge-podge of contradictory “truisms” which are patently false in the real world. You have to simultaneously believe that physical biology is imaginary while insisting that wishes are facts. More importantly, you also have to believe that everyone has the freedom to be whatever they want to be except for people who disagree with you, for those people have no right to speak, engage in debate or question your delusional reality.\n\nRead more of Anderson’s thoughtful essay at The Daily Signal.\n\nIf you’re keeping track so far, by the way, here’s the summary: In order to be an obedient Leftist, you have to believe that biological men should win all the gold medals in women’s events at the Olympics, that a third-world s##thole city where residents are swimming in human filth is “great,” and that biological reality is imaginary but gender wishes are “real.”\n\nIt gets even crazier, by the way, when you dare set foot in the realm of actual science…\n\nAccording to the Left, the greening molecule that supports all plant life on planet Earth is a “pollutant” that must be eliminated\n\nHere’s the final example for this story. As a real scientist who runs an environmental science lab (CWClabs.com) I know that carbon dioxide (CO2) is critical for the “greening” of the planet. It’s the most important nutrient molecule for nearly all plants, and without it, planet Earth would be nearly devoid of all complex life.\n\nCarbon dioxide boosts reforestation, food crop production and the reclaiming of deserts. Higher CO2 means faster plant growth, more lush rainforests and even a higher number of blooming flowers throughout the forests of the world, as recent science has demonstrated. Without CO2, the web of life would nearly collapse across our planet, and both humans and animals would be wiped out.\n\nYet, to the astonishment of all intelligent scientists everywhere, “progressives” are so brainwashed that they actually believe CO2 is a pollutant that’s bad for the planet. This absurdly stupid belief has been pushed by Al Gore, Barack Obama and even Leonardo DiCaprio, a “famous person” who has no real scientific training whatsoever, a fact that becomes immediately obvious the instant he opens his mouth to utter complete nonsense about climate change.\n\nThe fact that the single most important plant-nourishing molecule in our atmosphere has been demonized by the Left as a “pollutant” tells you everything you need to know about the unprecedented stupidity and reality disconnect of progressivism. To be a “progressive,” you literally have to wall off large regions of your brain and allow your beliefs to be ruled by social conformity rather than reason and logic. This is the secret to being a progressive (or voting for Democrats). If you accidentally allow your entire brain to function all at once, you will quickly snap out of the lunacy of Leftism and realize how incredibly stupid you’ve been.\n\nThat’s why left-wing brainwashing must be repeated on a daily basis by a combination of left-wing news indoctrination (Rachel Maddow) and late-night “hate” brainwashing (Jimmy Kimmel). This twice-a-day dose of stupidity and irrationality is necessary to keep Leftists cognitive immersed in the progressive agenda that blatantly contradicts observable reality and even plain common sense.\n\nIf “progressives” were disconnected from left-wing indoctrination sources for just one week, they would snap out of their stupidity\n\nThink about it: How do you convince an entire population that men are women? You brainwash them with daily fake news and nightly “hate comedy.” How do you make sure that the gullible masses believe the entire planet is being destroyed by a molecule that actually breathes life into rainforests, food crops and plants everywhere? You hammer them with fake science, fake media programming and social media censorship of independent news sources.\n\nThe Left’s mass brainwashing of the population requires a steady combination of news programming, hate indoctrination and online censorship to make sure that progressives never encounter opposing views. It is a technology info-dictatorship built on social influence and narrative engineering. No “progressive” can be allowed to think for themselves for even one day, or they might realize that men are not women, for example. All it takes is one realization to shatter the “Truman Show” artificial reality of the Left.\n\nProgressivism is really just COMMUNISM\n\nAt closer inspection, “progressivism” is really just communism. Nearly all the demands are the same: Equality. Government-run education. The elimination of religion. The worship of the State. The murder of political opponents. The weaponization of the deep state into a KGB-style police state apparatus. The planned destruction of the family. The economic punishment of innovators and small business entrepreneurs. The weaponization of the IRS to target political enemies. These are all old Soviet Union-style KGB tactics for the systematic destruction of a free society followed by a communist takeover.\n\nWatch this 2014 speech from Joel Gilbert to learn more:\n\nSee more at TheresNoPlaceLikeUtopia.com\n\nRead these websites to stay informed on the true insanity of the deranged, delusional Left\n\nThe Left is a dangerously radicalized, deranged cult that now threatens the very future of our civilization. If we all hope to live in a society rooted in reason, civility and liberty, the defeat of the political Left is absolutely essential for our survival.\n\nHere are some websites that may help you stay informed:\n\nLeftCult.com covers the cultism of the lunatic Left.\n\nCrybullies.news documents the crybully tactics of “victimhood” pushed by leftists.\n\nCampusInsanity.com reveals the growing lunacy and mass mental illness of left-wing college students (and their radical professors).\n\nAntifa.news covers the Left’s terrorism wing known as “Antifa,” which openly calls for murdering conservatives. Believing in “progressivism” requires the complete abandonment of reality, logic, science and reason", "https://www.naturalnews.com/2018-02-12-newsweek-top-executives-fired-after-propaganda-rag-exposed-for-running-monsanto-lies-as-news.html": "(Natural News) The money is running out and readership is plummeting at the propaganda rag known as Newsweek. Recently exposed for publishing Monsanto’s lies as “news,” Newsweek Media group is currently imploding from the top down. Top executives were fired this week and the entire staff was told to go home without pay.\n\nThe rapid implosion began with Newsweek’s editor-in-chief Bob Roe and executive editor Ken Li, both fired last Monday. Veteran investigative reporters Celeste Katz and Josh Saul were also terminated, along with Josh O’Keefe, a reporter for International Business Times (IBT), an affiliate of Newsweek. With everything falling apart, veteran political reporter Matthew Cooper also resigned the same day. Company CEO Dev Pragad installed an “acting editor” from IBT to keep Newsweek crippling along.\n\nNewsweek pushes Monsanto propaganda, hastening the demise of their credibility\n\nNewsweek has degenerated into a globalist propaganda rag, going as low as to publish Monsanto propaganda penned by discredited industry insider Henry I. Miller. Industry propaganda is not news, is not investigative reporting, and those organizations that publish it will hasten their own demise.\n\nNewsweek’s most recent article by Miller, an attack on organic foods, shows where their true allegiance lies. Informed readers are not going to put up with Monsanto’s garbage indoctrination pieces; the public isn’t about to start bashing clean, organic foods. This is one of the reasons why Newsweek is just a pile of garbage – its magazines a waste of space in waiting rooms across the Nation.\n\nMonsanto and their paid shills are not going to convince the public to hate on nutrition, sustainable growing methods, and chemical-free foods. The public is sick of being polluted by Roundup and tired of subsidizing the genetic modification of their food. The public has grown weary of Monsanto’s claims, the volatility of pest resistance, and the toxicity of pesticides. The public cannot stand the control that corporate agriculture patents have over farmers, the food insecurities of monoculture, the ecological destruction and the nutrient depletion of soils.\n\nIf Newsweek is going to publish hit pieces on organic farming, they should at least be written by unbiased sources that don’t have a business relationship with an agrichemical corporation “that needs help convincing the public their products aren’t dangerous and don’t need to be regulated.”\n\nAlong with publishing Monsanto propaganda, Newsweek is facing allegations of ad fraud. Newsweek chairman Finance Directors Etienne Uzac and Marion Kim resigned early 2018 after their department allegedly pumped up its traffic artificially with a digital ad buy that helped secure $3 million in funding. Even with all the ill-gotten funding, the company’s financial viability is still in question. One Newsweek employee said IBT employees were not paid on time last Monday due to a “payroll error.” A work stoppage order has been issued and employees were asked to go home. To make matters worse, the NYPD and the Manhattan District Attorney’s office raided Newsweek headquarters this year.\n\nThe undoing of the fake news media has begun, as industry propaganda becomes too easy to spot and as leftist insanity becomes too much to bear.\n\nSources include:\n\nTheWrap.com\n\nTheWrap.com\n\nNaturalNews.com\n\nNaturalNews.com\n\nNaturalNews.com\n\nNaturalNews.com Newsweek top executives FIRED after propaganda rag exposed for running Monsanto lies as “news”", "https://www.naturalnews.com/2018-02-11-food-evolution-movie-called-out-by-experts-for-promoting-corporate-propaganda-gmos-agrichemicals.html": "(Natural News) According to the Cambridge Dictionary, propaganda can be defined as “information, ideas, opinions, or images, often only giving one part of an argument, that are broadcast, published, or in some other way spread with the intention of influencing people’s opinions.” By that definition, the movie Food Evolution is nothing more than straight-up propaganda for Big Agri companies like Monsanto and DuPont.\n\nThough it claims to fairly examine both sides of the argument regarding genetically modified organisms (GMOs), the film is heavily slanted in favor of the use of genetic engineering, and presents any argument questioning this technology as “pseudoscience.”\n\nUnfortunately, US Right to Know (USRTK) warns that this documentary is likely to carry clout and be viewed by a large audience, since it was directed by Academy Award-nominated director Scott Hamilton Kennedy, and narrated by Neil deGrasse Tyson, a well-known American astrophysicist. (Related: Neil deGrasse Tyson caught lying again, blurring distinction between GMOs and selective breeding.)\n\nThough on the surface it might appear to be an unbiased look at GMOs, just a little digging reveals all sorts of industry ties, and it soon becomes obvious that Food Evolution’s sole purpose is to serve as a platform for industry messaging and propaganda.\n\nThe film was officially sponsored by the Institute for Food Technologies (IFT), which is a trade group that is at least partly funded by Big Food. In addition, when the film was originally planned back in 2014, IFT’s president was a former Monsanto and DuPont executive named Janet Collins. She now works for the pesticide trade association, CropLife America.\n\nWhile both the film’s director and producer insist that it conveys all points of view regarding GMOs, and that it represents the results of a completely independent investigation, the only science and scientists that are presented as credible in the documentary are those that support genetic engineering. All other points of view are ignored or dismissed as unscientific.\n\nOne of the strongest points the film seeks to convey is the idea that glyphosate – the main ingredient in Monsanto’s toxic weed killer, Roundup – is absolutely safe. From an industry perspective it is vitally important to change the public’s perception of glyphosate, since most GM crops (between 80 and 90 percent) are adapted to tolerate being bathed in this chemical.\n\nOne farmer interviewed for the film even stated as a fact that glyphosate has “very, very low toxicity; lower than coffee, lower than salt.” And when asked a question about the link between glyphosate and cancer, Monsanto’s executive vice president and chief technology officer, Robb Fraley, dismissed any science confirming such as a link as “pseudoscience.”\n\nIn reality, however, there is strong evidence of a link between glyphosate and certain types of cancer – and those sounding the alarm are respected scientists. (Related: Discover what they’re trying to hide from you at Glyphosate.news.)\n\nAs USRTK reported:\n\nThere is no mention of the carcinogenicity concerns that are engulfing Monsanto in an international science scandal, or the many farmers who are suing Monsanto alleging they got cancer from the company’s glyphosate-based Roundup herbicide.\n\nThere is no mention of the 2015 report by the World Health Organization’s cancer agency that classified glyphosate as a probable human carcinogen, or California’s decision to add glyphosate to the Prop 65 list of chemicals known to cause cancer, or the peer-reviewed studies that have linked various adverse health outcomes to glyphosate and Roundup.\n\nThe film was also quick to dismiss the study of French scientist, Gilles-Eric Séralini – which confirmed that rats fed GMO corn went on to develop kidney problems and cancerous tumors – stressing that the study was retracted. It failed to mention, however, that the editor of the journal that retracted the study was on Monsanto’s payroll, or the fact that the study was later republished. (Related: Editor of science journal that forced retraction of Seralini GMO study entered a promotional contract with Monsanto right before smearing the research.)\n\nRather than expecting Food Evolution to provide a fair, unbiased investigation into the merits and dangers of GMOs, we should all recognize it for what it is: damage control for an industry that is taking a knock because consumers are starting to wake up to the dangers of genetic engineering.\n\nSources include:\n\nDictionary.Cambridge.org\n\nUSRTK.org\n\nFoodPolitics.com Industry propaganda: New Food Evolution movie called out by experts for promoting corporate agenda, GMOs, agrichemicals", "http://www.naturalnews.com/053914_China_toxic_chemicals_food_ingredients.html": "(NaturalNews) Generally speaking, quality control and employee health are not issues that Chinese industry or the Chinese government are overly concerned about, especially in comparison to U.S. and European standards. But there are some foods and products you should definitely avoid completely if they are produced by the Asian giant That said, a lot of food consumed throughout North America and Europe is nevertheless imported from China, but that comes at an additional cost over and above the price on the products. The food awareness site,, reported that some \"food\" companies in China were mass-producing fake rice made from plastic, which of course can cause serious digestive issues (where is our Federal Trade Commission, by the way?), and may even be fatal if consumed daily.\n\nThe site also reported on 10 other foods made in China, which have serious contamination and health problems, and should be avoided at all times:An astounding 80 percent of tilapia, a whitefish that is sold in the U.S., comes from China. These fish are bottom feeders anyway, and eat nearly anything. With so much water pollution in China, eating anything raised in contaminated water would not be safe, of course. In addition, one study says that tilapia is less healthy than bacon, the site reported.Another popular whitefish in the U.S., about 50 percent of cod consumed in America comes from China . Again, there is the water pollution and feeding issue; and what's more, there are not many restrictions in China for exporting these kinds of products.Again, about half of all apple juice sold in America comes from China (because it's cheaper, supposedly). Chinese farmers are known to use harmful (to humansthe environment) herbicides on the food they grow , and this even includes herbicides that the government has banned (so theybe bad). Your best bet here is to make your own apple juice at home from locally grown organic crops More than one-third of the processed mushrooms sitting on grocery shelves in the U.S. – 34 percent – come from China. Like the apples, it's hard to tell where and how the mushrooms are grown. To be safe, buy local, organic mushrooms , or buy a trusted American or Canadian brand.An alarming 31 percent of garlic in American grocery stores come from China, and these are grown using herbicides containing, mainly, methyl bromide. That's just not safe.In 2013, the website noted, the U.S. Dept. of Agriculture approved the sale of Chinese chicken in the U.S. (as if there isn't enough chicken grown domestically). As with fish, the manner in which Chinese chickens are fed is highly questionable – and unsafe. China is also often plagued with viruses like the avian flu and other food-borne illnesses.This one is hard to imagine since rice is a staple in Asia. However, major amounts of fake rice have been seized by authorities in China, and reports say that the product is actually a mixture of potatoes combined with synthetic resin. The goal, of course, is to make money; scam artists have been imitating a popular form of Chinese rice known as \"Wuchang,\" a rice that remains hard after boiling. But long-term consumption of this food can cause cancer , the website noted.One vendor in China was caught selling mud as \"black pepper.\" This is a local problem, but you never know.Like pepper-mud, this, too, is a localized problem, but it seems as though industrial salt is making its way to Chinese tables. But in reality,salt from China could contain an industrial mix, which can contribute to high blood pressure and an added risk of heart attack and stroke.\n\neditor Mike Adams, the Health Ranger , and author of the upcoming book, Food Forensics , is well aware of the cesspool that is Chinese food production. Check out his February 2013 report Avoid these foods from China: they are filled with plastic, pesticides and cancer-causing chemicals", "https://www.naturalnews.com/2018-02-11-cnn-denounces-fda-ban-trans-fats-hate-speech-transgenders-satire-video.html": "Be sure you don’t miss the hilarious “S##tcoin and Buttcoin” video that makes fun of Bitcoin cultists:\n\nIt may not be long before this video gets banned by YouTube. In case that happens, we’ve also embedded the Vimeo version below:\n\nThe full video is available on Counterthink.com or watch it below. The video is obviously free speech satire and parody. If you’re offended by it, you might be a brainwashed member of the Left Cult (or just have no sense of humor whatsoever). Note that Leftists routinely attack Christians, white people, Southerners, President Trump and heterosexuals with satire and parody, but when you dare make fun of transgenders, the Left goes completely insane.\n\nThis FDA ban, we’re told is an assault on “overweight trannies” and even “obese gays.” The fact that the FDA links trans fats to heart disease is also extremely offensive, we’re told, because it implies there’s something innately wrong with being “trans.”\n\nOn the heels of our hilarious “S##tcoin and Buttcoin” Counterthink animation (see below), we now bring you a whole new level of hilarity that imagines CNN calling out the FDA as bigoted and hateful for banning trans fats .\n\n( Natural News ) For your weekend amusement, we bring you what might possibly be the most outrageous Counterthink animation we’ve published yet.\n\nAbout the author: Mike Adams (aka the “Health Ranger“) is a best selling author (#1 best selling science book on Amazon.com called “Food Forensics“), an environmental scientist, a patent holder for a cesium radioactive isotope elimination invention, a multiple award winner for outstanding journalism, a science news publisher and influential commentator on topics ranging from science and medicine to culture and politics. Follow his videos, podcasts, websites and science projects at the links below.\n\nMike Adams serves as the founding editor of NaturalNews.com and the lab science director of an internationally accredited (ISO 17025) analytical laboratory known as CWC Labs. There, he was awarded a Certificate of Excellence for achieving extremely high accuracy in the analysis of toxic elements in unknown water samples using ICP-MS instrumentation. Adams is also highly proficient in running liquid chromatography, ion chromatography and mass spectrometry time-of-flight analytical instrumentation. He has also achieved numerous laboratory breakthroughs in the programming of automated liquid handling robots for sample preparation and external standards prep.\n\nThe U.S. patent office has awarded Mike Adams patent NO. US 9526751 B2 for the invention of “Cesium Eliminator,” a lifesaving invention that removes up to 95% of radioactive cesium from the human digestive tract. Adams has pledged to donate full patent licensing rights to any state or national government that needs to manufacture the product to save human lives in the aftermath of a nuclear accident, disaster, act of war or act of terrorism. He has also stockpiled 10,000 kg of raw material to manufacture Cesium Eliminator in a Texas warehouse, and plans to donate the finished product to help save lives in Texas when the next nuclear event occurs. No independent scientist in the world has done more research on the removal of radioactive elements from the human digestive tract.\n\nAdams is a person of color whose ancestors include Africans and American Indians. He is of Native American heritage, which he credits as inspiring his “Health Ranger” passion for protecting life and nature against the destruction caused by chemicals, heavy metals and other forms of pollution.\n\nAdams is the founder and publisher of the open source science journal Natural Science Journal, the author of numerous peer-reviewed science papers published by the journal, and the author of the world’s first book that published ICP-MS heavy metals analysis results for foods, dietary supplements, pet food, spices and fast food. The book is entitled Food Forensics and is published by BenBella Books.\n\nIn his laboratory research, Adams has made numerous food safety breakthroughs such as revealing rice protein products imported from Asia to be contaminated with toxic heavy metals like lead, cadmium and tungsten. Adams was the first food science researcher to document high levels of tungsten in superfoods. He also discovered over 11 ppm lead in imported mangosteen powder, and led an industry-wide voluntary agreement to limit heavy metals in rice protein products.\n\nIn addition to his lab work, Adams is also the (non-paid) executive director of the non-profit Consumer Wellness Center (CWC), an organization that redirects 100% of its donations receipts to grant programs that teach children and women how to grow their own food or vastly improve their nutrition. Through the non-profit CWC, Adams also launched Nutrition Rescue, a program that donates essential vitamins to people in need. Click here to see some of the CWC success stories.\n\nWith a background in science and software technology, Adams is the original founder of the email newsletter technology company known as Arial Software. Using his technical experience combined with his love for natural health, Adams developed and deployed the content management system currently driving NaturalNews.com. He also engineered the high-level statistical algorithms that power SCIENCE.naturalnews.com, a massive research resource featuring over 10 million scientific studies.\n\nAdams is well known for his incredibly popular consumer activism video blowing the lid on fake blueberries used throughout the food supply. He has also exposed “strange fibers” found in Chicken McNuggets, fake academic credentials of so-called health “gurus,” dangerous “detox” products imported as battery acid and sold for oral consumption, fake acai berry scams, the California raw milk raids, the vaccine research fraud revealed by industry whistleblowers and many other topics.\n\nAdams has also helped defend the rights of home gardeners and protect the medical freedom rights of parents. Adams is widely recognized to have made a remarkable global impact on issues like GMOs, vaccines, nutrition therapies, human consciousness.\n\nIn addition to his activism, Adams is an accomplished musician who has released over fifteen popular songs covering a variety of activism topics.\n\nClick here to read a more detailed bio on Mike Adams, the Health Ranger, at HealthRanger.com.\n\nFind more science, news, commentary and inventions from the Health Ranger at:\n\nDiaspora: (uncensored social network)\n\nShare.NaturalNews.com\n\nGAB.ai:\n\nGAB.ai/healthranger\n\nVimeo:\n\nVimeo.com/healthranger\n\nPodcasts:\n\nHealthRangerReport.com\n\nOnline store:\n\nHealthRangerStore.com\n\n#1 Bestselling Science Book Food Forensics:\n\nFoodForensics.com\n\nFacebook:\n\nFacebook.com/HealthRanger\n\nTwitter:\n\nTwitter.com/HealthRanger\n\niTunes:\n\nitunes.apple.com/us/podcast/the-health-ranger-report/id1063165791\n\nYoutube:\n\nYouTube.com/TheHealthRanger\n\nG+\n\nplus.google.com/u/0/b/106753783877820567659/\n\nSoundCloud:\n\nSoundcloud.com/healthranger\n\nHealth Ranger’s science lab\n\nCWClabs.com\n\nHealth Ranger bio\n\nHealthRanger.com\n\nTruthWiki.org\n\nSearch engine:\n\nGoodGopher.com CNN denounces FDA ban on “trans fats” as hate speech against transgenders (VIDEO) (SATIRE)", "https://www.naturalnews.com/2018-02-12-left-wing-media-refuses-to-cover-fbi-fisa-corruption-scandal.html": "(Natural News) The second that President Trump won the election, conservatives across the country knew that the liberals were going to do whatever they could to take him down. This was to be expected, because that’s just how liberals are – if they don’t get their way, then they whine and complain until they do. What we didn’t expect, though, is how repetitive and downright pathetic the liberals would be in their resistance movement.\n\nEarlier this month, NBC News interviewed Obama era Department of Homeland Security cybersecurity chief Jeanette Manfra, and then proceeded to publish a “BREAKING” news story on something that was already covered eight months ago. To make matters worse, not only was this “breaking news” already covered, but it was and continues to be rather insignificant.\n\n“We saw a targeting of 21 states and an exceptionally small number of them were actually successfully penetrated,” explained Manfra to NBC’s Cynthia McFadden, adding that she had “no doubt” that the Russian government interfered. NBC News came up with a headline to go along with this “shocking” and “groundbreaking” news – “Russians Penetrated U.S. Voter Systems, Says Top U.C. Official” – and then tweeted the following:\n\n“BREAKING: U.S. official in charge of protecting American elections from hacking tells NBC News that Russians successfully penetrated voter resignation rolls of several U.S. states prior to 2016 presidential election.”\n\nThe problem here isn’t that the report is false, because it’s not – we’ve known for quite some time now that the Russians did interfere in the 2016 election, even though there is still no evidence of collusion. Rather, the problem is that NBC News, which prides itself on being a professional and up-to-the-minute news organization, recycled a news story that is almost a year old just so they could take a shot at Donald Trump. Even though the headline itself didn’t specifically mention the president by name, it’s obvious that NBC News revived this story to imply that Trump and his team worked closely with the Russian regime to defeat Hillary Clinton last November.\n\nBut in the case of the liberal media, it’s not just what they do report on that’s the problem; it’s also what they don’t. For example, while NBC News was busy covering this “bombshell story” that most Americans first heard eight months ago, the media refuses to give any attention to the ongoing FBI scandal, which some are considering to be the biggest scandal in modern American history.\n\nAs Sean Hannity explained in an article published on Fox News earlier this week, “Senators Chuck Grassley and Lindsey Graham have released a heavily redacted, yet very revealing copy of their criminal referral against ex-British spy Christopher Steele,” who of course is the author of the phony anti-Trump dossier that was released just weeks before the election. (Related: Following the release of the FISA memo, John McCain claims that “we are helping Putin.”)\n\nHannity went on to explain that, according to Grassley and Graham, “Steele was being fed information directly from the Obama State Department and from Clinton allies as well as his usual, sketchy Russian sources” while working on a second dossier for Fusion GPS, Clinton’s opposition research firm. Essentially, this means that Hillary Clinton, Barack Obama and their allies were working with a foreign spy, Christopher Steele, to discredit and ultimately take down then-candidate Donald Trump. This is what real news looks like, and this is information that the American people need to hear. (Related: A new bombshell report reveals a massive deep state conspiracy to keep Donald Trump out of the White House.)\n\nPerhaps NBC News should take a page or two from Fox News’ playbook, and while they’re at it, stop acting like radical, anti-Trump activists instead of journalists for a well-established news organization. Read more news coverage of the deliberate disinfo peddled by the legacy media at Disinfo.news.\n\nSources include:\n\nBreitbart.com\n\nFoxNews.com Left-wing media refuses to cover FBI / FISA corruption scandal; instead tries to recycle nearly year-old “Russia collusion” story as “Breaking News”", "https://www.naturalnews.com/2018-02-11-mosquitoes-infected-with-natural-bacteria-prevent-reproduction-released-in-miami.html": "(Natural News) It might seem like scientists and other experts have all tried pretty much everything they can to eradicate pesky mosquitoes from the planet. But now, to fight Zika and other kinds of viruses carried by them, a new team of researchers based out of South Miami has decided to simply go after their progeny.\n\nAccording to a report on the plan, the effort is part of a broader initiative called the Miami-Dade County Mosquito Reduction Test Program, which is a collaboration between the University of Kentucky and biotech company MosquitoMate. It involves releasing lab-bred mosquitoes into the wild to depopulate the local mosquito population.\n\nYou read that right: the researchers are going to fight mosquitoes with mosquitoes on their own. The difference is that they’ve got lab-bred mosquitoes that have been infected with a virus known as Wolbachia, which occurs naturally and can be found in many insects, so there is no genetic modification necessary.\n\nIn a video made about the project, the researchers say that Wolbachia is an effective weapon because it will stop the mosquitoes from reproducing properly. “Wolbachia is special because it can prevent an insect from reproducing,” they said. There will not be an immediate effect that can be seen once the lab-bred mosquitoes are released, but after they mate with the female mosquitoes, the resulting eggs will die before they hatch.\n\nThe plan is expected to be highly effective in combating the infamous Aedes aegypti mosquito, which is known to carry a wide range of diseases, including dengue fever, yellow fever, and of course, Zika. The research team promises that their plan won’t result in people getting more bites. Although the mosquito activity in the affected areas will indeed rise, the plan involves releasing only male mosquitoes. And males don’t bite or feed on blood.\n\nAccording to Bill Petrie, the new mosquito control chief in the county, they are going to conduct an initial testing phase to see what kind of options are open to them, as far as implementing the full-scale plan is concerned. “This is a roll-out to see if we can make it operational,” he said. “Then it would be a matter of sitting down and seeing, logistically, what would it take to expand it.”\n\nIn case you were wondering how exactly the researchers can infect their lab-grown mosquitoes with the Wolbachia virus without going down the genetic modification route, it’s all thanks to a method that is based on sterile insect control. It’s a strategy that has been known and long used in controlling pests in agriculture. And now it is being used to infect male mosquitoes as part of the operation. Once the males mate with the females, their infected sperm prevents the resulting eggs from being fertilized. And that’s more than enough to cause the interruption in breeding needed by the researchers.\n\nThis method has been used at least one other time in the past: In an earlier effort, MosquitoMate collaborated with Verily Life Sciences, a sister company of Google, in order to released bacteria-infected mosquitoes in Fresno, California. The overall plan was the same back then — release the infected male mosquitoes and have them mate with the females, then wait for them to lay eggs which will never hatch and eventually die.\n\nAlthough they were able to easily assuage any concerns regarding the use of genetic modification, it’s still unclear what exactly the teams behind the effort intent to do in case something goes wrong. After all, it’s not outside the realm of possibility for the bacteria in the lab-grown mosquitoes to somehow mutate, and that could end up becoming a problem for humans. Also, it’s clear that they have acquired permission to conduct their testing — the same as last time — in an area where the general population lives, and where some people may not necessarily approve of it. So even if it were truly effective, shouldn’t it have been necessary to gather everyone’s consent before proceeding first?\n\nSure, some people are going to be happy with the effort. But it’s important to keep a close eye on the outcome to find out what can be done to improve it in the future.\n\nFind out more about what’s being done in the fight against Zika in ZikaTruth.com.\n\nSources include:\n\nDailyMail.co.uk\n\nMiamiHerald.com Mosquitoes infected with natural bacteria to prevent reproduction will be released in Miami, in a non-GM effort to reduce mosquito populations", "https://www.naturalnews.com/2018-02-11-nutritional-benefits-pasta-holy-basil-powder.html": "(Natural News) Researchers at the Bundelkhand University in India have brought the best of both worlds together by combining holy basil, one of the most popular medicinal herbs in traditional Ayurvedic medicine, and pasta, the ready-to-cook and easy-to-prepare ingredient that’s gaining ground in modern Indian cuisine. This gave birth to a distinct pasta that has a high fiber content, but with a lesser cooking time than regular pasta. In the study, which was published in the IOSR Journal of Environmental Science, Toxicology and Food Technology (IOSR-JESTFT), the authors analyzed tulsi-fortified pasta and assessed it based on its physicochemical characteristics, nutritional properties, and sensory qualities.\n\nTulsi (Ocimum sanctum L.), more commonly known as holy basil, has been grown in many parts of India for its health-giving benefits, and it has established its place in home remedies. Of all the herbs used in Ayurvedic medicine, the tulsi plant is well-regarded in terms of its therapeutic capability, and for a good reason: Modern scientific literature has confirmed the benefits that the tulsi plant is known for. It’s known to protect the body against certain forms of stress, as well as those brought about by heavy metals and pollution. It has also been shown to normalize blood glucose, blood pressure, and lipid levels, which reduce the risk of having diabetes, hypertension, and certain cardiovascular diseases. In this study, the authors looked at the potential of pasta to be fortified with tulsi as a way to appeal to a wider group of people. (Related: Anti-aging ‘Holy Basil’ herb supports natural detoxification.)\n\nTo start the process, tulsi powder and wheat flour were procured for use. Before it was prepared, the physiochemical properties of the raw materials were determined. Four pasta samples were prepared for the test: Each sample had differing concentrations of wheat flour and tulsi powder. For 1,000 grams of the pasta dough, the wheat-flour-to-tulsi-powder ratios of the samples were 100-to-0, 99-to-1, 97-to-3, and 95-to-5, respectively. An ample amount of water was mixed before it was made into pasta using an extruder. The final samples were then dried and stored before use.\n\nThe resulting samples were then rated using different parameters for quality, such as cooking time, texture, and sensory evaluation. In terms of nutrient composition, the authors looked at carbohydrate, protein, fat, fiber, and ash contents for each pasta. After testing, the findings revealed that fortifying tulsi decreases carbohydrate content of the pasta. Moreover, protein, fat, and ash contents decrease slightly when more tulsi powder is used in the pasta. Fiber, however, was noted to increase in proportion to how much tulsi powder was added.\n\nResearchers then determined that increasing the tulsi content in pasta also adds more fiber to it. Moreover, this method also reduces the cooking time of the pasta. “Fortified pasta was highly acceptable with respect to sensory attribute and cooking time, “they concluded in the study. “On the basis of physicochemical and nutritional properties, cooking time analysis of viscosity and sensory qualities pasta certain 97 percent refined wheat flour and 3 percent tulsi powder sample C2 resulted in better quality having more and high overall acceptability. Tulsi powder prevents different diseases (diabetes, asthma, arthritis and heart diseases, etc.).”\n\nThey also added that if tulsi powder pasta is included in daily diets, it has the potential to prevent many diseases.\n\nIf you want to learn more about holy basil and other herbs that could naturally help your body, head over to Herbs.news today.\n\nSources include:\n\nScience.news\n\nIOSRJournals.org [PDF]\n\nNCBI.NLM.NIH.gov Nutritional benefits of pasta can be greatly enhanced by adding holy basil powder", "https://www.naturalnews.com/2018-02-11-mental-preparedness-how-to-think-like-a-survivalist.html": "(Natural News) If you don’t have the presence of mind when a disaster strikes, all of your tools and plans will be next to useless.\n\nSurvivalists know that your mind is the most powerful tool in your arsenal, as long as you know how to use it properly. A survival mindset can help you survive even if you don’t have access to any equipment. (h/t to Survivopedia.com)\n\nA survival mindset is made up of many factors, most of which involve being mentally flexible. Here are some exercises that can help you do just that:\n\nSit in cold water for as long as you can – Try to fight the urge to leave the water. Distance your mind from the cold. Keep doing this, and you will soon notice that you can beat your record as your dissociation skills improve.\n\n– Try to fight the urge to leave the water. Distance your mind from the cold. Keep doing this, and you will soon notice that you can beat your record as your dissociation skills improve. Do repetitive exercises – Try do long sets of exercises that involve monotonous repetition like sit-ups or push-ups. Once you start feeling tired, keep doing the exercises and use dissociation so your mind can focus on other things. Doing this can help you deal calmly with fear and panic.\n\n– Try do long sets of exercises that involve monotonous repetition like sit-ups or push-ups. Once you start feeling tired, keep doing the exercises and use dissociation so your mind can focus on other things. Doing this can help you deal calmly with fear and panic. Imagine your happy place – Your happy place can help you focus on positive emotions and let go of any “pent-up stress.” This place can be any place you want it to be such as the beach or your childhood home, as long as it “makes you feel happy and at peace.”\n\n– Your happy place can help you focus on positive emotions and let go of any “pent-up stress.” This place can be any place you want it to be such as the beach or your childhood home, as long as it “makes you feel happy and at peace.” Think of positive thoughts when you’re feeling down – “Fear, panic, and other negative emotions can lead to negative thoughts,” and these can lead to your downfall in a survival situation. Think of all the things that lift your mood when you are having negative thoughts.\n\n– “Fear, panic, and other negative emotions can lead to negative thoughts,” and these can lead to your downfall in a survival situation. Think of all the things that lift your mood when you are having negative thoughts. Think of your team or family members when you feel fear or panic – Thinking of people you can depend on will give you a reason to keep going no matter what.\n\n– Thinking of people you can depend on will give you a reason to keep going no matter what. Leave your comfort zone – Try to set goals that challenge you in different ways. Putting yourself in unfamiliar situations means you will experience “some of the stress reactions that survival will entail.” This can teach you how to deal with these reactions positively before you are forced to do so in a survival situation, so you know “what fear, panic, and other stress responses feel like.”\n\n– Try to set goals that challenge you in different ways. Putting yourself in unfamiliar situations means you will experience “some of the stress reactions that survival will entail.” This can teach you how to deal with these reactions positively before you are forced to do so in a survival situation, so you know “what fear, panic, and other stress responses feel like.” Use visualization and guided imagery to practice for a survival scenario – Trying to imagine how you will deal with a disaster can help you determine the right course of action before it happens in real life.\n\nHow to be a flexible survivalist\n\nMental flexibility is a must if you want to survive any situation. If you lack this flexibility, you could be one of the casualties when society collapses. (Related: Ready to survive? Make sure to avoid these common prepping mistakes and pitfalls – Part I.)\n\nIf you are mentally flexible, you can:\n\nAccept the uncertainty that comes chaotic situations. Adapt to change when your initial plan falls through. Be willing to take risks when necessary. Come up with “creative and innovative ways to solve problems” when traditional solutions aren’t applicable. Learn from your mistakes. View your current situation from different perspectives.\n\nIf you hold on to a false sense of security, you might become a victim or put your survival at risk. When SHTF, you need to accept the fact that no one, not even the government, will be there to rescue you. As a survivalist, you must learn to save yourself.\n\nAttitude is everything\n\nDespite years of practice, negative thoughts can weigh down anyone with a weak will. Having a “will to survive and a degree of stubbornness” helps make up “the survival attitude that will get you through almost anything.”\n\nLikewise, if you’re a beginner, try not be overwhelmed. Just breathe deeply, and take small steps. Try to get into the survival mindset as you begin your journey. Read some helpful articles online, and ask around for tips from experienced survivalists.\n\nBe realistic about your situation, but hold onto hope for the future. With mental toughness, you can keep going even things seem like they have taken a turn for the worst. Focus on the positive aspect of things, so you don’t dwell on the negatives.\n\nStop thinking “I can’t do this,” and tell yourself “I can do this, I am strong, and I will be a survivor.”\n\nNever give in to guilt or anger. Blaming yourself or feeling angry when a disaster strike is useless, and you need to “banish” these negative emotions from your “mental toolbox” once you start feeling them.\n\nBad things will always happen, but remember that a bad situation is only temporary. Always try to find a silver lining.\n\nA survival mindset will help you stay alive in any life or death situation. Keep these tips in mind as you walk your path as a survivalist!\n\nYou can read more articles about how you can sharpen your mental acuity as a survivalist at Preparedness.news.\n\nSources include:\n\nSurvivopedia.com\n\nBackdoorSurvival.com Mental preparedness: How to think like a survivalist", "https://www.naturalnews.com/2018-02-11-stressed-out-cacao-trees-nutrition-potent-chocolate-research.html": "(Natural News) A bite of your favorite chocolate bar can take off the stress for most people – studies have already looked into it – but research has shown that putting cocoa trees under stress can lead to better-tasting chocolate. In particular, drought and other weather conditions have more impact on cocoa production than how the tree themselves are grown. The report, published in the American Chemical Society’s Journal of Agricultural and Food Chemistry, detailed the impacts that different cultivation methods have in the chemical composition – as well as the flavor – of cocoa beans.\n\nChocolate is the most famous derivative of the Theobroma cacao L. tree, commonly referred to as either cocoa or cacao. Studies have revealed that regular consumption of cocoa protects against inflammation and oxidative stress. In the central nervous system, cacao was shown to improve blood flow to the brain, which can protect against neuronal injury. When used topically, it protects the skin from damage caused by ultraviolet (UV) light.\n\nHowever, cocoa, when consumed in chocolate, can have adverse effects on a person – including weight gain and gastroesophageal reflux disease (GERD). Scientists have been quick to point that there is still benefit in consuming moderate amounts of cocoa or dark chocolate.\n\nThere are two different ways of growing cocoa. The first method, called agroforestry, involves raising cocoa trees in mixed groves. This allows the plants to receive cool air, as well as vital shade, allowing for a low-stress environment. The other method involves planting trees in singular, “monocultural,” groves, to produce more yield. This exposes trees to elevated levels of stress. To counter this effect, trees produce antioxidants to react against the stress and minimize the damage. However, the increased amount of antioxidants also affects the quality of the beans.\n\nTo understand the process behind it, researchers sampled beans from five different cocoa tree farms in Bolivia. The samples were collected from both monocultural groves and agroforest settings and were gathered at the beginning and the end of the dry season. Before its analysis, the beans were fermented and dried.\n\nThe researchers found only minor differences in the chemical composition between beans that were cultivated in an agroforest and a monocultural grove – with beans from the latter having more phenols and antioxidant compounds.\n\nWhat they found to be significant, however, was the effect that weather has on the beans’ chemical composition. During the dry season, the rise in temperature causes soil moisture around the trees to drop. This lead to an increase in antioxidant levels in the beans, as well as reduction of its fat content.\n\nThe authors of the study said that these factors, which elevate the stress levels of the cocoa tree, can add to the variability of the flavors of cocoa beans.\n\nThe results of this study challenge assumptions made by climate change proponents about the possible extinction of cacao trees. According to them, the trees will die out as temperatures increase, causing warmer and drier conditions that will make cultivation of the trees impossible.\n\nTo counter the effects of these so-called “conditions,” the study has proposed using a new technology called CRISPR, which uses genetic modification to “develop cacao plants that don’t wilt or rot at their current elevations, doing away with the need to relocate farms or find another approach.”\n\nThis also puts the study at a slippery slope, as genetic modification – aside from being controversial – has some potential risks for both people and the environment. The dangers associated include the increased cases of autoimmune diseases, gastrointestinal problems, and chronic diseases, as well as its impact in the ecosystems where it is grown, with it being able to withstand increased amounts of pesticide than those growing around it. (Related: GMOs are dangerous to our health, according to latest independent research.)\n\nDid you know that cocoa has the highest amount of phenolic antioxidants than almost any other type of food? Learn more facts about cocoa and how it benefits you by heading to Chocolate.news today.\n\nSources include:\n\nScience.news\n\nLiveScience.com\n\nACS.org\n\nNCBI.NLM.NIH.gov\n\nBusinessInsider.com\n\nLivestrong.com Stressed-out cacao trees produce more nutritionally potent chocolate – new research", "https://www.naturalnews.com/2018-02-12-opioid-drug-trafficking-another-excellent-reason-why-congress-should-fund-trumps-border-wall-now.html": "(Natural News) One of the least-discussed reasons why President Donald J. Trump’s proposed border wall is so needed is because it will help reduce the amount of highly potent, deadly drugs flowing into the country. While no one seriously believes that a wall can stop all drugs flowing into the country, a nearly-impenetrable border-length barrier would certainly help.\n\nOver the weekend a story broke that brings the border wall issue and the problem of dangerous drug proliferation front and center; hopefully, it will be impactful enough to move this debate forward and take all the “controversy” out of the Trump wall discussion.\n\nAs reported by several outlets including the UK’s Daily Mail, police in Boston seized more than 33 pounds of fentanyl, a synthetic opioid that is 80 times stronger than morphine and which is so deadly that it could literally kill every single person in the state of Massachusetts (I’ll save you the trouble of looking it up — that’s about 6.8 million).\n\nPolice rounded up dozens of suspects belonging to a gang that was selling the potent drug on the streets of Bean Town. But here’s the “wall” link: The gang has ties to the notorious (and deadly) Sinaloa Cartel, the very same one that was once led by equally notorious Joaquin “El Chapo” Guzman.\n\nIncluded in the drug bust, which followed a six-month investigation including electronic surveillance, were another 30-odd pounds of other drugs including heroin, cocaine, and opiate tablets, along with $300,000 in drug money. Thirty-seven suspects were arrested as well including gang leader Robert Contreras, who is believed to have direct ties to the Sinaloa cartel; it’s not yet clear if any of them were in the country illegally, but I’d bet a day’s pay that some of them were.\n\nAnd Mexican leaders want to lecture Trump on the ‘absurdity’ of his border wall. (Related: Synthetic opioids hit the streets, causing deadly side effects.)\n\n“I want to be clear about the size and scope here,” said District Attorney Daniel Conley, the Daily Mail reported. “Massachusetts’ fentanyl trafficking statute covers quantities greater than 10 grams. That threshold represents less than 1/1000th of the quantity we’ve taken off the street.\n\n“Individuals who buy and sell at this level aren’t users,” he continued. “They’re not small-time dealers, either. They’re certainly not selling to support a habit. They’re trafficking in addictive substances that claim more lives in Massachusetts than all homicides, all suicides, and all car crashes, statewide, combined.”\n\nHe added that the number of overdoses that could have been caused by the amount of fentanyl seized “is truly staggering.”\n\n“You take a sweetener packet that has 1,000 milligrams in it that you put in a cup of coffee,” said DEA special agent in charge of the New England Division Michael J. Ferguson. “It takes only two milligrams [of fentanyl] and it’s lights out for an individual.\n\n“We’re talking a couple of grains of salt or sand,” he continued. “It can kill you if you inject it into your arm, if you snort it up your nose or simply breath it in the air. Drug traffickers are now lacing fentanyl not just with heroin, but with cocaine as well. As well as in pain pills, counterfeit pain pills made to look like Percocet.”\n\nIn other words, this stuff is not just deadly, but it’s being sold specifically to kill, and that’s just what it does.\n\nA lot.\n\nSo Trump’s border wall isn’t just a talking point anymore. It’s a national security imperative (or it ought to be). Because if the supply of fentanyl that Boston cops just captured had been added to, say, the water system in Boston and throughout the state, perhaps as a form of terrorism, there’d be a lot of fresh graves in one of our 13 original states.\n\nJ.D. Heyes is editor of The National Sentinel and a senior writer for Natural News and News Target.\n\nSources include:\n\nDailyMail.co.uk\n\nNaturalNews.com Opioid drug trafficking: Another excellent reason why Congress should fund Trump’s border wall NOW", "https://www.naturalnews.com/2018-02-11-the-left-attacks-science-demands-trump-supporting-scientist-be-purged-from-the-american-museum-of-natural-history.html": "(Natural News) Have you ever noticed that liberal democrats politicize things that no one in their right mind would ever think to make political? Immediately following a mass shooting, they skip the mourning process and go straight to talking about gun control. Barack Obama once used a speech he was giving to the military to push his radical climate change agenda. The NFL has become politicized too, and even fun holidays like Halloween – God forbid your child goes trick-or-treating dressed as Pocahontas.\n\nIn their latest move to politicize and ruin all that is fun and wholesome, the liberals are setting their sights on the American Museum of Natural History. If you’ve ever had a chance to visit, chances are politics didn’t even enter your mind; as a matter of fact, one of the main reasons why people visit places like the American Museum of Natural History in the first place is to get away from politics. But now, 182 self-proclaimed “scientists” (who are probably just liberal activists, let’s be honest) have penned an open letter to the AMNH urging them to turn away donors that don’t buy into the climate change hysteria.\n\n“The American Museum of Natural History in New York (AMNH) is a treasured and influential institution,” the letter reads. “Museums must be protected as sites that build understanding, help the public make meaning, and serve the common good. We are concerned that the vital role of science education institutions will be eroded by a loss of public trust if museums are associated with individuals and organizations known for rejecting climate science, opposing environmental regulation and clean energy initiatives, and blocking efforts to reduce pollutants and greenhouse gases.”\n\nThe letter then goes on to call out certain organizations by name, stating that Rebekah Mercer and the Mercer Family Foundation (who are the primary financiers behind Breitbart News) have donated almost $6 million to “climate science denial projects” since 2008.\n\nOf course, all of this has absolutely nothing to do with science or the integrity of the AMNH. These so-called “scientists” are probably well aware that people who visit the American Museum of National History don’t have politics on their minds while gazing into a display case at a dinosaur skull, but they penned this letter anyway as a way of viciously attacking those that they disagree with. (Related: Climate alarmists are demanding the imprisonment of climate change skeptics, and want to charge them with murder.)\n\nFurthermore, just as a general rule of thumb, science and politics should never be mixed together. The former is supposed to use facts and objectivity to study what is, while the latter is about what ought to be. What we see the liberals do far too often is make science about what ought to be rather than about what is, usually as a means of advancing certain agendas like man-made climate change or the idea that there are more than two genders.\n\nLast month, PJ Media reported on an event being held at UC Santa Cruz called “Research Justice 101: Tools for Feminist Science,” which essentially encouraged scientists to only pursue research that is socially just, even if they have to ignore the facts and evidence in the process. The description of the event explains that participants will be asked to consider a number of questions, such as “Who benefits? Who is harmed? Who is most vulnerable?… And ultimately, who do we do science for, and why?” It goes on to say that the event will give participants the resources that they need to make their research communities more “inclusive, equitable and attentive to social justice.”\n\nPolitics is important, but there are certain things that it just shouldn’t be mixed in with. Because if science is allowed to be politicized, then is it really science at all? Read Science.news for more news on real science.\n\nSources include:\n\nBreitbart.com\n\nPJMedia.com The Left attacks SCIENCE, demands Trump-supporting scientist be PURGED from the American Museum of Natural History", "https://www.naturalnews.com/2018-02-12-review-of-nuclear-damage-from-hiroshima-fukushima-focuses-on-dangers-of-nuclear-radiation.html": "(Natural News) As the whole world continues to cope with the realities brought forth by nuclear power and nuclear weapons, one review of the nuclear damage inflicted upon the cities of Hiroshima and Nagasaki puts the spotlight on just how dangerous they truly are. Written by Eiichiro Ochiai, a Japanese researcher from the University of Tokyo, and published by the Center for Research on Globalization, the review focuses on the devastating effects of nuclear weapons and radiation, and calls out for nations of the world to ban them entirely.\n\nAccording to Ochiai, it’s quite strange how it’s taking the world so long to realize that relying on nuclear technology can only be disastrous in the long run. “The dangers of nuclear arsenals are obvious,” he says, “and yet it took more than half a century to establish the nuclear weapon ban treaty (NWBT).” The dangers of nuclear arsenals are ever-increasing, and it may well be as Ochiai says later in his review: “The creation of this weapon is one of the gravest mistakes Homo sapiens has made.”\n\nTo get to the heart of Ochiai’s argument for the ban of the use of nuclear weapons, it’s important to understand the major effects of resulting nuclear explosions. The two visible and perhaps most recognizable effects of nuclear explosions are tremendous amounts of heat and powerful wind blasts. These are the things you normally see when nuclear blasts are depicted in media: A bright flash of light suddenly appears in the distance, basically created out of thin air, and a mushroom cloud forms right on top of it as a fatal blast of wind rushes outward in all directions to carry the heat produced.\n\nAnother effect that is associated with nuclear blasts is radiation, which comes from the nuclear fission reaction that causes the explosion in the first place. It is said that with a high enough level of radiation, it’s possible for people to die instantly. Current estimates show that a radiation dose higher than 10 sieverts can instantly kill a person. Evidently, that was the case with all people located within one kilometer from the hypocenter of the nuclear explosions that happened in Japan. Those who managed to somehow survive the explosions and the ensuing high-dose radiation still suffered ill effects. And they were even branded for life: They were afterwards referred to as “hibakusha” or the survivors of the atomic explosions.\n\nDespite being able to survive the explosion and radiation, however, there was something else that affected the victims of the Hiroshima and Nagasaki blasts that Ochiai rightly pointed out: It even affected those who weren’t there when the nuclear bombs exploded. And that is the nuclear fallout, which is said to be “the major factor causing death and the ill effects on the people who came into Hiroshima and Nagasaki a few days after the explosion.” Indeed, the fallout was so bad that people who were not exposed to radiation from the nuclear explosion still got their dose from fallout-induced radiation.\n\nFallout is referred to simply as a substance that could get into the human body by way of breathing or by consuming contaminated foods and water. Although numerous people were able to survive after the explosion, the fallout affected them in other ways. Notably, the majority of the hibakusha fell victim to many ill effects afterwards, including cancer, and the fallout is being pointed at as the direct cause.\n\nAs a final negative consequence, Ochiai points out that there still isn’t a proper and fully-working way of disposing nuclear radioactive waste. As such, the radioactivity affects not just humans but also any nearby chemical substances. He concludes his review by saying that mankind could do without nuclear energy and should rely on renewable natural energy sources instead. “There is no good reason for the nuclear energy,” he said, “because it is not green nor cheap, though the industry claims so.”\n\nWhen you look at things from his perspective, you’ll see that it makes sense. Now if only those countries with actual nuclear arsenals would listen, then perhaps they might heed his advice.\n\nLearn more about what has happened in Fukushima through FukushimaWatch.news.\n\nSources include:\n\nGlobalResearch.ca\n\nAPJJF.org Review of nuclear damage from Hiroshima, Fukushima focuses on dangers of nuclear radiation and the need to ban such weapons", "http://www.naturalnews.com/2018-02-10-las-vegas-shooter-stephen-paddock-was-on-sedative-hypnotic-psychiatric-medications-autopsy-report.html": "(Natural News) Las Vegas shooter Stephen Paddock was taking mind-altering psychiatric medications at the time he carried out the Mandalay Bay mass shooting, reveal autopsy records obtained by the Las Vegas Review-Journal.\n\n“Amounts of nordiazepam, oxazepam and temazepam, which are consistent with the anti-anxiety drug Valium, were found in his urine, a toxicology report shows,” the Review-Journal reports. No alcohol-related chemicals were found in the autopsy, according to the report.\n\nThe local paper also explains one of the documented side effects of taking psychiatric medications:\n\nDiazepam is a sedative-hypnotic drug in the class of benzodiazepines, which studies have shown can trigger aggressive behavior.\n\nPaddock’s blood also contained brain-damaging heavy metals like lead and mercury\n\nSurprisingly, toxicology results also reportedly detected arsenic, lead, selenium and mercury in Stephen Paddock’s blood, according to the report. Mercury is well known to cause extensive neurological damage that can lead to aggressive, destructive behavior.\n\nThese findings only add to the mystery surrounding the Oct. 1 mass shooting tragedy, which nearly all intelligent observers who aren’t brainwashed by the fiction-pushing media have concluded could not have been carried out by a single individual.\n\nNow, the fact that Paddock’s body carried notable levels of a sedative-hypnotic drug combined with brain-damaging heavy metals (lead and mercury) only adds to skepticism about the official story.\n\nPsychiatric drugs linked to nearly all mass shootings\n\nPsychiatric medications, of course, are linked to the vast majority of so-called “mass shootings” that have taken place over the last two decades. See the PsychDrugShooters.com website for an exhaustive list of those events.\n\nOn the other hand, a single individual whose brain is poisoned with mind-altering drugs and heavy metals seems extremely unlikely to have been able to carry out the coordinated, precision-based attack that killed 58 people. It’s also apparent from the evidence found in Paddock’s room that his collection of gear, ammunition and tactical knowledge required months — if not years — of meticulous planning by someone well-versed in tactical engagements.\n\nAdding to the skepticism surrounding the situation, the Las Vegas Police Department has been caught multiple times contradicting its own announcements and withholding important information from the public. Independent media reporter Shep Ambellas from Intellihub has perhaps offered the most ongoing coverage of the apparent cover-up, publishing articles like, “Vegas killer Stephen Paddock’s prostitute lover vanished before deadly shooting spree, said Paddock was under government mind control.”\n\nAlthough I haven’t spent much time researching this cover-up, I’m the person who went public with the acoustic forensic analysis of the shooting, proving that more than one shooter was present. You can watch that video here:\n\nMost likely explanation: The shadow government is covering up the truth, whatever it might be…\n\nIt’s unlikely, by the way, that “official sources” will ever reveal the full truth about what happened at Mandalay Bay. Never forget that ISIS claimed credit for the shooting, insisting that Stephan Paddock converted to a radical form of Islam before carrying out the murder.\n\nThere are anti-American elements operating inside the shadow government — sometimes called the deep state — that actively seek to obfuscate any evidence linking domestic terrorism to radical Islam. Many of those same deep state traitors, we now know, actively conspired to overthrow the American Republic by secretly spying on Donald Trump’s campaign team through the illegal acquisition of a FISA surveillance warrant.\n\nFormer President Obama, for example, was a practicing Muslim who accidentally let slip his “Muslim faith” in a televised interview with George Stephanopoulos:\n\nObama also ordered ISIS investigations shut down across the federal government, including ordering the destruction of an extremely valuable government database on Muslim extremists. That database was put together, in part, by a federal investigator named Philip Haney who worked for Homeland Security. He went public with all this on national TV, warning that the Obama regime interfered with the federal government’s intelligence operation that could have stopped other ISIS-inspired mass shootings:\n\nThe revelations contained in the recently released FISA memo reveal, without question, that the Federal Bureau of Investigations (FBI) is, at its highest levels, hopefully corrupt and dishonest. If they could cover up the attempted stealing of an American election by pro-Clinton deep state elements, altering the evidence of what happened in Las Vegas is child’s play.\n\nThe bottom line? The American people are being lied to about every significant event so that the “facts” might be twisted to support the totalitarian agendas of those who currently run things (including the news media). It’s also possibly, by the way, that we are being lied to about Stephen Paddock’s autopsy results as part of an effort to control the narrative.\n\nFor this reason, by skeptical of all official reports regarding such events. The only way I would be completely confident in the autopsy results is if I somehow got a sample of Paddock’s urine and tested it myself, in my own lab. (Somehow, I doubt federal authorities are going to send me that sample…)\n\nFollow more news on mass shootings at Shootings.news. Las Vegas shooter Stephen Paddock was on a “sedative-hypnotic” mind-altering psychiatric medication – autopsy report", "http://www.naturalnews.com/2017-03-29-smart-meters-could-be-over-billing-you-by-a-whopping-582.html": "(Natural News) Most people understand that utility bills are a necessary evil if they want to live in the modern world – even if utility bills eat up a large portion of monthly income. That said, few are willing to pay more than they should be paying, and yet, according to a stunning new report, some people are paying more than they should. A lot more.\n\nAs reported by web site Boing Boing, a research team from the University of Twente in Enschende, Netherlands, and Amsterdam University of Applied Sciences documented billing inaccuracies in a paper that reviewed the efficacy of so-called “smart” electric meters, ranging from -32 percent to +582 percent of the actual power consumed in a month’s period.\n\nThe paper also noted that, ironically, the overbilling is mostly due to older power-saving features because they introduce line noise that interferes with the wireless signal and thereby ‘confuses’ the meters. (RELATED: Read SILENT KILLER: Smart Meters Are Destroying Your Health.)\n\n“Static, or electronic, energy meters are replacing the conventional electromechanical meters. Consumers are sometimes complaining about higher energy readings and billing after the change to a static meter, but there is not a clear common or root cause at present,” an abstract of the findings states. “Electromagnetic interference has been observed between active infeed converters as used in photo-voltaic systems and static meters. Reducing the interference levels eliminated inaccurate reading in static meters.”\n\nIn all, five of nine smart meters that were tested provided readings that were substantially greater than the real amount of energy utilized, while two actually gave readings lower than the amount of power consumed.\n\nResearchers found the biggest discrepancies when they joined dimmer switches with LED and energy-saving light bulbs.\n\nUpon finishing their experiments, researchers then took apart the tested smart meters to see if they could find out what was causing the massive deviations. In the process, the three-man team of researchers found that the meters which provided the dramatically higher usage rates used a Rogowski Coil in the construction, while meters that gave artificially lower readings employed Hall effect-based sensors. But both modes of construction inaccurately measured the actual amount used.\n\nIt wasn’t clear from the abstract whether the tested meters were actually in use, either in the Netherlands or elsewhere. If both of those types of meters are being used, then some are paying less for the electricity they use, while most are paying much, much more.\n\nIn addition to costing consumers far more money, some researchers contend that the meters themselves are also health hazards. And some lawmakers at the state level are taking action.\n\nState Sen. Patrick Colbeck of Michigan testified before the state House Energy and Technology Committee in early March regarding a piece of legislation – HB 4220 – that would permit homeowners to opt out of getting smart meters installed on their dwellings without having to pay a fine. He has based his opposition to smart meters on research indicating that they can cause a wide array of health problems, in addition to a cyber security threat posed by their installation and use, since they are wireless and transmit data to the utility company. (RELATED: Smart meters use unsafe, cancer-causing technology.)\n\nDuring his testimony, Colbeck said he thinks smart meters are “putting our homes, our nation and, frankly, some of the power suppliers at risk.”\n\nOthers have issues with the privacy aspect of smart meters. Electric use data hacked from a wireless smart meter can be used by clever criminals to determine when people are home and when they are gone – to work, in particular – which provides them a window to enter the home without expecting anyone to be there.\n\nThere are also physical dangers to smart meter use. As Natural News has reported, some smart meters that are mandated by government have spontaneously caught fire, putting residents at risk of loss of life and property. Learn more at SmartMeters.news.\n\nJ.D. Heyes is a senior writer for NaturalNews.com and NewsTarget.com, as well as editor of The National Sentinel.\n\nSources:\n\nBoingBoing.net\n\nNaturalNews.com Smart Meters could be overbilling you by a whopping 582%", "http://www.naturalnews.com/2018-02-10-why-some-people-dont-eat-sushi-nine-foot-tapeworm-removed-from-mans-rectum-in-singapore.html": "(Natural News) A nine-foot tapeworm was removed from a man’s rectum in Singapore, according to a report by the Daily Mail Online. The unnamed man did not know that a tapeworm was growing inside his intestine because there were no symptoms of having a tapeworm, such as severe abdominal pain. Experts at the Department of Microbiology of Singapore General Hospital believe that the man became infected most likely because of ingesting raw fish.\n\n“The patient was somewhat appalled when the worm was passed out via the rectum,” said Hsu Li Yang, an infectious diseases expert at the hospital.\n\nHsu shared the details of the 2016 case to elaborate the issue of people being infected with parasites after consuming raw or undercooked seafood. He also explained that the worm was an actual tapeworm because no other human parasite could grow that long.\n\n“The question is what tapeworm, which will also help answer how the patient had acquired the worm,” he said.\n\nInfections from tapeworm occur after eating the larvae of Diphyllobothrium found in freshwater fish like salmon. Typically, humans get infected from eating sushi or raw fish that has been infected with the worm in its larvae stage. The hatching larvae stick themselves to the wall of the intestines of the fish; then the worms infect the flesh of the fish. As soon as a person gets infected, a tapeworm will grow inside the intestine as long as 15 meters within a few weeks. It can continue to live for years and can remain undetected for weeks or months, as well as release its eggs that infect other body parts of the person. Furthermore, if the larvae start to move to other parts of the body, they can begin to eat away at the liver, eyes, heart, or brain and cause life-threatening conditions. Symptoms of tapeworm infections include fatigue, constipation, and abdominal discomfort, which can be very mild that the victim may not observe anything wrong.\n\nConsumption of raw fish in Singapore and all around the world continue to gain attention in the middle of the increasing popularity of sashimi. Cases of tapeworm infections not only increased in more impoverished areas but also in more developed countries.\n\nIn California, a man who ate sushi went to the emergency room of Community Regional Medical Center after finding a five and a half feet tapeworm that was “wiggling out” as he sat on the toilet, according to another Daily Mail Online report. Dr. Kenny Bahn told this story on the podcast This Won’t Hurt A Bit. The patient thought at first that his intestines were coming out, but when he started to remove the worm, it started moving. The man reported that he ate raw salmon every day, which most likely caused the infection. (Related: Beware: US salmon may be crawling with Japanese tapeworm, say scientists.)\n\nPreventing tapeworm infections\n\nTo reduce the risk of getting infected by tapeworms, refrain from eating raw or undercooked pork, beef, or freshwater fish. Prepare meat and fish well and cross-contamination between raw meat or fish and cooked dishes. Wash vegetables and fruits before eating them. Remember to wash hands with soap and water before preparing food, before eating, after using the toilet, and after close contact with animals. Lastly, make sure that the water you drink is clean whenever you travel abroad.\n\nIf you’d like to read more news stories and studies about raw foods, visit RawFood.news.\n\nSources include:\n\nDailyMail.co.uk 1\n\nDailyMail.co.uk 2\n\nNHS.uk Why some people don’t eat sushi: NINE foot tapeworm removed from man’s rectum in Singapore", "https://www.naturalnews.com/2018-02-12-medical-monstrosity-doctors-creating-three-parent-babies-to-be-carried-to-term-by-female-volunteers.html": "(Natural News) With all the Frankenstein-like science that we’ve been seeing in recent years, it was only a matter of time before scientists found a way to create babies using three parents. Now, doctors in the UK have been given the green light to create three-parent babies.\n\nThe country’s fertility regulator is allowing doctors at Newcastle Fertility Centre to create healthy embryos for two women who have a risk of passing on a genetic disease to their children. The identity of the women is protected by patient privacy laws, but they are said to have gene mutations that cause a rare condition called Merff syndrome, which worsens over time and can lead to early death. The procedure will be carried out using fertilized eggs made with standard IVF along with DNA from female donors.\n\nThese women will undergo a radical IVF procedure known as mitochondrial donation. The procedure entails creating fertilized eggs with IVF, but instead of letting them develop into embryos, the parents’ chromosomes are then removed and put into a donor egg with its own genetic material removed. The resultant embryo has all of the chromosomes of the parents but the damaged mitochondria from the mother are replaced with healthy ones from the donor. Under normal circumstances, the mitochondria would have been passed from the mother to the child, who would have inherited the Merff mutation.\n\nIt’s not the first time such a procedure will be carried out. Doctor John Zhang of New York carried out mitochondrial donation therapy on a woman who had Leigh syndrome, and she went on to successfully gave birth to a baby boy who did not inherit the deadly disorder. Zhang was forbidden by the FDA to perform the therapy in the United States, so he implanted the cell in Mexico.\n\nDesigner babies the next step?\n\nWhile many can sympathize with the plight of women who fear their babies will be born with a fatal illness that could also seriously impact their quality of life, the technique is raising a lot of concerns about the possibility of “designer babies” being created one day.\n\nThe practice has been condemned by the FDA, who said that as a procedure that modifies a human egg cell, it is both unethical and illegal. One big reason for their stance is that scientists cannot say for certain what impact this technique is going to have on the babies it is used to create, especially in the long term. In addition, two embryos are essentially destroyed in order to create the viable egg cell.\n\nMoreover, a study carried out by researchers from the Oregon Health and Science University showed that the procedure isn’t always effective. In tests that used the procedure in mice, the original mother’s mitochondria reasserted itself over time and essentially eliminated the donor mitochondria in 15 percent of cases. The researchers say it’s something that could happen at any point during the development of the fetus or even when the child produced by the procedure reaches adulthood.\n\nOther studies, meanwhile, indicate that if the mitochondrial and nuclear DNA do not recognize one another properly, it could lead to poor health and infertility, even when just 0.2 percent of the mitochondrial DNA has been changed.\n\nInterfering with nature in this way has backfired in the past, and it remains to be seen whether this turns out to be the great solution that some in the medical community seem to believe it is. See more examples of Medical Extremism at MedicalExtremism.com.\n\nSources for this article include:\n\nTheGuardian.com\n\nFuturism.com\n\nNaturalNews.com\n\nNaturalNews.com Medical monstrosity: Doctors creating “three-parent” babies to be carried to term by female volunteers", "https://www.naturalnews.com/2018-02-11-zebrafish-study-taking-migraine-meds-while-pregnant-linked-to-autism-in-children.html": "(Natural News) A research study conducted at the Oregon State University and Wenzhou Medical University showed that exposure to a compound used to treat migraines and seizures causes symptoms related to autism. The researchers used zebrafish as a model to conduct a study on autism spectrum disorders (ASD) and their causes.\n\n“The main thing we want to emphasize is the usefulness of this model. We can very quickly look at genetic and environmental factors associated with autism that are very difficult to understand in humans. The ease and speed of the genetic analysis in this model make it very attractive compared to a rodent model,” said co-author Courtney Roper, a postdoctoral fellow in OSU’s College of Agricultural Sciences.\n\nASD consists of five related neurodevelopmental diseases that are defined by extreme impairments in social interactions, inability to have proper modes of verbal and nonverbal communications, repetitive behavioral patterns, and weird sensitivity to sensory stimulation.\n\nThe causes of autism are not known, but it has been linked with both genetic and environmental components, including prenatal exposure to two drugs: thalidomide, a sedative linked to severe birth defects, and valproic acid, which is used to prevent migraine headaches. (Related: Autism, mercury, aluminum and vaccine-induced encephalopathy)\n\nAutism diagnoses have been rising since the 1990s. About one child in 68, will be classified as having autism spectrum disorder, according to the Centers for Disease Control and Prevention (CDC).\n\nASD affects all ethnic, socioeconomic, and racial groups but is around 4.5 times more common among boys (one in 42) than girls (one in 189).\n\nZebrafish are small freshwater species that go from a tiny cell to a swimming fish in just five days. They reproduce at a fast rate and are essential for studying the genetic components of vertebrates, including the effects of environmental contaminants and pharmaceuticals on early embryonic development.\n\nZebrafish have an uncanny likeness to humans at the genetic, cellular, and molecular levels; this means that the implications of findings associated with zebrafish are extremely relevant to humans.\n\nStudies on embryonic zebrafish are particularly important, for embryonic zebrafish develop quickly, are transparent, and can easily thrive even in small amounts of water.\n\nThe research’s findings concluded that treating zebrafish embryos with valproic acid starting eight hours after fertilization results in a significant rise in the ASD macrocephalic phenotype, that is, an enlarged head.\n\nIt also caused hyperactivity in embryos and larvae.\n\n“In addition to the ASD-like characteristics, we observed an overgrowth of mature newborn neurons and neural stem cells in the developing brain after VPA exposure. Next, now that we have models for behavior established, is to start looking at the genetic and environmental interactions, examining some of the potential factors that might be driving autism in humans,” Roper said.\n\nThe findings were published in the journal Neurotoxicology and Teratology. The National Natural Science Foundation of China supported the conduct of this research.\n\nMore on autism spectrum disorder\n\nSome of the behavioral and medical conditions that are associated with autism spectrum disorder include anxiety, attention deficit hyperactivity disorder, gastrointestinal problems, depression, epilepsy, and sleep disturbances.\n\nAccording to the CDC, children with autism are:\n\n1.8 times more likely than children without developmental illnesses to have asthma\n\n1.8 times more likely to have eczema\n\n1.8 times more likely to have food allergies\n\n2.2 times more likely to have chronic headaches\n\n3.5 times more likely to have chronic diarrhea\n\nFor more stories on disorders of the mind and behavior, visit Mind.news.\n\nSources include:\n\nScience.news\n\nScienceDaily.com\n\nAutismSpeaks.org Zebrafish study: Taking migraine meds while pregnant linked to autism in children", "https://www.naturalnews.com/2018-02-12-california-state-lawmaker-held-up-as-metoo-womens-champ-accused-of-serial-sexual-harassment.html": "(Natural News) You have to hand it to Democrats — they are some of the world’s most amazing hypocrites and they follow the old expression, “If you’re going to do something, do it well.”\n\nCalifornia Assemblywoman Cristina Garcia, a high-profile #MeToo advocate whose championing of the issue earned her national attention, has herself been accused of multiple instances of sexually harassing at least one male legislative staffer and a male lobbyist, as reported by Politico.\n\nThe site noted she herself is now the subject of a state legislative investigation following a report she sexually harassed and groped the former legislative staffer, adding:\n\nIn December, when Time magazine announced that “Silence Breakers” who spoke out against sexual harassment were its Persons of the Year, Garcia’s face was prominently included in the art accompanying the cover story.\n\nHowever, Daniel Fierro of Cerritos told the website that in 2014, when he was a 25-year-old staffer to Assemblyman Ian Calderon, Garcia — a powerful Dem lawmaker and chairwoman of the Legislative Women’s Caucus and Natural Resources Committee — groped him.\n\nHe noted that she got him alone following an annual Assembly softball game in Sacramento as he was cleaning up one of the dugouts. Fierro said Garcia — who appeared drunk — began stroking his back, squeezing his buttocks and tried to fondle his crotch before he managed to get out of there.\n\nFierro told Politico he didn’t report the incident, which happened before today’s #MeToo movement and state legislation to protect whistleblowing legislative staffers. (Related: Dem hypocrites NOW tell creepy Al Franken to REMAIN in Senate.)\n\nHowever, he said he mentioned the incident last January to his former boss Calderon, who then referred the matter to the Assembly Rules Committee, which is now investigating the claims.\n\nFierro isn’t the only one who was allegedly victimized by a woman who, if guilty, is this month’s biggest Democratic hypocrite. A prominent lobbyist in Sacramento is also claiming that Garcia accosted him as well at a political fundraiser for Gov. Jerry Brown (D). Speaking anonymously to Politico, he said she attempted to grab his crotch too:\n\nThe lobbyist, who represents a major industry association, said that Garcia appeared to have been drinking heavily at a fundraiser hosted by Governor Jerry Brown for state Senator Josh Newman at the de Veres bar in Sacramento. He said he was heading out the door in part to avoid the assemblywoman — who had been increasingly “flirtatious” and had called him on a few occasions before for late night drinks which he repeatedly declined.\n\nAs he attempted to leave the venue Garcia spotted him and asked, “Where are you going?” he said.\n\n“She came back and was whispering real close and I could smell the booze and see she was pretty far gone,’’ he said. “She looked at me for a second and said, “I’ve set a goal for myself to f*ck you.”\n\nAt that, the #MeToo champ “stepped in front of me and reaches out and is grabbing for my crotch,” the lobbyist told Politico. For him that was his “line in the sand,” and he stopped her. “I was four inches from her, eyeball to eyeball, and I said, ‘That ain’t gonna happen.’”\n\nThese allegations come on the heels of high-profile #MeToo activism by Garcia, now one of the state capital’s leading voices on the issue (try not to puke).\n\nShe was one of hundreds of women in Sacramento who signed onto to a letter with the hashtag #WeSaidEnough in protest of — what else? — sexual harassment, telling The New York Times that she has been a serial victim of harassment by men during the course of her legislative work.\n\n“Multiple people have grabbed my butt and grabbed my breasts,” she told the paper. “We’re talking about senior lobbyists and lawmakers.”\n\nRiiiight.\n\nLegitimate women activists against harassment, Politico noted, are concerned that if the allegations against Garcia are true it will damage the movement.\n\nOf course it will, but more than anything else, it will once again expose Democrats as they hypocrites they are on this particular issue alone.\n\nPaging Harvey Weinstein….!\n\nRead more of J.D. Heyes’ work at The National Sentinel.\n\nSources include:\n\nPolitico.com\n\nNaturalNews.com Such a hypocrite! California state lawmaker held up as #MeToo women’s champ ACCUSED of serial sexual harassment", "https://www.naturalnews.com/2018-02-11-vegan-diet-cures-psoriasis-woman.html": "(Natural News) A 20-year-old waitress claimed that she overcame psoriasis for good because of a strict vegan diet, according to a report by the Daily Mail Online.\n\nJessica Belshaw from Torpoint, Cornwall, said that the symptoms of her guttate form of psoriasis started when spots on her abdomen appeared when she was just 13 years old. Then, the disease covered her whole body in excruciating red, flaky patches. For years, she was on steroid creams, but later on decided to switch to natural healing about a year after suffering from severe steroid withdrawals, which caused her serious discomfort each time she missed a dose.\n\nBelshaw believes that her vegan, gluten-free, and mostly raw diet helps her manage her condition, in addition to yoga and meditation for managing her stress levels and preventing flare-ups. Aside from her vegan and gluten-free diet, she also eats plenty of raw foods and leafy green vegetables, drinks a lot of water, and limit her alcohol consumption. Even though she still experiences breakouts occasionally, she learned to accept her condition and encourages others to do the same. (Related: Psoriasis is becoming a pandemic)\n\n“My first advice would be acceptance, accepting who you are is the first stage in order to love who you are and heal your body,” Belshaw said.\n\nMore on psoriasis\n\nPsoriasis is a long-term autoimmune disease that causes the fast build-up of skin cells. This, in turn, leads to scaling on the surface of the skin. Commonly, inflammation and redness around the scale occur. Psoriatic scales are usually whitish-silver and turn into thick, red patches. There is a possibility that these patches will crack and bleed. Psoriasis can appear anywhere — on the eyelids, ears, mouth, and lips, skin folds, hands and feet, and nails. There are five types of psoriasis: plaque, guttate, pustular, inverse, and erythrodermic. The exact cause of this disease remains unknown. But what scientists know is that the immune system and genetics play major roles in the development of the disease. The primary symptoms of psoriasis include red, flaky, crusty patches, covered with silvery scales that shed easily and extreme itching and burning.\n\nHerbal remedies for managing and treating psoriasis\n\nListed below are some of the natural remedies for management and treatment of psoriasis.\n\nAloe vera – The gel of aloe vera can be applied to the skin for a maximum of three times a day. Some study shows that it can help lessen the redness and scaling associated with psoriasis.\n\n– The gel of aloe vera can be applied to the skin for a maximum of three times a day. Some study shows that it can help lessen the redness and scaling associated with psoriasis. Apple cider vinegar – Apple cider vinegar can act as a disinfectant which can help ease the scalp from itchiness due to psoriasis. However, do not apply this remedy if your skin is cracked or bleeding or if you have open wounds.\n\n– Apple cider vinegar can act as a disinfectant which can help ease the scalp from itchiness due to psoriasis. However, do not apply this remedy if your skin is cracked or bleeding or if you have open wounds. Capsaicin – The ingredient that makes chili peppers hot is called capsaicin. This can be added to creams and ointments which blocks nerve endings that transmit pain. This may help lessen the pain, inflammation, redness, and scaling due to psoriasis.\n\n– The ingredient that makes chili peppers hot is called capsaicin. This can be added to creams and ointments which blocks nerve endings that transmit pain. This may help lessen the pain, inflammation, redness, and scaling due to psoriasis. Epsom salts – Add Epsom salts or Dead Sea salts to a warm bath water and soak in the tub for around 15 minutes. This may help remove scales and alleviate itching. After getting out of the tub, apply a skin moisturizer.\n\n– Add Epsom salts or Dead Sea salts to a warm bath water and soak in the tub for around 15 minutes. This may help remove scales and alleviate itching. After getting out of the tub, apply a skin moisturizer. Tea tree oil – Tea tree oil, which is native to Australia, is said to possess antiseptic qualities and can be applied to the skin.\n\n– Tea tree oil, which is native to Australia, is said to possess antiseptic qualities and can be applied to the skin. Turmeric – Often studied for its strong anti-inflammatory and antioxidant properties, turmeric can also alter gene expression. A 2012 study review found that turmeric can change TNF cytokine expression, which is the reason why it helps minimizing psoriasis and psoriatic arthritis flare.\n\n– Often studied for its strong anti-inflammatory and antioxidant properties, turmeric can also alter gene expression. A 2012 study review found that turmeric can change TNF cytokine expression, which is the reason why it helps minimizing psoriasis and psoriatic arthritis flare. Oregon grape – Also known as Mahonia aquifolium, Oregon grape is a strong antimicrobial herb that is involved in immune response. Studies show that a cream that contains 10 percent of mahonia is efficient in treating mild to moderate psoriasis.\n\nRead more stories on diets at Naturopathy.news.\n\nSources include:\n\nDailyMail.co.uk\n\nHealthline.com\n\nPsoriasis.org 1\n\nPsoriasis.org 2 Vegan diet cures psoriasis: Woman, 20, is now off all traditional treatments after going gluten-free, vegan", "https://www.naturalnews.com/2018-02-11-e-coli-safety-precautions-to-guard-against-contamination.html": "(Natural News) Hundreds of thousands of people fall ill from E. coli contamination each year. Despite local outcry to improve food manufacturing practices, pathogenic E. coli is still a prevalent bacterium that continues to impact the healthcare system. The most common sources of foodborne infection of E. coli are raw fruits and vegetables, unpasteurized dairy products, and improperly cooked meat.\n\nE. coli is mostly spread through fecal contact. Food that comes into contact with either human or animal feces is more likely to have pathogenic E. coli. This should make preventing an infection easier, since the vector of contamination is in how food is prepared. However, complicated logistical practices make it difficult for health and government agencies to pinpoint where and how food is prepared and/or handled.\n\nThis guide will serve as a brief introduction to how you can guard against contamination.\n\nKnow where your food is coming from — The easiest way to avoid an infection is by sourcing your food from a reputable grocer. We recommend buying from your local farms. Not only does this help the community, but most local small farms don’t use pesticides or herbicides. If you can, try growing your own food — this way, you really know what you’re putting in your mouth. (Related: E. coli contaminates two-thirds of fresh chicken sold in UK supermarkets.) Practice proper food habits — You can guard yourself well by practicing good food hygiene practices. This includes washing produce thoroughly and cooking meat properly. Storing food correctly — Do not store fruits and vegetables in the same drawer as raw meat or fish. Doing so increases the risk of contamination. Wash your hands — Handle food with clean hands. Health groups recommend washing your hands with hot, soapy water for at least 20 seconds before and after handling food. Wash fruits and vegetables under running water. Use your common sense — If a fruit or vegetable looks abnormal, do not eat it. If it smells sour, tastes bitter, or feels different, do not eat it. It might be considered a waste of food, but if you die, that’s a waste of life too.\n\nOther things you should take note of:\n\nThere is debate on whether you should rewash pre-washed fruits and vegetables . There are no clear guidelines about this but a general rule of thumb is that it is safe to wash pre-washed fruits and vegetables once before you prepare or eat them. Don’t overwash them.\n\nDo not use the same cutting boards for vegetables and raw meat. This will prevent cross-contamination.\n\nWash cutting boards before and after you use them. Depending on what your board is made of, using soap may or may not be useful.\n\nOn E. coli\n\nEscherichia coli (E. coli) are bacteria found in food and in the intestines of animals and humans. E. coli refer to a large group of bacteria, with a majority of strains being harmless or beneficial to the gut. However, pathogenic E. coli can cause diarrhea, urinary tract infections, and other illnesses.\n\nAn E. coli infection manifests itself differently in people but general symptoms include stomach cramps, bloody diarrhea, and vomiting. Most people need a week to recover; but there are cases where an E. coli infection can be potentially fatal. Patients who experience severe diarrhea for more than three days accompanied by high fever should immediately seek medical attention.\n\nThe Centers for Disease Control and Prevention (CDC) estimates that there are 265,000 E. coli infections in the United States each year. This number is said to be higher as many infected patients do not seek medical help.\n\nYou can read more articles on E. coli and how to protect your food from other contaminants at FoodScience.news.\n\nSources include:\n\nDailyMail.co.uk\n\nFAO.org [PDF]\n\nCDC.gov Don’t make yourself ill with E. coli – safety precautions to guard against contamination", "https://www.naturalnews.com/2018-02-11-five-year-old-cured-of-epilepsy-by-eating-hundreds-of-avocados.html": "(Natural News) Sometimes eating the right foods can do a lot more to heal people than taking medication, as was illustrated recently by the remarkable turnaround of an epileptic British girl.\n\nFive-year-old Leafy Liu suffered from severe epilepsy from the time she was a baby, often suffering as many as 60 seizures per day. Conventional medicine was not able to stop the seizures, so her family decided to seek alternative treatments.\n\nAfter learning that the way in which our bodies burn up carbohydrates can trigger seizures in people with epilepsy, they decided to try switching her to a ketogenic diet. This way of eating includes lots of fats and a very limited amount if carbohydrates. Some of the foods allowed include eggs, fish, poultry, meat, leafy greens, and non-starchy vegetables. Full-fat organic dairy products are also recommended. A small amount of fruit is permitted, and sugars and refined carbs are very limited.\n\nAfter four years of going on the diet and eating a minimum of two avocados per day, the girl now has four seizures per year, which is a dramatic improvement. Her parents estimate they’ve spent around £1,200 on the avocados she has eaten so far, and their investment has clearly paid off.\n\nAt first, they thought the seizures were something that she would grow out of. She was just six months old when she had her first one. The 25-minute attack was terrifying, and she ended up hospitalized afterward.\n\nHer mother says that she stops responding and making eye contact during seizures, with her face fixing in one direction and her body shaking. The ordeal was also exhausting for Leafy, who would sleep for hours after each attack. While some were short, others would last as long as half an hour, and they were growing in frequency and severity.\n\nIn addition, Leafy seemed to catch colds and fevers often, which would trigger even more seizures. The family tried to move from the U.K. to Australia in hopes that the warmer weather would help her, but she had to be rushed to the hospital for a huge seizure right after their plane landed in the country. Once there, her problem grew worse and she was officially diagnosed with epilepsy.\n\nDramatic changes after just two days on Keto diet\n\nWorried about the side effects of anti-epilepsy drugs, they started her on the ketogenic diet. To their surprise, the change was noticeable in just two days. She was happier and more relaxed, and her seizures dropped off significantly.\n\nAccording to a study published in the journal Neurology, 79 percent of patients who went on the Ketogenic diet stopped having seizures as a result. Other statistics cited by the Epilepsy Foundation show that as many as 15 percent of children can become seizure-free by making this change, while more than half of kids who go on the diet will note their seizures reduced by at least half.\n\nBecause the diet lowers a person’s intake of carbohydrates, the body goes into a state called ketosis and produces ketones by breaking down fats in the liver. It is believed to burn ten times the amount of fat that a standard diet does, even in the absence of exercise.\n\nAccording to the Epilepsy Foundation, this diet can be helpful when children with seizures do not respond to medication. Studies have shown that it can help epilepsy conditions like Rett syndrome, Dravet syndrome, GLUT-1 deficiency, infantile spasms, Doose syndrome, and tuberous sclerosis complex.\n\nIt is often used under the guidance of dieticians because children need to eat the correct number of calories while ensuring they get 90 percent of their calories from fat. It might be challenging to adopt the diet in the beginning, but it’s far better than the side effects that come with seizure medications.\n\nSources for this article include:\n\nDailyMail.co.uk\n\nEpilepsy.com GOOD FATS HEAL: After conventional medicine failed, five-year-old cured of epilepsy by eating hundreds of avocados", "https://www.naturalnews.com/2018-02-12-better-safer-less-expensive-than-drugs-scientists-say-vitamin-d-could-replace-your-meds-prevent-reverse-disease.html": "(Natural News) When it comes to heart health, there are a few factors that commonly spring to mind, like eating a healthy diet and getting plenty of exercise. However, it turns out that one of the less-obvious approaches to heart health could be the best one: getting more sunlight.\n\nAccording to a study carried out by scientists from Ohio University, vitamin D3 can significantly restore cardiovascular system damage. Their findings were published in the International Journal of Nanomedicine.\n\nVitamin D3 has long been associated with bone health, but doctors and researchers have noticed that many heart attack patients have D3 deficiencies. While this is not necessarily causing the heart attack, it is raising people’s risks. Therefore, the researchers set out to use nanosensors to uncover the mechanism through which D3 could be beneficial to cardiovascular health.\n\nThe team’s nanosensors have a diameter that is 1,000 times smaller than a strand of human hair, and they’re capable of tracking the impact the vitamin has on single endothelial cells, which are vital regulators within in the cardiovascular system.\n\nThey found that vitamin D3 can stimulate nitric oxide, a key signaling molecule in regulating blood flow and preventing clot formation. It also lowers the oxidative stress seen in the cardiovascular system.\n\nPerhaps their most important finding, however, is its ability to sufficiently turn around the damage caused to the cardiovascular system by diseases like atherosclerosis, hypertension and diabetes. In addition, it can reduce a person’s risk of heart attack. Similar results were seen across the two ethnic groups studied, Caucasian Americans and African Americans.\n\nStudy author Dr. Tadeusz Malinski said: “There are not many, if any, known systems which can be used to restore cardiovascular endothelial cells which are already damaged, and Vitamin D3 can do it.”\n\nBest of all, it could help countless people avoid taking drugs with dangerous side effects. Dr. Malinski added:\n\n“This is a very inexpensive solution to repair the cardiovascular system. We don’t have to develop a new drug. We already have it.”\n\nTheir finding is significant given that heart disease is the top cause of death for American adults and is behind one out of every four fatalities. The researchers also believe that the vitamin could help repair damage found in other cell types, like the damaged brain cells that follow a stroke.\n\nAre you getting enough vitamin D?\n\nThe best way to get vitamin D is by spending some time in the sun. That’s because our skin synthesizes vitamin D when it is exposed to the UVB radiation in sunlight.\n\nThe precise amount needed will vary depending on your skin tone, your geographical latitude, and the time of day, among other factors, but even those with very dark skin need less than an hour in the sun to reap the benefits and many people can get by with 10 to 15 minutes. While people with lighter skin are more sensitive to skin damage and sunburn, their bodies are more proficient at making vitamin D using lower amounts of sun exposure than those who have darker skin.\n\nIt’s important to skip the sunscreen when heading outdoors with the aim of boosting your body’s vitamin D production, however, as even SPF 8 sunscreen can reduce your ability to make vitamin D in your skin by 95 percent. Experts say that most people will find it sufficient to expose around 10 percent of their body to the sun a few times a week.\n\nIf getting adequate sunlight is not an option for whatever reason, it’s possible to get this vitamin through supplements or your diet. Foods that are naturally high in Vitamin D include sardines, mackerel, salmon, raw milk, eggs, and tuna. It’s an effort that could pay off significantly, as vitamin D can also help protect against some types of cancer as well as illnesses like rickets and diabetes.\n\nRead more news about Vitamin D at VitaminD.news.\n\nSources for this article include:\n\nDailyMail.co.uk\n\nScienceDaily.com\n\nNaturalNews.com\n\nNaturalNews.com Better, safer, less expensive than drugs: Scientists say vitamin D could replace your meds, prevent and even reverse disease", "https://www.naturalnews.com/2018-02-11-customize-protein-shakes-health-needs.html": "(Natural News) Fuel is an important part of any training and exercise, and protein shakes have become increasingly prevalent as fuel sources for athletes, or just about anyone with fitness routines. In addition, there are protein shakes specifically tailored to provide nutrients for body recovery after strenuous activities. Training and exercise are highly individual in nature; making your own protein shakes is a great way to ensure you get the most out of the nutritional benefits that match your personal needs.\n\nCheck out some of these cost-effective alternatives and additions to your usual protein shake. Whip up your own protein shake according to your body’s needs; whether for training fuel or post-workout recovery:\n\nCoconut oil – One teaspoon of coconut oil contains 39 calories, while one tablespoon has 117 calories. Coconut oil has an abundance of medium chain fatty acids (MCFAs) which enables it to boost metabolism.\n\n– One teaspoon of coconut oil contains 39 calories, while one tablespoon has 117 calories. Coconut oil has an abundance of medium chain fatty acids (MCFAs) which enables it to boost metabolism. Dairy milk substitutes – Non-dairy milk alternatives such as almond, hazelnut or coconut-based milk generally contain higher levels of protein and lower sugar levels than dairy milk. These milk alternatives are also rich in calcium and vitamins. For those without an allergy, nut milk is an excellent option for training athletes. Meanwhile, peri and post-menopausal would benefit from the hormone-boosting qualities of soya milk, only in moderation. Unsweetened dairy milk alternatives are particularly good for those seeking a low-carbohydrate content, while those seeking an energy boost may choose the sweetened versions. Goat’s milk protein is also a good milk alternative; most people with lactose intolerance can handle goat’s milk.\n\n– Non-dairy milk alternatives such as almond, hazelnut or coconut-based milk generally contain higher levels of protein and lower sugar levels than dairy milk. These milk alternatives are also rich in calcium and vitamins. For those without an allergy, nut milk is an excellent option for training athletes. Meanwhile, peri and post-menopausal would benefit from the hormone-boosting qualities of soya milk, only in moderation. Unsweetened dairy milk alternatives are particularly good for those seeking a low-carbohydrate content, while those seeking an energy boost may choose the sweetened versions. Goat’s milk protein is also a good milk alternative; most people with lactose intolerance can handle goat’s milk. Egg whites – Eggs are excellent sources of protein. An egg white alone provides 3.6 g of protein, and a cup serving of egg white provides 26 g of protein. Boiled eggs are a convenient, cheap and highly effective snack for adding protein and replenishing energy stores.\n\n– Eggs are excellent sources of protein. An egg white alone provides 3.6 g of protein, and a cup serving of egg white provides 26 g of protein. Boiled eggs are a convenient, cheap and highly effective snack for adding protein and replenishing energy stores. Hemp – Most protein powders are pure protein, but hemp powders are a good source of omega-3 fatty acids and fiber. Hemp protein also contains all of the essential amino acids, which are necessary for building muscle. (Related: 4 Tasty, Healthy Alternatives to Whey Protein.)\n\n– Most protein powders are pure protein, but hemp powders are a good source of omega-3 fatty acids and fiber. Hemp protein also contains all of the essential amino acids, which are necessary for building muscle. (Related: 4 Tasty, Healthy Alternatives to Whey Protein.) Nut butter – Nut butters are one of the best sources of protein and energy. They are excellent ingredients for providing training fuel and replenishing lost energy. Peanut butter has the highest level of protein with eight grams for every two-tablespoon serving, while cashew and walnut butters contain six grams of protein per serving. Almond butter provides four grams of protein.\n\n– Nut butters are one of the best sources of protein and energy. They are excellent ingredients for providing training fuel and replenishing lost energy. Peanut butter has the highest level of protein with eight grams for every two-tablespoon serving, while cashew and walnut butters contain six grams of protein per serving. Almond butter provides four grams of protein. Oats – Oats are a highly nutritious source of fiber, complex carbohydrates, and protein. They contain 17 grams of protein per 100-gram serving, or six grams of protein per half a cup. Oats are a great source of amino acids, which makes them a perfect addition to natural protein shakes.\n\nThe addition of blended fruits and vegetables into your protein shake is also a great way to rehydrate lost electrolytes during training and workout naturally. Bananas are an excellent addition for pre-workout energy and replenishing energy stores post-training, due to their high potassium and magnesium content. These are vital electrolyte minerals that are depleted during exercise.\n\nDates are another highly nutritious option for energy, vitamins, and electrolytes. Like bananas, they are abundant in potassium and magnesium, as well as calcium and iron. Likewise, dark green leafy vegetables and berries are particularly rich in antioxidants, which help the body recover from strenuous physical activities.\n\nAntioxidant-dense foods like fruits and vegetables can help the body recover. Moreover, blending fruits and vegetables allows for nutrients to be readily assimilated by the body, which is why juicing and smoothies have become an essential part of fitness routines.\n\nSources include:\n\nSportsInjuryClinic.net\n\nMensHealth.com Customize your own protein shakes to fit your particular health needs", "https://www.naturalnews.com/2018-02-12-could-colonoscopy-put-you-at-risk-for-appendicitis.html": "(Natural News) In a recent study, scientists have suggested that patients who have undergone a colonoscopy may develop appendicitis a week after the procedure. The finding, which was published in JAMA Surgery, offers a new perspective on appendicitis and whether certain people are predisposed to it.\n\nWhile cases of appendicitis have been generally declining for the past couple of years, it still affects around seven percent of Americans every year. This has led researchers to conduct new inquiries on whether factors such as the environment, lifestyle or genetics play a role in the development of the condition, even in its decline.\n\nThe research, led by Dr. Marc Basson and his team from the University of North Dakota, tackles what has been theorized by previous researchers and offers new answers to the table. “A number of my patients had undergone colonoscopies by different providers. Then I saw these patients and they had appendicitis, some within a couple of days of the colonoscopy,” he explained in an article in Newswise. “And the patient would ask something like, ‘Gosh, did the colonoscopist do something wrong—why do I have appendicitis now?’ But since both colonoscopy and appendicitis are common things, the question became: Is there a real correlation here, or are these two random events that were just occurring together by chance?”\n\nFor the study, the team first gained approval and a waiver of informed consent from the University of North Dakota and the Fargo Veteran Affairs Medical Center, allowing them to look at screening codes from the U.S. Department of Veterans Affairs. In particular, they looked at data for colonoscopy cases between January 2009 and June 2014. Incomplete colonoscopy and sigmoidoscopy codes were excluded from the study. The team identified a total of 392,485 cases. They looked at the year after the procedures were undertaken, looking at codes for appendectomy and appendicitis. For the findings, they calculated the incidence rate ratio (IRR) for appendicitis a week after a colonoscopy and for the following weeks at a confidence interval of 95 percent. (Related: Sigmoidoscopy proven to be a better option than colonoscopy.)\n\nResearchers found out that cases of appendicitis or an appendectomy were coded more frequently a week following a colonoscopy. The results were the same even if the cases were broken down to reflect their respective age groups. On the first week, they found that 26 cases were coded for appendicitis, while 10 were coded for an appendectomy. The incidence rate was higher compared to other procedures such as bronchoscopy, knee replacement surgery, cataract surgery, or knee arthroscopy. Moreover, 12 patients were coded to have appendicitis and had an appendectomy a week following a colonoscopy. Over the following weeks, 79 patients were identified to have appendicitis.\n\nWhile the correlation between a colonoscopy and the increased risk of appendicitis is still unclear, the study offers some speculation. In particular, these include asking whether the changes in bacteria within the colon before a colonoscopy can increase the likelihood of inflammation, or whether the increased air pressure caused by it can affect colonic mucosa and cause predisposition to appendicitis.\n\nThe team clarified, however, that this study only indicates that there is an association between colonoscopy and appendicitis, but it does not discourage patients from going under the procedure when needed.\n\nAt the end of the day, Dr. Basson explained, this study points out that there is more work to be done to learn more about this correlation.\n\n“My hope is that this study will spur more conversation, more studies, so we can learn more about all of this,” he said. “There’s clearly more going on biologically with the appendix than we thought there was 100 years ago.”\n\nLearn more about the inherent risks of medical procedures by reading Medicine.news.\n\nSources include:\n\nScience.news\n\nScienceDaily.com\n\nNewswise.com Could a colonoscopy put you at risk for appendicitis?", "https://www.naturalnews.com/2018-02-11-boost-athletic-performance-naturally-with-pycnogenol.html": "(Natural News) A study discovered that Pycnogenol, a brand of nutritional supplement derived from French maritime pine bark extracts, can boost athletic performance. The study was carried out by a group of researchers from Chieti-Pescara University in Italy who used two types of athletic performances to determine the effects of the herbal extract upon athletic performance.\n\nIn the first part of the study, the group used a fitness protocol known as the Army Physical Fitness Test, which was first used by the U.S. Army and other armies in the world. The main exercises included in this test are push-ups, sit-ups, and a two-mile run. The fitness test is composed of doing as many sit ups and push ups as possible in two minutes. The study samples in this part of the study were composed of 147 men and women. The participants were then divided into two groups. Both groups were trained with the same general fitness training for eight weeks. Meanwhile, one of the two groups received an additional 100 milligrams (mg) of Pycnogenol per day other than the training. Furthermore, the researchers assessed the oxidative stress levels of the athletes with exercise.\n\nResults in this part of the study revealed that those who were given Pycnogenol daily showed improvement in their two-mile running times more than the other group. In addition, they also exhibited an increase in the number of push-ups and sit-ups in comparison with the control group. Moreover, it was revealed that oxidative stress levels were significantly lower in the Pycnogenol group.\n\nIn conducting the second part of the study, the research team assessed 54 men with a mean age of 38 as they trained for a triathlon in four weeks. Among the participants, 32 of them were administered with 150 mg of pycnogenol a day in addition to their training, while the remaining participants belong to the control group that only received training.\n\nDuring the four weeks of study, even though the two groups improved in all three events of triathlon — swimming, biking, and running — the pycnogenol group more showed improvements than the control group. Moreover, the average total completion time of the pycnogenol group for the final triathlon was 89 minutes and 44 seconds, while the control group averaged 96 minutes and five seconds. The Pycnogenol group improved their times in the triathlon more than two times than the control group. Both groups experienced cramps and running pain, but the pycnogenol group recovered faster than the other group.\n\nThe researchers believe that Pycnogenol supplementation, with proper hydration, proper training, and nutritional attention may enhance athletic training and performances.\n\nMore on Pycnogenol\n\nPycnogenol is the pine bark extract that is obtained from the maritime pine tree called Pinus pinaster. It contains the antioxidant proanthocyanidins which protect against free radicals that damage cells that cause diseases like cancer. Aside from enhancing athletic performance, there are other health benefits that pycnogenol can provide. These include:\n\nCardiovascular health – Pycnogenol can benefit the heart health. A study published in the journal Biomedical Reviews showed that pycnogenol could cause the blood cells to relax, which makes the flow of blood through the blood vessels easier. In turn, this lowers blood pressure and hypertension and improve circulation and LDL cholesterol levels. (Related: Pycnogenol can help with heart disease, inflammation, and diabetes)\n\n– Pycnogenol can benefit the heart health. A study published in the journal Biomedical Reviews showed that pycnogenol could cause the blood cells to relax, which makes the flow of blood through the blood vessels easier. In turn, this lowers blood pressure and hypertension and improve circulation and LDL cholesterol levels. (Related: Pycnogenol can help with heart disease, inflammation, and diabetes) Asthma – Pycnogenol can improve the lung function and asthma symptoms of asthma patients, according to a study published in the Journal of Asthma.\n\n– Pycnogenol can improve the lung function and asthma symptoms of asthma patients, according to a study published in the Journal of Asthma. Osteoarthritis – Because of its anti-inflammatory effects, pycnogenol improved the symptoms of osteoarthritis in a study published in Phytotherapy Research.\n\nIf you’d like to learn more about natural supplements, please visit SupplementsReport.com.\n\nSources include:\n\nGreenMedInfo.com\n\nLiveStrong.com Boost athletic performance naturally with Pycnogenol", "http://www.naturalnews.com/2018-02-11-five-year-old-cured-of-epilepsy-by-eating-hundreds-of-avocados.html": "(Natural News) Sometimes eating the right foods can do a lot more to heal people than taking medication, as was illustrated recently by the remarkable turnaround of an epileptic British girl.\n\nFive-year-old Leafy Liu suffered from severe epilepsy from the time she was a baby, often suffering as many as 60 seizures per day. Conventional medicine was not able to stop the seizures, so her family decided to seek alternative treatments.\n\nAfter learning that the way in which our bodies burn up carbohydrates can trigger seizures in people with epilepsy, they decided to try switching her to a ketogenic diet. This way of eating includes lots of fats and a very limited amount if carbohydrates. Some of the foods allowed include eggs, fish, poultry, meat, leafy greens, and non-starchy vegetables. Full-fat organic dairy products are also recommended. A small amount of fruit is permitted, and sugars and refined carbs are very limited.\n\nAfter four years of going on the diet and eating a minimum of two avocados per day, the girl now has four seizures per year, which is a dramatic improvement. Her parents estimate they’ve spent around £1,200 on the avocados she has eaten so far, and their investment has clearly paid off.\n\nAt first, they thought the seizures were something that she would grow out of. She was just six months old when she had her first one. The 25-minute attack was terrifying, and she ended up hospitalized afterward.\n\nHer mother says that she stops responding and making eye contact during seizures, with her face fixing in one direction and her body shaking. The ordeal was also exhausting for Leafy, who would sleep for hours after each attack. While some were short, others would last as long as half an hour, and they were growing in frequency and severity.\n\nIn addition, Leafy seemed to catch colds and fevers often, which would trigger even more seizures. The family tried to move from the U.K. to Australia in hopes that the warmer weather would help her, but she had to be rushed to the hospital for a huge seizure right after their plane landed in the country. Once there, her problem grew worse and she was officially diagnosed with epilepsy.\n\nDramatic changes after just two days on Keto diet\n\nWorried about the side effects of anti-epilepsy drugs, they started her on the ketogenic diet. To their surprise, the change was noticeable in just two days. She was happier and more relaxed, and her seizures dropped off significantly.\n\nAccording to a study published in the journal Neurology, 79 percent of patients who went on the Ketogenic diet stopped having seizures as a result. Other statistics cited by the Epilepsy Foundation show that as many as 15 percent of children can become seizure-free by making this change, while more than half of kids who go on the diet will note their seizures reduced by at least half.\n\nBecause the diet lowers a person’s intake of carbohydrates, the body goes into a state called ketosis and produces ketones by breaking down fats in the liver. It is believed to burn ten times the amount of fat that a standard diet does, even in the absence of exercise.\n\nAccording to the Epilepsy Foundation, this diet can be helpful when children with seizures do not respond to medication. Studies have shown that it can help epilepsy conditions like Rett syndrome, Dravet syndrome, GLUT-1 deficiency, infantile spasms, Doose syndrome, and tuberous sclerosis complex.\n\nIt is often used under the guidance of dieticians because children need to eat the correct number of calories while ensuring they get 90 percent of their calories from fat. It might be challenging to adopt the diet in the beginning, but it’s far better than the side effects that come with seizure medications.\n\nSources for this article include:\n\nDailyMail.co.uk\n\nEpilepsy.com GOOD FATS HEAL: After conventional medicine failed, five-year-old cured of epilepsy by eating hundreds of avocados", "https://www.naturalnews.com/2018-02-12-washington-post-cnn-npr-pbs-all-praise-murderous-north-korea-and-its-slave-state-leader.html": "(Natural News) Remember how I said that the Washington Post is a traitorous, anti-American, propaganda-laced “journo-terrorism” organization? Their coverage of the Olympics proves it, as WashPost joins NPR, ABC, NBC, CNN, the NYT and other left-wing propaganda rags in praising the murderous North Korean regime.\n\nYou know why they praise North Korea? Because that’s the kind of totalitarian society they want in the United States, run by radical left-wing tyrants like Hillary Clinton or Barack Obama. These are the same lying, left-wing propaganda rags that routinely attack the Constitution, the American flag, America’s founders, U.S. military veterans, Democracy and President Trump. But they praise North Korea’s murderous regime which relies on state-run media mind control over its population to remain in power.\n\nAs Truth Revolt points out:\n\nThe American news media are so consumed by hatred of their mortal foe Donald Trump that they turn a blind eye to the evil lunatic behind quite possibly the world’s most brutal regime, a man who has threatened to rain nuclear weapons down on America, and instead hype its presence at the Olympics as a diplomatic success. The left-dominated media would rather chastise Trump for standing up to Kim, because the left’s instinct is Blame America First, and because the left refuses to recognize totalitarian evil.\n\nWhy are none of us surprised that the discredited Washington Post would praise a murderous, dictatorial regime kept in power by media propaganda? That’s the only way Leftists can stay in power: By censoring the truth and brainwashing the people into believing that misery, destitution, corruption and tyranny are all “utopia.” (See my related article Believing in “progressivism” requires the complete abandonment of reality, logic, science and reason…)\n\nBreitbart.com’s John Nolte nails the rest of this story in his own article entitled 15 Media Outlets that Colluded with North Korea to Romanticize Their Slave State:\n\nNow that normal Americans have completely written off the disgraced institution of the American media, these amoral news outlets have been forced to pander to the only audience they have left — the far-left.\n\nThis is why, over the weekend, we witnessed almost every major news outlet prostitute itself to offer North Korea’s Hitler the kind of positive press coverage President Trump would never receive, even if he rescued our economy and decimated the Islamic State (oh, wait, he did).\n\nYep, over the weekend, CNN, the New York Times, the Washington Post, NPR, ABC, NBC, PBS, even the Wall Street Journal… these big media outlets (and more) colluded with murderous North Korean tyrants to normalize their slave state, to romanticize a murderous regime that comes complete with concentration camps, public executions in the thousands, and actual slaves.\n\nYep, over the weekend, the same media outlets that see only evil in Trump’s every utterance, colluded with a North Korea that regularly threatens our nuclear annihilation (and is aggressively seeking the means to do so), that starves and tortures its own people by the millions, and is in reality a massive prison camp disguised as a country.\n\nOh, and North Korea kills Americans … slowly … they die soon after they are returned home.\n\nNo one should have to explain to anyone with anything approaching moral literacy why there is no difference between North Korea and the Nazis — except for the tragic fact that communist North Korea has existed about 50 years longer than the socialist Third Reich.\n\nMore than anything else, though, in order to sustain their statist terror, what these murderous regimes count on is propaganda, and not just internal propaganda, but the complicity of western media outlets to put a shiny, happy face on their gangsterism — to normalize, even glamorize them.\n\nThroughout our own history, the American media have all-too often done exactly that. Monstrous tyrants such as Joseph Stalin, Fidel Castro, Hugo Chavez, Mao Tse-tung, Yasser Arafat, and Ho Chi Minh, have all enjoyed rock star coverage from our media.\n\nDriven by the statist impulses that animate too many on the political left, and their own seething hatred for everyone on the political right, our media has always been willing to idealize and homogenize the enemy of their enemy (conservatives) — even if that enemy engages in mass-slaughter and refuses even basic humans rights to billions.\n\nWhat you will see below is 100 percent real. Because this stuff is so shocking and amoral, we double-checked to ensure no forgeries slipped through. Oddly enough, there are plenty of forgeries flying around on social media, but none of that satire could top the grotesquerie of our media’s actual propaganda in favor of North Korea.\n\nAs you will also see below, much of the media’s collusion with North Korean is driven by this disgraced institution’s uncontrollable hatred of President Trump, his daughter Ivanka, Vice President Pence, and America itself.\n\nFinally, keep in mind that King Jong Un’s sister runs concentrations camp, that those North Korean cheerleaders are all slaves, and that this is exactly the kind of coverage this evil regime was hoping for…\n\nRead more at Breitbart.com. Washington Post, CNN, NPR, PBS all praise murderous North Korea and its slave state leaders", "https://www.naturalnews.com/2018-02-12-wild-rice-is-the-canary-in-the-coal-mine-for-lakes-and-streams-researchers-track-water-quality.html": "(Natural News) Determining the health of a lake or a stream could be done by looking for the presence of wild rice. According to a team of researchers from the University of Minnesota, wild rice is to these bodies of water as a canary is to a coal mine. Their sensitivity to their surroundings is an indicator of potentially adverse conditions.\n\nFor their study, the investigators analyzed over 100 streams and lakes across Minnesota from 2011 to 2013. Many of these are usually home to wild rice. Included in the researchers’ examinations were sediment core and surface water measurements, and water chemistry and depth.\n\nThey discovered that nearly all of the lakes and streams that had no wild rice also had the most elevated levels of sulfate. Even if the conditions were favorable for the development of wild rice, there was almost none when great amounts of sulfate were present in the water.\n\nThough rather than it being the sulfate itself, they found that the problem lay in sulfide. The soil that wild rice thrives on is home to anaerobic microbes as well. It’s these microbes that convert sulfate into highly toxic sulfide and make lakes, streams, and wetlands near-inhospitable for wild rice. Moreover, the plants that have been affected by sulfide undergo rapid decomposition and release nitrogen and phosphorus. On top of inhibiting plant growth, nitrogen and phosphorus increase algal blooms as well.\n\n“The results of our studies are important because they show that increases in sulfate in our lakes and streams can have multiple negative consequences for ecosystems, even though sulfate itself is relatively benign,” said study author Amy Myrbo. “Our research is based on hard science and showed the same results as other studies in artificial environments.”\n\nIn addition to being harmful to wild rice, the sulfate-converting microbes are equally dangerous to aquatic life. This because these same microbes produce methylmercury. According to WHO.int, methylmercury is an organic form of mercury that bioaccumulates and biomagnifies in fish and shellfish. People who eat these fish then become exposed to mercury themselves and experience mercury poisoning. This condition can result in the central, nervous, digestive, and immune systems becoming severely damaged.\n\n“Minnesota is unique among U.S. states and Canadian provinces in that it has a water quality standard that regulates sulfate. This isn’t just about wild rice. We’ve now found that putting sulfate into our water has consequences down the line, including more mercury in fish, changes in habitat for ducks, and changes in the food chain,” remarked Myrbo. (Related: Thousands of dead fish wash up on Lake Michigan)\n\nFrom here, Myrbo intends on continuing the team’s efforts in studying the waterways of Minnesota. “We feel that this is just the beginning of our research on studying Minnesota’s waters and the effects on communities,” she said.\n\nGo to Environ.news for more news stories and studies regarding the environment.\n\nSources include:\n\nNewswise.com\n\nWHO.int Wild rice is the “canary in the coal mine” for lakes and streams – Researchers use it to track water quality"}