{"http://msnbc.com/all-in/watch/time-to-start-seriously-discussing-impeaching-trump-ezra-klein-1111142467935": "\"This is an emergency,\" argues Vox founder Ezra Klein - as 58 Democrats vote for impeachment for the first time on the House floor.\n\nDuration: {{video.duration.momentjs}} Time to start seriously discussing impeaching Trump: Ezra Klein", "http://msnbc.com/rachel-maddow-show/roy-moore-faces-new-accuser-he-receives-new-gop-support": "The number of Roy Moore’s accusers in Alabama went up yesterday, when the Washington Post published a new report on Debbie Wesson Gibson, who dated the right-wing Republican when she was 17 and he was 34. The article highlighted a written note she received from Moore upon her high-school graduation, and the handwriting appears to be quite similar to the inscription in one of his other accuser’s yearbooks.\n\nThe new report not only reinforces allegations that Moore pursued teenagers while he was an adult, it also undermines the Senate candidate’s denials about his conduct.\n\nIt’s against this backdrop that Republicans have decided to give Roy Moore’s Senate candidacy a new round of support.\n\nThe Republican National Committee resumed supporting Alabama Senate candidate Roy Moore on Monday after President Donald Trump earlier endorsed Moore, a Republican official said. The RNC dropped out of a joint fundraising agreement with Moore three weeks ago as Moore was hit with multiple accusations of sexual misconduct with teenage girls decades ago. NBC News reported at the time that it had also ended its field operations in the state, where it deployed 11 operatives.\n\nNow, however, the Republican establishment has reversed course, deciding Moore deserves the party’s support after all.\n\nWhat changed? By all appearances, now that Donald Trump officially supports the accused child molester, Trump’s party has decided to support him, too.\n\nAs we discussed yesterday, there’s been an evolution in Trump World’s thinking on the subject. As recently as Nov. 10 – hardly ancient history – White House Press Secretary Sarah Huckabee Sanders said in reference to the allegations surrounding Moore that the president “believes that if these allegations are true, Judge Moore will do the right thing and step aside.”\n\nOn Nov. 15, Ivanka Trump, a prominent White House aide and presidential daughter, said in apparent reference to Moore, “There’s a special place in hell for people who prey on children.”\n\nOn Nov. 19, White House Legislative Affairs Director Marc Short added that Trump does, in fact, believe Moore’s accusers.\n\nBut on Nov. 21, the shift began. The president suggested on camera that he believed Moore’s denials. Yesterday, Trump has abandoned any sense of pretense, throwing support behind Moore at least in part because Democrats opposed his regressive and unpopular tax breaks.\n\nA White House spokesperson said in a press statement yesterday, “The president had a positive call with Judge Roy Moore during which they discussed the state of the Alabama Senate race and the president endorsed Judge Moore’s campaign.”\n\nTrump’s backing evidently led to the RNC’s backing, Moore’s newest accuser notwithstanding. As Roy Moore faces new accuser, he receives new GOP support", "http://msnbc.com/rachel-maddow-show/childrens-health-program-imperiled-republican-tactics": "The Republican-led Congress was supposed to extend the Children’s Health Insurance Program (CHIP) by Oct. 1. As regular readers know, that was the day current funding for the program, which has traditionally enjoyed bipartisan support, expired. The deadline passed, however, because GOP lawmakers were focused on trying to repeal the Affordable Care Act.\n\nHealth care advocates initially hoped lawmakers would act soon after, and the missed deadline would be inconsequential. That was 59 days ago, and as of now, there is no solution and Republicans don’t appear to be working on one.\n\nAs Slate noted, the real-world consequences are starting to emerge.\n\nColorado has notified residents that the federally funded Children’s Health Insurance Program will shut down in early 2018 if Congress doesn’t act to renew funding that expired on Sept. 30; the state appears to be the first to formally make such an announcement. A state press release says its program has enough money to continue operating until Jan. 31 of next year. Since the CHIP program is administered at the state level, the funding shortfall has different effects in different places, but estimates indicate that as many as four million children nationwide could lose coverage if it’s not renewed.\n\nThere’s long been a buffer built into the system, which is why no one panicked on Oct. 1. Everyone involved in the debate understood that states would move some money around until lawmakers got their act together. In fact, this wasn’t the first time federal policymakers missed a CHIP deadline.\n\nThe point now, however, is that the GOP Congress’ indifference has gone on so long that buffer is starting to disappear. Colorado is warning affected families now, and the Washington Post reported last week that “nearly a dozen” states are preparing to do the same thing.\n\nThe article added that five states may exhaust existing CHIP funding “in late December if lawmakers do not act.”\n\nHouse Republicans are of the opinion that they’ve already acted: a few weeks ago, the chamber passed a highly partisan CHIP extension paid for through cuts to other health care programs. Not surprisingly, Democrats balked, and the bill hasn’t been considered in the Senate, which is currently focused on trying to cut taxes for the wealthy.\n\nRumor has it that lawmakers may try to address CHIP funding in a year-end spending package, intended to prevent a government shutdown, but there’s no guarantee that bill will come together, and for some states, the spending package may be too late to avoid interruptions in children’s care.\n\nWatch this space. Children’s health program imperiled by Republican tactics", "http://msnbc.com/the-beat-with-ari-melber/watch/affirmative-action-debate-rages-in-era-of-trump-1015910979690": "Vanita Gupta and Ilya Shapiro join Ari Melber to debate the Trump administration’s reported effort to curb affirmative action in college admissions.\n\nDuration: {{video.duration.momentjs}} Affirmative Action Debate Rages in Era of Trump", "http://msnbc.tumblr.com/post/149127174569/haunting-photo-of-wounded-boy-captures-horror-in": "Video footage shows 5-year-old Omran Daqneesh being plucked away from the rubble in the aftermath of a devastating airstrike in Aleppo and carried inside an ambulance, looking dazed and flat-eyed.\n\nThe boy then runs his hand over his blood-covered face, looks at his hands and wipes them on the ambulance chair.\n\nWatch the heartbreaking video here: http://on.msnbc.com/2bfBhoO MSNBC", "http://msnbc.tumblr.com/post/148792213949/obama-drops-his-2016-summer-playlist#notes": "MSNBC is the premier destination for breaking news and in-depth analysis of the headlines, as well as commentary and informed perspectives.\n\nElsewhere Obama drops his 2016 summer playlist", "http://msnbc.com/weekends-with-alex-witt/watch/city-year-helps-students-reach-their-full-potential-and-graduate-1103843395886": "City Year Director Laura Hamm and Impact Manager Shani Walter join MSNBC ahead of “Giving Tuesday” to discuss their work with at-risk schools to help bridge the gap between what students need and what the schools are designed to provide.\n\nDuration: {{video.duration.momentjs}} City Year helps students reach their full potential and graduate", "http://msnbc.com/velshi-ruhle/watch/how-are-palestinians-reacting-to-trump-s-israel-decision-1110795331703": "Many Palestinians are not having a positive reaction to the decision of the United States to recognize Jerusalem as the capital of Israel.\n\nDuration: {{video.duration.momentjs}} How are Palestinians reacting to Trump's Israel decision", "http://msnbc.com/rachel-maddow-show/despite-the-risks-murkowski-backs-aca-mandate-repeal": "When Senate Republican leaders added the repeal of the ACA’s individual mandate to their tax plan, it looked like an enormous gamble. After all, the GOP’s efforts to repeal the Affordable Care Act were derailed by bipartisan opposition, and by tying tax cuts for the wealthy to health care policy, it raised the prospect of greater opposition to the latest Republican gambit.\n\nBut that only works if the GOP senators who helped rescue the health care system over the summer are willing to do so again now. Evidently, that may not be the case.\n\nSen. Lisa Murkowski (R-Alaska) said she would support repealing the Affordable Care Act’s individual insurance mandate, giving a potential boost to the Republican effort to pass a massive tax cut package next week. “I believe that the federal government should not force anyone to buy something they do not wish to buy, in order to avoid being taxed,” Murkowski wrote in an opinion piece published Tuesday by the Fairbanks Daily News-Miner.\n\nLet’s back up for a minute in order to better understand the landscape here. The original Republican plan was to overhaul the federal tax code in order to benefit the wealthy and corporations, but the effort ran into trouble when GOP officials couldn’t get their numbers to add up. They needed more money to cover the cost of a permanent corporate tax break.\n\nAt Donald Trump’s urging, Republicans determined they could repeal the “Obamacare” individual mandate and have an additional $338 billion over the next decade to pay for more tax breaks. As we discussed a couple of weeks ago, for the right, this represented the best of both worlds: the GOP could gut the health care law they love to hate, and at the same time, they could redirect that money to finance tax cuts.\n\nThere was, however, a catch: the nonpartisan Congressional Budget Office explained to lawmakers that repealing the ACA’s individual mandate would destabilize the insurance market, force many consumers to pay higher premiums, and end coverage for 13 million Americans over the next decade. Hospitals, doctors, and insurers all said this was a very bad idea.\n\nThe result was effectively a caricature of Montgomery Burns-style policymaking: Republicans are pursuing a plan that would leave millions of families without health security, disproportionately hurt the poor, all in the hopes of redistributing wealth from the bottom up.\n\nAs of yesterday, Lisa Murkowski isn’t yet prepared to say no to this.\n\nOn the contrary, even after being told about the consequences of repealing the ACA’s individual mandate, she thinks the idea has merit.\n\nNow, in fairness, there are important nuances to the Alaska Republican’s position. Murkowski has also said, for example, that she’d like to see the Alexander-Murray compromise measure on market stabilization pass before her party’s tax gambit goes through. This wouldn’t fully mitigate the damage done by a mandate repeal, but she at least appears to be thinking about how best to prevent a GOP-imposed disaster.\n\nThat said, as 2017 has progressed, health care advocates have started to see Lisa Murkowski as an important ally in the fight against regressive and dangerous changes. Her comments this week put those advocates’ confidence in doubt. Despite the risks, Murkowski backs ACA mandate repeal", "http://msnbc.com/the-beat-with-ari-melber/watch/mueller-follows-trump-money-trail-1111101507627": "Reuters reports Mueller subpoenaed Deutsche Bank to investigate whether they sold Trump’s $300 million loan to a Russian bank.\n\nDuration: {{video.duration.momentjs}} Mueller follows Trump money trail", "http://msnbc.com/rachel-maddow/watch/trump-lying-or-ignorant-about-what-s-in-the-republican-tax-bill-1106584643871": "Rachel Maddow reports on the deep unpopularity of the Republican tax plan and notes that Donald Trump is wildly wrong to say that he'll pay more under the bill.\n\nDuration: {{video.duration.momentjs}} Trump lying or ignorant about what's in the Republican tax bill", "http://msnbc.com/msnbc-news/watch/russian-lawyer-says-trump-jr-sought-info-on-clinton-funds-1110642755726": "NBC News intelligence correspondent Ken Dilanian shares an exclusive report that Russian lawyer Natalie Veselnitskaya told the Senate that Donald Trump Jr. sought info on Clinton Foundation during their June 2016 meeting at Trump Tower.\n\nDuration: {{video.duration.momentjs}} Russian lawyer says Trump Jr. sought info on Clinton funds", "http://msnbc.com/rachel-maddow-show/despite-talk-win-gop-tax-plan-loser-the-public": "Yesterday at the White House, Donald Trump boasted about how great he thinks the Republican tax plan is. “I think people see that, and they’re seeing it more and more,” the president said. “And the more they learn about it, the more popular it becomes.”\n\nAs is too often the case, what Trump said is pretty much the opposite of what’s true.\n\nA Gallup poll found that 29% of people surveyed approved of the GOP tax bill, named the Tax Cuts and Jobs Act, while 56% disapproved. […] And a poll from Quinnipiac University also found that 29% of those surveyed approved of the bill while 53% disapproved.\n\nThe results of both of these surveys were quite brutal for supporters of the regressive GOP package. The Gallup and Quinnipiac results both pointed to an American mainstream that believes the Republican tax policy will deliver the bulk of its benefits to the wealthy and big corporations – which happens to be true.\n\nOf particular interest in the Quinnipiac data, the poll asked Americans which party they trust more on the issue of taxes. As recently as August, Democrats and Republicans were tied. Now, Dems have an eight-point advantage.\n\nAsked which party can do a better job “fighting for the working class,” Democrats are ahead, 56% to 34%.\n\nAfter Senate Republicans narrowly rammed through their tax plan in the middle of the night a few days ago, much of the coverage hailed the developments as a “win” and an important “victory” for the GOP and its leaders. And while that may have been true in one sense – Senate Republicans successfully passed what they wanted to pass – public revulsion toward their legislation makes it difficult to see the developments as some kind of triumph.\n\nThe HuffPost had an interesting item the other day, asking GOP senators for their reactions to the overwhelming evidence that the American mainstream isn’t buying what they’re selling. Several of the Republicans quoted suggested they simply don’t believe the polls.\n\nSen. Thom Tillis (R-N.C.), however, argued, “Tax cuts are generally unpopular,” as if GOP policymakers, desperate to improve their public standing, deliberately set out to do something the public disapproves of.\n\nThe trouble is, the evidence to the contrary is unambiguous: tax cuts are generally popular with the American mainstream. This plan isn’t. The public is already inclined to believe the system is stacked in favor of the wealthy, and GOP officials are predictably facing resistance because they’re doing the opposite of what voters want.\n\nAs we discussed in October, Republicans are working from the assumption that if they ignore popular will, they’ll eventually be rewarded by the voters whose wishes they’re ignoring. They’re likely to be disappointed by the results. Despite talk of a ‘win,’ GOP tax plan is a loser with the public", "http://msnbc.com/stephanie-ruhle/watch/how-to-eat-healthier-during-thanksgiving-1102988867617": "MSNBC's Stephanie Ruhle offers tips on how you can eat healthier during the Thanksgiving holidays.\n\nDuration: {{video.duration.momentjs}} How to eat healthier during Thanksgiving", "http://msnbc.com/morning-joe/watch/what-trump-s-budget-means-for-wild-horses-1086223939567": "What does President Trump's budget mean for wild horses? The CANA Foundation's Manda Kalimian and Moses J. Brings Plenty join Morning Joe to discuss.\n\nDuration: {{video.duration.momentjs}} What Trump’s budget means for wild horses", "http://msnbc.com/msnbc-news/watch/report-justice-department-to-target-college-affirmative-action-1015436355538": "NBC's Hallie Jackson talks to New York Times reporter Charlie Savage and Deputy Asst. Attorney General Tom DuPree about the Trump Administration seeking to sue schools over affirmative action.\n\nDuration: {{video.duration.momentjs}} Report: Justice Department to Target College Affirmative Action", "http://msnbc.com/msnbc/watch/how-much-has-the-epa-changed-one-year-since-the-election-1091555395949": "NBC’s Anne Thompson reviews Donald Trump’s reshaping of the Environmental Protection Agency, and Scott Pruitt’s implementation of it, one year since the election.\n\nDuration: {{video.duration.momentjs}} How Much Has the EPA Changed One Year Since the Election?", "http://msnbc.com/brian-williams/watch/donald-trump-jr-faces-russia-questions-on-capitol-hill-1110387267733": "On Wednesday, lawmakers on the House Intelligence Committee will meet with Donald Trump Jr. about Russia-related matters in a closed-door session. Our panel discusses.\n\nDuration: {{video.duration.momentjs}} Donald Trump Jr. faces Russia questions on Capitol Hill", "http://msnbc.com/msnbc/watch/u-s-to-recognize-jerusalem-as-capital-of-israel-1110003779826": "United States officials say that Trump will announce that the United States will recognize Jerusalem as the capital Israel.\n\nDuration: {{video.duration.momentjs}} U.S. to recognize Jerusalem as capital of Israel", "http://msnbc.com/all-in/watch/second-lady-karen-pence-finds-trump-totally-vile-1110285891946": "In a new profile of Vice President Pence, we learn that Karen was \"disgusted\" by Trump in the wake of the Access Hollywood tape and the VP candidate himself was participating in a kind of soft coup at the time.\n\nDuration: {{video.duration.momentjs}} Second Lady Karen Pence finds Trump “totally vile”", "http://msnbc.com/msnbc-news/watch/rep-conyers-announces-retirement-endorses-son-to-replace-him-1109967939927": "Rep. John Conyers (D-MI), facing multiple allegations of sexual misconduct, made the announcement on a Detroit radio show.\n\nDuration: {{video.duration.momentjs}} Rep. Conyers announces retirement, endorses son to replace him", "http://msnbc.com/velshi-ruhle/watch/what-might-the-trump-tax-plan-look-like-in-2027-1110820931794": "A report has been released outlining what the effects of the Republican tax plan would look like ten years from now.\n\nDuration: {{video.duration.momentjs}} What might the Trump tax plan look like in 2027?", "http://msnbc.com/rachel-maddow-show/the-more-you-read-the-more-you-go-holy-crap-whats": "In the spring, after the first of several Republican failures on health care policymaking, House Speaker Paul Ryan (R-Wis.) told reporters, “We’re going through the inevitable growing pains of being an opposition party to becoming a governing party.”\n\nVery recently, some GOP officials decided they’d figured it out how to overcome those growing pains. The Washington Post reported the other day, “After nearly a year of frustration, dysfunction and infighting, Republicans believe they are on the cusp of demonstrating that they can govern.” The proof, apparently, is the GOP’s progress on a regressive and unpopular tax plan.\n\nBut the confidence is borne of confusion. Ramming through poorly crafted legislation is an exercise in raw political power, but governing requires a very different skill set. A “governing party,” to use Paul Ryan’s phrase, acts deliberately and judiciously, carefully examining an issue and paying attention to the consequences of every proposed solution.\n\nAny fool can write a piece of legislation, but to demonstrate an ability to govern requires forethought about what that legislation would do. With this in mind, Politico reports today that the Republicans’ tax plan is “riddled with bugs, loopholes and other potential problems that could plague lawmakers long after their legislation is signed into law.”\n\nSome of the provisions could be easily gamed, tax lawyers say. Their plans to cut taxes on “pass-through” businesses in particular could open broad avenues for tax avoidance. Others would have unintended results, like a last-minute decision by the Senate to keep the alternative minimum tax, which was designed to make sure wealthy people and corporations don’t escape taxes altogether. For many businesses, that would nullify the value of a hugely popular break for research and development expenses. Some provisions are so vaguely written they leave experts scratching their heads…. In many cases, Republicans are giving taxpayers little time to adjust to sometimes major changes in policy. An entirely new international tax regime, one experts are still trying to parse, would go into effect Jan. 1, only days after lawmakers hope to push the plan through Congress.\n\nGreg Jenner, a former top tax official in George W. Bush’s Treasury Department, told Politico, “The more you read, the more you go, ‘Holy crap, what’s this?’”\n\nTo see this as evidence of Republicans being able to govern is to misunderstand what’s happened. GOP policymakers wrote a bad bill in a bad way, ignoring problems that do exist while creating problems that don’t exist. They ignored warnings, failed to think their actions through, rushed at breakneck speed, scribbled ideas into the margins of their legislative text, and approved sweeping legislation without reading it, scoring it, or fully understanding what it would do.\n\nI can appreciate the fact that most Americans probably don’t much care about the nuances of the legislative process. But last week offered a striking example of an irresponsible process leading directly to an irresponsible result.\n\nThe editorial board of the Washington Post said congressional Republicans “just failed Governing 101.”\n\nThe editors of Bloomberg View added, “In their rush to pass something, anything, that they can call ‘tax reform,’ congressional Republicans have achieved the impossible: They have made an awful plan even worse…. The end result is sheer absurdity: a reform that actually complicates the tax code further, and that must contradict itself and partially self-destruct to attain some semblance of the fiscal discipline Republicans claim to value. It’s hard to imagine a more egregious waste of time and energy, or a worse outcome for taxpayers and the broader economy.”\n\nPostscript: I suspect some of my friends on the right will note that legislative drafting errors are common in every major bill, including the Affordable Care Act, so the Senate Republicans’ missteps in the tax plan are not terribly surprising. There’s some truth to that.\n\nThe point, however, is that a governing party at least tries to identify some of these pitfalls before a vote, through lengthy examinations in congressional hearings and outside scrutiny from subject-matter experts. GOP senators made a conscious decision in this case to do the opposite. “The more you read, the more you go, ‘Holy crap, what’s this?’”", "http://msnbc.com/stephanie-ruhle/watch/steve-case-small-startups-are-the-future-of-economy-1110701123686": "Steve Case, the founder and chairman of the Case Foundation, speaks about the new Republican tax plan along with the future of the American economy.\n\nDuration: {{video.duration.momentjs}} Steve Case: Small startups are the future of economy", "http://msnbc.com/rachel-maddow/watch/news-of-mueller-deutsche-bank-query-triggers-trump-team-freak-out-1110339140002": "Greg Farrell, investigative reporter for Bloomberg News, talks with Rachel Maddow about his reporting on the Robert Mueller investigation asking Deutsche Bank for information related to Donald Trump.\n\nDuration: {{video.duration.momentjs}} News of Mueller Deutsche Bank query triggers Trump team freak-out", "http://msnbc.com/morning-joe/watch/future-of-clean-energy-moves-ahead-in-trump-era-1109859395864": "President Trump reduced the size of Bears Ears and Grand Staircase-Escalante, two national monuments in Utah, on Monday. Director James Redford discusses his new doc on clean energy and Trump's impact on the environment.\n\nDuration: {{video.duration.momentjs}} Future of clean energy moves ahead in Trump era", "http://msnbc.com/msnbc-news/watch/is-the-government-headed-for-a-shutdown-1110723139814": "The government is trying to decide on the several matters to prevent a government shutdown, however many are skeptical that they will be able to avoid a shutdown.\n\nDuration: {{video.duration.momentjs}} Is the government headed for a shutdown?", "http://msnbc.com/morning-joe/watch/is-gop-losing-the-messaging-game-on-tax-cuts-1100755011627": "This is a paid advertisement. This content is created by the advertiser and the NBC News sales department, not the NBC News editorial team. Learn more here.\n\nIs GOP losing the messaging game on tax cuts?\n\nRepublicans are pushing ahead with their tax plan despite roadblocks from some in the party. Democrats are also set to unleash an ad campaign targeting the tax plan. The panel discusses.\n\nRead more Is GOP losing the messaging game on tax cuts?", "http://msnbc.com/morning-joe/watch/former-amb-questions-donald-trump-s-jerusalem-recognition-1110540867781": "President Trump will recognize Jerusalem as Israel's capital on Wednesday, while also delaying moving the U.S. Embassy from Tel Aviv to the holy city. Amb. Nicholas Burns and Ned Price discuss.\n\nDuration: {{video.duration.momentjs}} Former Amb. questions Donald Trump's Jerusalem recognition", "http://msnbc.com/morning-joe/watch/joe-scarborough-warns-those-attacking-fbi-mueller-trump-will-leave-the-stage-1110530115932": "The president and his allies have been publicly attacking on Twitter and television the credibility of both the FBI and Special Counsel Robert Mueller. Joe Scarborough reminds these attackers of that plan's shortsightedness.\n\nDuration: {{video.duration.momentjs}} Joe Scarborough warns those attacking FBI, Mueller: 'Trump...", "http://msnbc.com/msnbc/watch/middle-east-region-reacts-to-trump-s-jerusalem-decision-1110784579545": "As Israeli Prime Minister Netanyahu praises Pres. Trump's decision to declare Jerusalem the capital of Israel, leaders throughout the Middle East slam the sea change in US foreign policy. NBC News' Ron Allen and Ali Arouzi report from Israel and Iran.\n\nDuration: {{video.duration.momentjs}} Middle East region reacts to Trump's Jerusalem decision", "http://msnbc.com/msnbc-news/watch/rep-conyers-announces-retirement-endorses-son-to-replace-him-1109850691945": "Rep. John Conyers (D-MI), facing multiple allegations of sexual misconduct, made the announcement on a Detroit radio show.\n\nDuration: {{video.duration.momentjs}} Rep. Conyers announces retirement, endorses son to replace him", "http://msnbc.com/hardball/watch/trump-jr-testifies-before-house-intel-committee-1111094851715": "Donald Trump Jr. asked a Russian lawyer at the June 2016 Trump Tower meeting whether she had evidence of illegal donations to the Clinton Foundation.\n\nDuration: {{video.duration.momentjs}} Trump Jr testifies before House Intel Committee", "http://msnbc.tumblr.com/post/149793580549/rudy-giuliani-sports-make-mexico-great-again#notes": "MSNBC is the premier destination for breaking news and in-depth analysis of the headlines, as well as commentary and informed perspectives.\n\nElsewhere MSNBC", "http://msnbc.com/morning-joe/watch/jeff-bezos-trump-metoo-on-2017-time-list-1108980803775": "Time Magazine has released its finalists for the 2017 Person of the Year. The names, which are in no particular order, include Jeff Bezos, Donald Trump, Kim Jong-un, to name a few.\n\nDuration: {{video.duration.momentjs}} Jeff Bezos, Trump, #MeToo on 2017 Time list", "http://msnbc.com/hardball/watch/matthews-the-gop-is-taxing-the-poor-to-help-the-rich-1110248003508": "Chris wonders why it’s good Republican policy to hurt people at the bottom in order to keep more money in the hands of the wealthy.\n\nDuration: {{video.duration.momentjs}} Matthews: The GOP is taxing the poor to help the rich", "http://msnbc.com/brian-williams/watch/trump-attacks-his-own-fbi-in-twitter-tirade-1109636163604": "MSNBC National Security Analyst Jeremy Bash reacts to Trump saying the reputation of his own FBI is in 'tatters' and the 'worst in history' because of James Comey.\n\nDuration: {{video.duration.momentjs}} Trump attacks his own FBI in Twitter tirade", "http://msnbc.com/rachel-maddow-show/the-awkward-search-economists-who-support-the-gop-tax-plan": "The University of Chicago’s Initiative on Global Markets recently conducted a survey of academic economists to ask if the Republican tax plan would exacerbate America’s debt-to-GDP ratio. Of the 38 experts who responded, 37 said Republicans were wrong that the plan would pay for itself.\n\nThe 38th said he misunderstood the question.\n\nThe University of Chicago’s Booth School of Business also asked the economists if the GOP proposal would significantly improve the economy. Only one said it would.\n\nIt’s not exactly a secret that the Republican legislation is unpopular with the American public, but American economists tend to agree that the GOP plan isn’t a good idea. Indeed, when Republicans tried to assemble a group of economists who endorsed the party’s proposal, they ended up including a variety of people who aren’t economists.\n\nBut GOP officials nevertheless want to believe their assumptions about trickle-down tax cuts are not only correct, but also bolstered by experts. On “Meet the Press” this past weekend, Sen. Susan Collins (R-Maine) made the bizarre argument that tax cuts lead to growth, which leads to revenue, which “actually lowers the debt.” When NBC’s Chuck Todd pressed her to point to any evidence to support her assumptions, she eventually replied:\n\n“Well, talk to economists like Glenn Hubbard and Larry Lindsey and Douglas Holtz-Eakin, who used to be head of the [Congressional Budget Office].”\n\nThat was probably not the right thing to say.\n\nThe Washington Post’s Jennifer Rubin spoke to two of the three conservative economists Collins mentioned – Glenn Hubbard and Douglas Holtz-Eakin – and neither one believes the Republican tax plan pays for itself through revenue created by increased economic growth.\n\nCollins’ communications director told the Post, “Senator Collins did not mean to state definitively that the tax cut would pay for itself – I can see why you would think that reading the [“Meet the Press”] transcript, and, to be clear, she does believe that the cuts could potentially pay for themselves.”\n\nReality notwithstanding.\n\nI’m left with the feeling that Collins and her far-right brethren are pursuing this debate the wrong way. At the risk of sounding reductive, Republicans basically have a choice when presenting their argument: they can (a) say that economists agree with them, which means their regressive plan has some merit lent by experts; or (b) dismiss the relevance of economists and subject-matter experts, sticking instead to their ideology and partisan orthodoxy.\n\nDuring the health care debate, Republicans went with the latter. They realized that doctors, nurses, hospitals, insurers, and patient advocates said the GOP plan would be a disaster, but the party made a conscious decision not to care. Most Republicans said in no uncertain terms that industry stakeholders were simply irrelevant.\n\nIn the tax debate, they’re trying the opposite course. It’s not working. The awkward search for economists who support the GOP tax plan", "http://msnbc.com/rachel-maddow-show/trump-impeachment-measure-receives-58-house-democratic-votes": "If you’ve been waiting for a congressional vote on the impeachment of Donald Trump, I have some good news and some bad news. The Washington Post reported on this afternoon’s developments on the House floor:\n\nRepublicans and most Democrats in the House banded together Friday to stop an attempt to impeach President Trump. Rep. Al Green (D-Tex.) came to the House floor at 12:13 p.m. Wednesday to offer articles of impeachment under special House rules requiring a floor vote; he returned to the floor at 1:34 to force that vote.\n\nNot surprisingly, it didn’t go well. A total of 238 House Republicans voted to table the privileged resolution – in effect, killing the measure – and they were joined by 126 House Democrats, who also opposed it.\n\nThat said, 58 House Dems voted to advance the impeachment measure – that’s nearly a third of the entire conference – while four Democrats voted “present.” (Six members, five Dems and one Republicans, did not vote.) Both House Minority Leader Nancy Pelosi (D-Calif.) and Minority Whip Steny Hoyer (D-Md.) opposed it.\n\nAnd at this point, some of Donald Trump’s detractors are probably wondering why it didn’t fare better. After all, there’s a fair amount of public support for the president’s impeachment and Trump is facing credible allegations of serious misdeeds, including obstruction of justice.\n\nThe trouble, however, is that while this was a Trump impeachment measure, its author had a different kind of impeachment push in mind.\n\nRep. Al Green (D-Tex.) wrote a relatively detailed letter to his colleagues yesterday, making his case against Trump in writing. It did not mention Russia or Vladimir Putin. It made no reference to obstruction of justice. There wasn’t a word about Trump’s political operation possibly having coordinated with a foreign adversary during its attack on U.S. elections.\n\nInstead, Article I of Green’s impeachment effort accused Trump of associating the presidency “with white nationalism, neo-Nazism, and hate.” It condemned Trump’s response to, among other things, the violence in Charlottesville over the summer and his criticism of football players protesting racism.\n\nArticle II accused Trump of “inciting hatred and hostility,” condemning the president’s handling of transgender troops, his criticism of Puerto Ricans after Hurricane Maria, and his description of Rep. Frederica Wilson (D-Fla.) as “wacky.”\n\nThere was no third article. This was Green’s case for impeachment in a nutshell. There’s ample debate among experts as to what should and shouldn’t constitute an impeachable offense, but it’s not too big a surprise that today’s measure pursued a definition that struggled to gain broad acceptance.\n\nThat said, while I’m not going to pretend to know what will happen with the Trump-Russia scandal, I think it’s safe to say that members who opposed today’s impeachment resolution may have a different perspective if, say, the Office of Special Counsel accuses the president in writing of obstruction of justice. Trump impeachment measure receives 58 House Democratic votes", "http://msnbc.tumblr.com/post/148981646309/clinton-surges-past-270-electoral-votes-in-new#notes": "We’ve updated our NBC battleground map. The states in Hillary Clinton’s column now add up to 288 electoral votes, which exceeds the 270 needed to win the presidency. Donald Trump, meanwhile, is at 174 electoral votes, and an additional 76 are in the Tossup category. Our last map, back in July, showed Clinton with a 255-190 advantage — so Clinton’s tally has gone up since the conventions, while Trump’s has declined.\n\n\n\nThe significant changes in our map:\n\n\n\n- We’ve moved Colorado, New Hampshire, North Carolina, Pennsylvania, Virginia, and Nebraska’s one electoral vote from Tossup to Lean Dem.\n\n- We’ve also moved Florida from Lean Dem to Tossup.\n\n- Georgia moves from Lean GOP to Tossup.\n\n- And we’ve changed Kansas and South Carolina from Likely GOP to Lean GOP.\n\n(Our regular caveat here, of course: These designations are subject to change as we get more poll numbers and reporting.)\n\nExplore more here: http://on.msnbc.com/2bxZx7G\n\n MSNBC", "http://msnbc.com/morning-joe/watch/most-millennials-fearful-of-future-polling-shows-1110601283972": "More millennials are fearful of the future than they are hopeful, according to new polling by the Harvard Institute of Politics. And more prefer Democrats to take control of Congress in 2018. John Della Volpe breaks down the numbers.\n\nDuration: {{video.duration.momentjs}} Most millennials fearful of future, polling shows", "http://msnbc.com/brian-williams/watch/bannon-stumps-for-roy-moore-blasting-gop-establishment-1110394435590": "Joining embattled GOP Senate candidate Roy Moore in Alabama, ousted Trump aide Steve Bannon blasted Hill Republicans, Mitt Romney, and said Mitch McConnell owes his job to Pres. Trump.\n\nDuration: {{video.duration.momentjs}} Bannon stumps for Roy Moore blasting GOP establishment", "http://msnbc.tumblr.com/post/149127174569/haunting-photo-of-wounded-boy-captures-horror-in#notes": "Video footage shows 5-year-old Omran Daqneesh being plucked away from the rubble in the aftermath of a devastating airstrike in Aleppo and carried inside an ambulance, looking dazed and flat-eyed.\n\nThe boy then runs his hand over his blood-covered face, looks at his hands and wipes them on the ambulance chair.\n\nWatch the heartbreaking video here: http://on.msnbc.com/2bfBhoO MSNBC", "http://msnbc.com/all-in/watch/trump-donates-100k-to-education-dept-after-cutting-9b-1010826307840": "Thing 1/Thing 2: Donald Trump donated his salary for the second quarter of 2017 to the Department of Education – after calling for over $9 billion in cuts to the department’s budget.\n\nDuration: {{video.duration.momentjs}} Trump donates $100K to Education Dept. after cutting $9B", "http://msnbc.com/the-beat-with-ari-melber/watch/trump-jr-grilled-on-secret-meeting-1111107139850": "Donald Trump Jr. interviewed with Russia investigators on Capitol Hill on his secret Trump Tower meeting with Russians. Rep. Eric Swalwell serves on the House Intelligence Committee and was questioned Trump Jr.\n\nDuration: {{video.duration.momentjs}} Trump Jr. grilled on secret meeting", "http://msnbc.com/msnbc/watch/rihanna-promotes-global-education-in-malawi-1029933123573": "In January 2017, Rihanna traveled to Malawi with her foundation, Global Citizen, and the Global Partnership for Education to advocate for global education.\n\nDuration: {{video.duration.momentjs}} Rihanna Promotes Global Education in Malawi", "http://msnbc.com/mtp-daily/watch/gop-tax-bill-is-death-to-democrats-conservative-economist-says-1111005251966": "Conservative economist Stephen Moore, who advised the Trump campaign on tax policy, told Bloomberg the GOP's tax bill is \"death to Democrats.\"\n\nDuration: {{video.duration.momentjs}} GOP tax bill is 'death to Democrats,' conservative economist says", "http://msnbc.tumblr.com/post/148693173369/they-were-forced-to-flee-their-homes-now-theyre#notes": "They are the first-ever Refugee Olympic Team — five South Sudanese runners, two swimmers from Syria, two Congolese judokas and a marathoner from Ethiopia competing under a single banner.\n\n\n\nThe collection of athletes represent refugee crises old and new. Unlike their fellow teammates from Syria, Ethiopia and the Democratic Republic of the Congo, whose pangs of homesickness are still fresh, the South Sudanese runners are a testament to the festering repercussions of violent conflicts that never end.\n\nExiled from their homes for more than a decade, the five South Sudanese runners represent a generation of stateless people. “Refugee” is the banner they’ve unwittingly carried for most of their lives; now they’re taking it up deliberately on the world stage.\n\n“Now, I have a mission to tell the world that we are refugees. We are human beings,” said Yiech Pur Biel, 21, who will run the men’s 800m race.\n\nExplore more here: http://on.msnbc.com/2aWSLFm\n\n\n\n(Photos: Newsha Tavakolian) MSNBC", "http://msnbc.com/rachel-maddow-show/the-politics-behind-the-gops-reversal-roy-moore": "Sen. Ben Sasse’s (R-Neb.) perspective on Roy Moore’s Senate candidacy is a little muddled. On the one hand, Sasse does not support Moore’s Democratic opponent, Doug Jones, and thinks it’s a mistake for Republicans to help Jones’ campaign.\n\nOn the other hand, the Nebraska Republican responded to news that the Republican National Committee is investing $170,000 into the Alabama race by saying it’s a “bad decision” and a “very sad day.” Sasse added that he believes Moore’s accusers, as did other Republican officials. “What’s changed?” the senator asked this morning.\n\nAs it turns out, I think we know the answer. Indeed, when Donald Trump reversed course this week and embraced the right-wing candidate, the president wasn’t exactly subtle.\n\n“Democrats refusal to give even one vote for massive Tax Cuts is why we need Republican Roy Moore to win in Alabama,” Trump said.\n\nAs Vox’s Matt Yglesias explained yesterday, the connection between the Alabama race and tax breaks for the wealthy is growing stronger.\n\nBack before Moore was accused of enjoying sexual predation of teen girls, he was already a controversial figure due to his habit of defying valid court orders, his view that Muslims should be barred from serving in Congress, his view that homosexuality is a “criminal lifestyle,” etc. The GOP establishment wanted to nominate someone else for the seat, but when Moore won, they embraced his despite his disregard for the rule of law and the Constitution because – in the immoral words of Rob Portman – “he’s going to be for tax reform, I think.” That same calculus applies today.\n\nThe vote-counting arithmetic is pretty straightforward.\n\nThe Senate Republicans’ tax bill passed the other day with 51 votes, leaving GOP leaders will very little room for error. Members are now starting to realize, however, that the just-passed Senate bill is a mess that will need to be largely rewritten in conference committee. Republicans are determined to advance the negotiations quickly, but the Senate special election in Alabama is just six days away – and it’s probably unrealistic to think the final version of the GOP tax plan will be ready for a vote by then.\n\nIf Doug Jones pulls off the upset, the Senate Republicans’ majority will shrink from 52 members to 51. At that point, if any two GOP senators balk at the party’s priority, it fails.\n\nHow likely is that? Sen. Bob Corker (R-Tenn.) already rejected his party’s plan over deficit concerns, and it’s hardly outlandish to believe Sen. Susan Collins (R-Maine) may reverse course if the final version is even more radical than the one she voted for on Friday night.\n\nWhat’s more, if it’s a 51-49 Senate, individual Republican members would suddenly have considerable leverage, able to tell their leaders to meet their demands or else.\n\nWhat caused Republicans to discover that they’re not that concerned about Roy Moore’s child-molestation allegations anymore? It’s hardly a stretch to think the vote on the party’s tax plan had something to do with it. The politics behind the GOP’s reversal on Roy Moore", "http://msnbc.com/kasie-dc/watch/meet-the-woman-who-won-the-first-sexual-harassment-complaint-against-a-congressman-1108794947990": "It has been 28 years since Dorena Bertussi filed a sexual harassment claim against Rep. Jim Bates, but today she says it’s still the same boys club.\n\nDuration: {{video.duration.momentjs}} Meet the woman who won the first sexual harassment complaint...", "http://msnbc.com/morning-joe/watch/mj-debates-ben-shapiro-and-free-speech-on-campuses-1047289923568": "Despite protests, U.C. Berkeley says their event last night hosting conservative commentator Ben Shapiro went off without a hitch. The Morning Joe panel enters an in-depth talk about campus culture.\n\nDuration: {{video.duration.momentjs}} MJ debates Ben Shapiro and free speech on campuses", "http://msnbc.tumblr.com/post/149045580295/aerial-video-shows-the-true-devastation-of": "“This is going to be tough to recover from,” said Ari Sarsalari, a meteorologist for The Weather Channel. “There are parts of Louisiana that have seen more than 30 inches of rain since Friday.”\n\n\n\nRead more here: http://on.msnbc.com/2aRTObT MSNBC", "http://msnbc.com/velshi-ruhle/watch/brief-history-of-the-fight-over-jerusalem-1110791235813": "On the day that President Trump is announcing that the United States will recognize Jerusalem as the capital of Israel, it is worth going over the decades of fighting in the Middle East between Israelis and Palestinians.\n\nDuration: {{video.duration.momentjs}} Brief history of the fight over Jerusalem", "http://msnbc.com/brian-williams/watch/fmr-watergate-prosecutor-no-one-is-above-the-law-1109632579709": "Jill Wine-Banks, former Assistant Watergate Special Counsel, and Jack Sharman, former Special Counsel during the Whitewater Investigation, react to Trump's attorney saying the president can't obstruct justice.\n\nDuration: {{video.duration.momentjs}} Fmr. Watergate prosecutor: 'No one is above the law'", "http://msnbc.com/rachel-maddow-show/climate-the-united-states-and-syria-now-stand-alone": "It was just two years ago when representatives of 195 countries met in Paris and reached a historic international agreement to combat the climate crisis. Only two countries – Syria and Nicaragua – rejected the accord.\n\nYesterday, one of them changed their minds. Reuters reported:\n\nNicaragua is set to join the Paris climate agreement, according to an official statement and comments from Vice President Rosario Murillo on Monday, in a move that leaves the United States and Syria as the only nations outside the global pact. Nicaragua has already presented the relevant documents at the United Nations, Murillo, who is also first lady, said on local radio on Monday.\n\nIt’s worth noting for context that when representatives from the Nicaraguan delegation balked at the Paris accords in 2015, it wasn’t because they were fringe climate deniers embracing oddball conspiracy theories. It was actually the opposite: Nicaragua opposed the agreement because officials believed it didn’t go far enough.\n\nNow, however, as Rosario Murillo explained yesterday, Nicaragua sees the agreement as “the only instrument we have in the world that allows the unity of intentions and efforts to face up to climate change and natural disasters.”\n\nAnd as a result, there are now only two countries on the planet that are operating outside the Paris accord: Syria, which is home to a brutal civil war, and the United States, which is home to Donald Trump, who announced an end to the country’s commitment to the agreement in June.\n\nA Washington Post report added, “Syria is also not set to join the next round of U.N. talks on climate change that are scheduled for mid-November in Germany. Environmental ministers of all nations that are part of the agreement will set out their visions for international guidelines to implement the accord – without Syria and the U.S.”\n\nAmericans may remember a time in which we helped lead the world, rather than sit on the sidelines. One wonders if and when that time will return.\n\nAt least in theory, according to Trump, the White House wants to begin a new round of negotiations on a climate agreement, but in the nearly five months since the president’s withdrawal announcement, there’s no evidence that any such efforts have been made.\n\nOn the contrary, Trump’s EPA chief, Scott Pruitt, argued over the summer that our allies in Europe only want the United States to participate in the Paris accord “because they know it will continue to shackle our economy.”\n\nThe president himself made a related point: “Foreign lobbyists wished to keep our magnificent country tied up and bound down by this agreement.”\n\nIn other words, the Trump administration is operating from the assumption that our allies are trying to hurt us, deliberately, through an international agreement to combat the climate crisis.\n\nWe’ve isolated ourselves internationally in a way that hardly seemed possible a year ago, and Nicaragua’s announcement yesterday made this dynamic slightly more embarrassing for the United States. On climate, the United States and Syria now stand alone", "http://msnbc.com/all-in/watch/republicans-made-a-300-billion-mistake-in-the-tax-bill-1111152707620": "The massive mistake actually screws over the corporations that Republicans were bending over backwards to help.\n\nDuration: {{video.duration.momentjs}} Republicans made a $300 billion mistake in the tax bill", "http://msnbc.tumblr.com/post/149045580295/aerial-video-shows-the-true-devastation-of#notes": "“This is going to be tough to recover from,” said Ari Sarsalari, a meteorologist for The Weather Channel. “There are parts of Louisiana that have seen more than 30 inches of rain since Friday.”\n\n\n\nRead more here: http://on.msnbc.com/2aRTObT MSNBC", "http://msnbc.com/rachel-maddow-show/syria-backs-climate-accord-further-isolating-the-united-states": "Today’s news is as embarrassing as it is dangerous.\n\nSyria announced during United Nations climate talks on Tuesday that it would sign the Paris agreement on climate change. The move, which comes on the heels of Nicaragua signing the accord last month, will leave the United States as the only country that has rejected the global pact. According to several people who were in a plenary session at the climate talks in Bonn, Germany, a Syrian delegate announced that the country was poised to send its ratification of the Paris agreement to the United Nations.\n\nIn case anyone needs a refresher, it was just two years ago when representatives of 195 countries met in Paris and reached a historic international agreement to combat the climate crisis. Only two countries – Syria and Nicaragua – rejected the accord. At the time, Nicaragua insisted the agreement didn’t go far enough, while Syria, in the midst of a devastating civil war, didn’t participate in the talks, in large part because of sanctions imposed on the Assad government.\n\nOver the summer, Donald Trump announced that the United States, which used to try to lead internationally on climate, was withdrawing from the accord, joining Syria and Nicaragua.\n\nBut two weeks ago, Nicaragua announced its support for the Paris climate policy, and today Syria has reportedly done the same. The resulting dynamic is extraordinary: literally every country on the planet supports the agreement, except us, thanks to Donald Trump.\n\nAs we discussed last month, at least in theory, according to Trump, the White House wants to begin a new round of negotiations on a climate agreement, but in the nearly five months since the president’s withdrawal announcement, there’s no evidence that any such efforts have been made.\n\nOn the contrary, Trump’s EPA chief, Scott Pruitt, argued over the summer that our allies in Europe only want the United States to participate in the Paris accord “because they know it will continue to shackle our economy.”\n\nThe president himself made a related point: “Foreign lobbyists wished to keep our magnificent country tied up and bound down by this agreement.”\n\nIn other words, the Trump administration is operating from the assumption that our allies are trying to deliberately hurt us through an international agreement to combat the climate crisis.\n\nWe’ve isolated ourselves internationally in a way that hardly seemed possible a year ago. History’s judgment is going to be severe. Syria backs climate accord, further isolating the United States", "http://msnbc.com/morning-joe/watch/-silence-breakers-are-time-s-2017-person-of-the-year-1110584899553": "Time Magazine has announced its 2017 Person of the Year is the 'Silence Breakers,' the ones 'giving voice to open secrets.' Included in the list are Ashley Judd, Taylor Swift, Uber engineer Susan Fowler and more.\n\nDuration: {{video.duration.momentjs}} 'Silence Breakers' are Time's 2017 Person of the Year", "http://msnbc.com/velshi-ruhle/watch/skirball-wildfire-firefighters-work-to-tamp-down-flames-1110692419729": "Msnbc’s Jacob Soboroff reports alongside firefighters in Bel Air where they are working to prevent more flames from kicking up and destroying more property in the area.\n\nDuration: {{video.duration.momentjs}} Skirball Wildfire: Firefighters work to tamp down flames", "http://msnbc.com/morning-joe/watch/multiple-women-accuse-matt-lauer-of-misconduct-1106952771883": "The Morning Joe panel discusses misconduct allegations against former 'Today' host Matt Lauer.\n\nDuration: {{video.duration.momentjs}} Multiple women accuse Matt Lauer of misconduct", "http://msnbc.com/rachel-maddow/watch/trump-moving-stealthily-to-privatize-the-va-alarming-vets-groups-1100504131891": "Rachel Maddow relays reports that the Donald Trump White House is looking at the possibility of merging the VA with the private health care system used by the Pentagon.\n\nDuration: {{video.duration.momentjs}} Trump moving stealthily to privatize the VA, alarming vets groups", "http://msnbc.tumblr.com/post/150358631304/but-first-you-might-want-to-rethink-that-selfie#notes": "Is banning selfies in the voting booth is a violation of free expression or legitimate way to combat fraud?\n\n\n\nThat’s the question that the First Circuit Court of Appeals in Boston will try to answer today — the first time a federal appeals court will consider the issue.\n\nAt issue is a 2014 New Hampshire law that makes it a crime, punishable by a fine of up to $1,000, for voters to take pictures of their ballots and share them on social media. Enforcement of the law was blocked a year ago by a federal judge, and the state appealed.\n\n\n\nOnly nine states appear to either explicitly allow ballot selfies or have no currently enforceable state law clearly forbidding it.\n\nMost of the states, 26, explicitly ban it through various laws, including prohibitions on bringing cameras into polling places.\n\nThe law is unclear in Arkansas, Connecticut, Hawaii, Idaho, Illinois, Kansas, Kentucky, Maryland, Minnesota, New Jersey, Ohio, Rhode Island, Vermont, and Washington.\n\nRead more here: http://on.msnbc.com/2ctqLrb MSNBC", "http://msnbc.com/mtp-daily/watch/trump-s-jerusalem-announcement-was-diplomatic-bomb-1110995523540": "Woodrow Wilson Center’s Robin Wright comments on Trump’s announcement calling Jerusalem the capital of Israel and it calls it a “diplomatic bomb in the middle of the peace process.”\n\nDuration: {{video.duration.momentjs}} Trump's Jerusalem announcement was 'diplomatic bomb'", "http://msnbc.com/brian-williams/watch/rnc-helping-roy-moore-again-after-trump-endorses-him-1109635651865": "After the allegations mounted against Roy Moore, national Republicans stopped helping his campaign. But now that Trump has officially endorsed Moore, the RNC is back in Alabama. Robert Costa discusses.\n\nDuration: {{video.duration.momentjs}} RNC helping Roy Moore again after Trump endorses him", "http://msnbc.com/brian-williams/watch/trump-backs-roy-moore-we-need-him-to-win-in-alabama-1109636163867": "After weeks of speculation over whether he would endorse Roy Moore before the Alabama special election, Trump officially backed the embattled GOP candidate to join the U.S. Senate.\n\nDuration: {{video.duration.momentjs}} Trump backs Roy Moore: We need him to win in Alabama", "http://msnbc.com/rachel-maddow-show/the-government-shutdown-deadline-just-two-days-away": "There’s never been a federal government shutdown when one party controls both the White House and Congress. That may change this week.\n\nAs Rachel noted on the show the other day, when there’s a possible shutdown looming, the political world is ordinarily fascinated by the drama. It’s a testament to just how frenetic the current environment is that the federal government will run out of money in two days, and much of the country probably isn’t aware of the pending deadline.\n\nThe first step in preventing the government from shutting down will be a spending bill in the House. Politico reports that Republican leaders appear to have settled on a plan.\n\nHouse Republican leaders have promised conservatives that they won’t grant concessions to Democrats to get enough votes for a stopgap spending bill – gaining GOP support but also raising the specter of a government shutdown later this month.\n\nAs John Boehner can attest, House Republican leaders are in an awkward position. There’s a sizable contingent of far-right House members who don’t like to vote for spending bills, pushing GOP leaders to turn to Democrats for votes. In this case, however, Dems have a lengthy list of priorities they’d love to see tied to the temporary spending bill – called a “continuing resolution” (or CR) – which Republicans naturally oppose.\n\nSo, as of yesterday, House GOP leaders said they won’t turn to Democrats for support, and will instead work with far-right members to pass a spending measure and prevent a shutdown.\n\nProblem solved? Of course not. That bill would go to the Senate, where it’ll need 60 votes – which means persuading at least eight Democratic senators to vote with all 52 Senate Republicans. If the House passes a partisan, GOP-centric measure, Dems in the upper chamber will balk and the odds of a shutdown will improve.\n\nIn case this weren’t quite messy enough, Democrats aren’t exactly united on a strategy. The congressional minority party seems to realize that they have some leverage in the process – Republicans can’t avoid a shutdown without some Democratic votes – but Dems have all kinds of demands, ranging from health care to Dreamer protections, and there’s no real agreement within the party as to what to demand in exchange for votes on a spending bill.\n\nDonald Trump, meanwhile, seems to be playing no constructive role in the process whatsoever, and he’s reportedly told allies he thinks a government shutdown would be good for him.\n\nAs things stand, the House is scheduled to vote tomorrow on its spending bill, the same day the White House hosts a conversation with Congress’ bipartisan leadership about keeping the government’s lights on.\n\nIf the House passes a “clean” measure – simply extending current spending levels for two weeks – it’s possible Dems will largely approve, making no real demands, and hold their fire for the next round of talks. It’s also possible Democrats will expect something in return for preventing a shutdown.\n\nAll of this will play out very quickly, since Republicans have waited until the last minute to find a solution. Based on my best guess, I’d put the likelihood of a shutdown at about 35%, but that could change based on how things unfold on Capitol Hill today. The government shutdown deadline is just two days away", "http://msnbc.com/morning-joe/watch/from-epa-to-hud-how-trump-wh-dismantles-gov-t-1081945667565": "Time's Magazine looks at the ways in which Trump's cabinet is taking action to deregulate or withdraw government regulation since taking office, from the EPA to HUD and the Education Department.\n\nDuration: {{video.duration.momentjs}} From EPA to HUD, how Trump WH dismantles gov't.", "http://msnbc.com/velshi-ruhle/watch/congress-misses-deadline-to-provide-health-care-to-millions-of-children-1110860867845": "Former HHS Secretary Kathleen Sebelius blasts Congress for missing a deadline to fund health care for millions of low income children.\n\nDuration: {{video.duration.momentjs}} Congress misses deadline to provide health care to millions of...", "http://msnbc.com/the-beat-with-ari-melber/watch/whistleblower-flynn-pushed-russian-plan-minutes-into-trump-presidency-1111098947632": "A whistleblower says Michael Flynn texted a Russian contact, assuring him that sanctions against Russia would be ‘ripped up’ when Trump was sworn into office. The text was sent on Inauguration Day, at the very moment Trump was promising to fight for America.\n\nDuration: {{video.duration.momentjs}} Whistleblower: Flynn pushed Russian plan minutes into Trump...", "http://msnbc.com/morning-joe/watch/frontline-looks-at-impact-of-the-war-on-the-epa-1069837379646": "EPA Admin. Scott Pruitt announced this week plans to withdraw the Clean Power Plan. A new Frontline documentary 'War on the EPA' looks at how Pruitt is impacting Obama-era environmental regulations.\n\nDuration: {{video.duration.momentjs}} Frontline PBS doc looks at impact of the 'War on the EPA'", "http://msnbc.com/andrea-mitchell-reports/watch/mitchell-trump-s-decision-undermines-our-allies-in-the-middle-east-1110779459833": "NBC News Chief Foreign Affairs correspondent reacts to President Trump's decision to declare Israel the capital of Jerusalem and says that many believe the decision undermines our allies in the Middle East.\n\nDuration: {{video.duration.momentjs}} Mitchell: Trump's decision undermines our allies in the Middle...", "http://msnbc.com/the-beat-with-ari-melber/watch/trump-rnc-never-vote-ever-again-1111098947699": "Conservative columnist says he can “never vote ever again” for the GOP after Trump, RNC endorse alleged pedophile Roy Moore. Jess McIntosh says Republicans have “lost the moral high ground” by supporting him.\n\nDuration: {{video.duration.momentjs}} Trump, RNC “never vote ever again”", "http://msnbc.com/morning-joe/watch/how-rock-solid-flynn-was-seduced-by-trump-1109908035705": "This is a paid advertisement. This content is created by the advertiser and the NBC News sales department, not the NBC News editorial team. Learn more here. How 'rock solid' Flynn was 'seduced' by Trump", "http://msnbc.com/rachel-maddow-show/trumps-epa-takes-aim-the-clean-power-plan": "Donald Trump’s hostility towards the Obama-era Clean Power Plan, in a twisted way, makes perfect sense. The Republican president believes climate change is a conspiracy cooked up by the Chinese; he reflexively opposes any policy his predecessor supports; and Trump has no real interest in helping the United States compete internationally in the area of clean energy.\n\nAnd so, in March, the president issued an executive order instructing the Environmental Protection Agency to “review” the policy that intends to reduce carbon pollution from U.S. power plants. Today, as the Washington Post reports, the far-right officials who lead Trump’s EPA took the next step.\n\nEPA Administrator Scott Pruitt issued a proposed rule Tuesday that would repeal sweeping regulation aimed at curbing greenhouse gas emissions from existing U.S. power plants. The move, aimed at bolstering the nation’s struggling coal industry, will trigger an immediate court fight and could result in months, if not years of litigation.\n\nAnd it’s that second part of the excerpt that stands out. The Trump administration took a deliberate step backwards today, but the policy implications aren’t cut and dry. It’s not as if power plants were working under one framework yesterday, which will be entirely different from the one that’ll be in place tomorrow.\n\nIn fact, the Supreme Court has already blocked implementation of the Obama-era policy. The Trump administration’s new rule is really just a vague proposal to go in a more regressive direction, but we have no idea what the details of the new policy look like, or when we’ll even see them. A New York Times report added that Trump’s EPA intends to consider a new rule “at some point.”\n\nAll the while, the administration will try to fend off a series of lawsuits from environmental advocates, who may very well have some success in preserving Obama-era safeguards.\n\nVox’s David Roberts had a good piece today, explaining that Trump, Pruitt, and their allies may find this endeavor more difficult than they fully appreciate.\n\nIn 2007, the Supreme Court ruled, in Massachusetts v. EPA, that carbon dioxide qualifies as an air pollutant under the Clean Air Act. If the EPA determines that carbon is a danger to public health, the court said, it must regulate carbon to reduce that danger. In 2009, the EPA issued its Endangerment Finding, demonstrating (based on intensive research and documentation) that greenhouse gases are in fact a danger to public health. The Supreme Court ruling plus the Endangerment Finding mean that the EPA is legally obligated to regulate carbon in such a way as to meliorate the danger it poses to public health. The only way EPA can escape that core legal obligation is to overturn the Endangerment Finding. Some conservative denialist groups, recognizing that fact, are pressuring Pruitt to attempt just that. Doing so, however, would likely prove impossible. It would have to pass legal review, and the simple fact is that the science overwhelmingly supports the EPA’s case. Until denialists put together a much stronger scientific case (anything can happen), the debate over carbon policy is entirely shaped by the legal expectation that the EPA will meaningfully regulate carbon…. The fact is, the EPA is legally obligated not just to reduce carbon from “stationary sources” like power plants, but to meliorate the danger it poses – that is, to reduce it significantly, in a way that meaningfully reduces risks.\n\nTrump, Pruitt, and their allies seem to be under the impression that they can simply scrap Obama-era environmental protections as if they were flipping a switch: Obama said yes; they’ll say no.\n\nThe details aren’t nearly that simple. Trump’s EPA takes aim at the Clean Power Plan", "http://msnbc.tumblr.com/post/150030257059/tune-in-to-the-first-joint-candidate-event-of-the": "Tune in to the first joint candidate event of the 2016 general election!\n\nHillary Clinton and Donald Trump will take questions on national security, military affairs and veterans’ issues from a live audience comprised of service members and veterans on the Intrepid Sea, Air & Space Museum. MSNBC", "http://msnbc.com/hardball/watch/bannon-doubles-down-on-support-for-roy-moore-1111068227585": "With the Alabama Senate race less than a week away, the RNC is back to supporting Roy Moore and Steve Bannon is on the stump for the candidate.\n\nDuration: {{video.duration.momentjs}} Bannon doubles down on support for Roy Moore", "http://msnbc.tumblr.com/post/148067133784/dont-miss-a-special-dnc-edition-of-snls-weekend#notes": "Colin Jost and Michael Che are rehearsing for the show, which will be broadcast on MSNBC at 12am ET.\n\nWatch clips from last week’s RNC edition here: http://on.msnbc.com/2awFkP7 MSNBC", "http://msnbc.tumblr.com/post/150030257059/tune-in-to-the-first-joint-candidate-event-of-the#notes": "Tune in to the first joint candidate event of the 2016 general election!\n\nHillary Clinton and Donald Trump will take questions on national security, military affairs and veterans’ issues from a live audience comprised of service members and veterans on the Intrepid Sea, Air & Space Museum. MSNBC", "http://msnbc.com/hardball/watch/matthews-the-gop-is-at-war-with-itself-1111108163662": "Trump's endorsement of Roy Moore is causing a divide between establishment Republicans and the nationalist wing of the party.\n\nDuration: {{video.duration.momentjs}} Matthews: The GOP is at war with itself", "http://msnbc.com/velshi-ruhle/watch/group-of-female-democratic-senators-call-on-franken-to-step-down-1110694979761": "Senators Kirsten Gillibrand, Mazie Hirono, Claire McCaskill and Maggie Hassan issued statements Wednesday morning calling on Senator Al Franken to resign, amid sexual harassment allegations against him. NBC’s Kasie Hunt reports.\n\nDuration: {{video.duration.momentjs}} Group of female Democratic Senators call on Franken to step down", "http://msnbc.com/brian-williams/watch/fmr-mueller-colleague-mueller-will-follow-the-facts-1110388291794": "Chuck Rosenberg, who worked at the FBI with both Robert Mueller and James Comey, discusses Mueller's ongoing Russia investigation saying Mueller isn't 'going after' Trump. He's simply following the facts where they lead.\n\nDuration: {{video.duration.momentjs}} Fmr. Mueller colleague: Mueller will follow the facts", "http://msnbc.com/msnbc/watch/los-angeles-residents-react-to-devastation-caused-by-wildfires-1110835779953": "MSNBC's Jacob Soboroff spoke to a Los Angeles resident who said she feared for her life as wildfires rage throughout Bel Air and Los Angeles Hills.\n\nDuration: {{video.duration.momentjs}} Los Angeles residents react to devastation caused by wildfires", "http://msnbc.com/all-in/watch/gop-faces-a-reckoning-on-their-sexual-harassment-stance-1111155779673": "As Democrats move to remove accused harassers from their ranks, the GOP rallies around Roy Moore and Donald Trump - and women are watching.\n\nDuration: {{video.duration.momentjs}} GOP faces a reckoning on their sexual harassment stance", "http://msnbc.tumblr.com/post/148981646309/clinton-surges-past-270-electoral-votes-in-new": "We’ve updated our NBC battleground map. The states in Hillary Clinton’s column now add up to 288 electoral votes, which exceeds the 270 needed to win the presidency. Donald Trump, meanwhile, is at 174 electoral votes, and an additional 76 are in the Tossup category. Our last map, back in July, showed Clinton with a 255-190 advantage — so Clinton’s tally has gone up since the conventions, while Trump’s has declined.\n\n\n\nThe significant changes in our map:\n\n\n\n- We’ve moved Colorado, New Hampshire, North Carolina, Pennsylvania, Virginia, and Nebraska’s one electoral vote from Tossup to Lean Dem.\n\n- We’ve also moved Florida from Lean Dem to Tossup.\n\n- Georgia moves from Lean GOP to Tossup.\n\n- And we’ve changed Kansas and South Carolina from Likely GOP to Lean GOP.\n\n(Our regular caveat here, of course: These designations are subject to change as we get more poll numbers and reporting.)\n\nExplore more here: http://on.msnbc.com/2bxZx7G\n\n MSNBC", "http://msnbc.com/the-beat-with-ari-melber/watch/ari-melber-breaks-down-how-mueller-could-use-the-logan-act-1111102531718": "MSNBC Chief Legal Correspondent Ari Melber breaks down the ‘Logan Act’, and how it could be used against Michael Flynn in Bob Mueller’s Russia investigation.\n\nDuration: {{video.duration.momentjs}} Ari Melber breaks down how Mueller could use the Logan Act", "http://msnbc.com/rachel-maddow-show/trump-mcconnell-take-dramatic-new-postures-roy-moore": "Senate Majority Leader Mitch McConnell (R-Ky.) had been a rather vocal critic of Roy Moore’s radical Senate candidacy in Alabama. It was just a couple of weeks ago that the GOP leader said the Alabama Republican, accused of, among other things, child molestation, is “obviously not fit to be in the United States Senate.”\n\nMcConnell acknowledged at the time that he and his colleagues were exploring way “to prevent” Moore from joining the chamber.\n\nAnd with this in mind, it was a little jarring to see McConnell on ABC News yesterday, saying in reference to Moore, “I’m going to let the people of Alabama make the call.”\n\nEvidently, he’s not the only prominent Republican who’s changing his posture.\n\nPresident Donald Trump on Monday offered his strongest support yet to embattled Alabama GOP Senate candidate Roy Moore. “Democrats refusal to give even one vote for massive Tax Cuts is why we need Republican Roy Moore to win in Alabama. We need his vote on stopping crime, illegal immigration, Border Wall, Military, Pro Life, V.A., Judges 2nd Amendment and more. No to Jones, a Pelosi/Schumer Puppet,” Trump tweeted in the first of two posts.\n\nAt face value, Trump described a less-than-ideal posture for his party: tax cuts for the wealthy are great, so elect the alleged child molester.\n\nIt’s also problematic for the president to make the case that “stopping crime” is a priority, which is why he wants voters to support a candidate accused of sexual assault over a former federal prosecutor.\n\nBut it’s also worth pausing to appreciate the evolution of Trump World’s thinking on the scandal.\n\nAs recently as Nov. 10 – hardly ancient history – White House Press Secretary Sarah Huckabee Sanders said in reference to the allegations surrounding Moore that the president “believes that if these allegations are true, Judge Moore will do the right thing and step aside.”\n\nOn Nov. 15, Ivanka Trump, a prominent White House aide and presidential daughter, said in apparent reference to Moore, “There’s a special place in hell for people who prey on children.”\n\nOn Nov. 19, White House Legislative Affairs Director Marc Short added that Trump does, in fact, believe Moore’s accusers.\n\nBut on Nov. 21, the shift began. The president suggested on camera that he believed Moore’s denials. Today, Trump has abandoned any sense of pretense, throwing support behind Moore at least in part because Democrats opposed his regressive and unpopular tax breaks.\n\nThose reports from September about the president being an “independent,” bound by “no party,” aren’t holding up especially well. Trump, McConnell take dramatic new postures on Roy Moore", "http://msnbc.com/all-in/watch/trump-nominates-devry-dean-to-education-department-post-1037164611715": "The nominee to head a division of the Education Department responsible for policing deceptive practices in higher education comes from a university that was cited for deceptive practices in higher education.\n\nDuration: {{video.duration.momentjs}} Trump nominates DeVry dean to Education Department post", "http://msnbc.com/morning-joe/watch/mika-brzezinski-says-no-thank-you-to-facebook-s-messenger-kids-1109855811648": "Facebook has announced the development of Messenger Kids, which allows kids access to its messaging platform but with parental controls. Joe and Mika react to Messenger Kids.\n\nDuration: {{video.duration.momentjs}} Mika Brzezinski says 'no thank you' to Facebook's Messenger Kids", "http://msnbc.com/rachel-maddow-show/trump-takes-alarming-risk-shift-israel-policy": "To appreciate the significance of Donald Trump’s announcement today on U.S. policy in Israel, it’s important to appreciate the context. In 1995, Congress passed a law moving the United States’ Israeli embassy to Jerusalem, from Tel Aviv. The legislation, however, came with a catch: U.S. presidents could delay the move for security reasons.\n\nAnd that’s precisely what every president has done since. Bill Clinton, George W. Bush, and Barack Obama each signed waivers, keeping the U.S. embassy in Tel Aviv. There’s no great mystery as to why: because of Jerusalem’s unique significance – politically, historically, theologically – putting the U.S. embassy in the city would signal that the United States sees Jerusalem as Israel’s official capital. That would touch off a series of repercussions that would risk destabilizing the region and irreparably harming the Middle East peace process.\n\nDonald Trump vowed to do what his predecessors would not, though many (including me) never thought he’d be foolish enough to follow through. Those assumptions were mistaken.\n\nPresident Donald Trump will recognize Jerusalem as Israel’s capital on Wednesday, while also delaying moving the U.S. Embassy from Tel Aviv to the holy city, officials said. Though Trump will not relocate the embassy any time soon – one White House official told reporters it could take years – the president still intends to fulfill that promise made early in his administration. Senior administration officials called Trump’s expected recognition of Jerusalem an affirmation of “reality” – both historical and current, pointing out that the city is already home to Israel’s parliament, supreme court and other government sites. Palestinians, however, also claim Jerusalem as their capital, and Trump’s anticipated announcement has touched off an uproar in the Arab world.\n\nFor the record, the president will apparently sign the same waiver his recent predecessors signed, but (a) it’s for logistical reasons, not security reasons; and (b) this doesn’t much matter since he’s apparently going to recognize Jerusalem as Israel’s capital and begin the process of formally relocating the U.S. embassy.\n\nTrump’s approach to politics is often transactional. Always looking for some kind of “deal,” the Republican president routinely looks for ways to advance his agenda through some kind of exchange of interests.\n\nWhat makes today’s announcement so unsettling is that Trump doesn’t seem to be advancing his or the United States’ interests at all. Many of our closest allies have urged him not to do this, but the president is ignoring them – in exchange for nothing.\n\nNBC News ran a good piece this morning, examining whether Trump’s move advances U.S. interests in any way.\n\nIt doesn’t, according to analysts. Some also warned Trump’s decision could damage peace-building efforts in the Middle East as well as America’s credibility as a respected world power. “It’s very difficult to imagine what U.S. interest it serves if you assume it has a basic interest in promoting a peaceful settlement to the conflict,” said Dana Allin, a senior fellow for U.S. foreign policy at the International Institute for Strategic Studies (IISS). “It flies in the face of his other goal of peace in the region,” said Leslie Vinjamuri, associate fellow in U.S. and Americas program at the London-based Chatham House think tank. “If he does make this announcement it’s going to undermine U.S. interests to bring peace and stability to the region.”\n\nSlate’s Isaac Chotiner wrote a related piece last night, noting that Trump isn’t just undermining his own efforts at a peace plan, he’s also inadvertently helping Iran.\n\nSo why do it? To keep a campaign promise Trump almost certainly didn’t understand? Because he thinks satisfying far-right Israelis will help him with Jewish voters in the United States?\n\nWhen it comes to foreign policy, Trump has been willing to upend decades of bipartisan consensus on a range of international relationships – China, NATO, Australia, the Korean peninsula, Europe, etc. – but today’s shift is clearly among the most dangerous. Trump takes an alarming risk with shift in Israel policy", "http://msnbc.com/morning-joe/watch/joe-steve-bannon-shows-he-s-frightened-of-romney-running-in-utah-1110528067965": "Former WH chief strategist Steve Bannon sharply attacked Mitt Romney during a Tuesday rally in Alabama for Roy Moore. Bannon went after Romney for not serving in the Vietnam War. The Morning Joe panel breaks down Bannon's performance.\n\nDuration: {{video.duration.momentjs}} Joe: Steve Bannon shows he's frightened of Romney running in Utah", "http://msnbc.com/the-last-word/watch/trump-w-h-grilled-over-reported-plan-for-private-spy-network-1110361667596": "This is a paid advertisement. This content is created by the advertiser and the NBC News sales department, not the NBC News editorial team. Learn more here. Trump W.H. grilled over reported plan for private spy network", "http://msnbc.tumblr.com/post/148792213949/obama-drops-his-2016-summer-playlist": "MSNBC is the premier destination for breaking news and in-depth analysis of the headlines, as well as commentary and informed perspectives.\n\nElsewhere Obama drops his 2016 summer playlist", "http://msnbc.com/morning-joe/watch/joe-trump-thinks-taking-on-mueller-like-taking-on-rosie-1109839939689": "Did K.T. McFarland, the former WH deputy national security adviser, lie about what she knew regarding Michael Flynn's contact with Russia? The Morning Joe panel breaks down the latest revelations.\n\nDuration: {{video.duration.momentjs}} Joe Scarborough: Trump thinks taking on Mueller like taking on...", "http://msnbc.com/morning-joe/watch/gop-strategist-reacts-to-moore-support-says-party-about-to-lose-her-1109750339963": "President Trump is now fully on board and backing controversial Alabama Senate candidate Roy Moore. Similiarly, the RNC is back supporting Moore as well. GOP strategist, Susan Del Percio, says the party is about to lose her over a move like this.\n\nDuration: {{video.duration.momentjs}} GOP strategist reacts to Moore support, says party about to...", "http://msnbc.tumblr.com/post/148790390931/trump-calls-obama-the-founder-of-isis-donald": "Donald Trump on Wednesday night appeared to blame President Barack Obama for the global terror threat, erroneously accusing him of creating ISIS and saying the group “honors” him.\n\n“In many respects, you know, they honor President Obama,” Trump said at a rally in Florida. “He’s the founder of ISIS. He’s the founder of ISIS. He’s the founder. He founded ISIS.”\n\nTrump continued: “I would say the co-founder would be crooked Hillary Clinton.”\n\nAnd then he doubled-down on his comments. Read more here: http://on.msnbc.com/2b1qldw MSNBC", "http://msnbc.tumblr.com/post/148790390931/trump-calls-obama-the-founder-of-isis-donald#notes": "Donald Trump on Wednesday night appeared to blame President Barack Obama for the global terror threat, erroneously accusing him of creating ISIS and saying the group “honors” him.\n\n“In many respects, you know, they honor President Obama,” Trump said at a rally in Florida. “He’s the founder of ISIS. He’s the founder of ISIS. He’s the founder. He founded ISIS.”\n\nTrump continued: “I would say the co-founder would be crooked Hillary Clinton.”\n\nAnd then he doubled-down on his comments. Read more here: http://on.msnbc.com/2b1qldw MSNBC"}