{"https://www.naturalnewsblogs.com/aspartame-a-hidden-schedule-ii-narcotic/": "What? That can’t be right, you are likely thinking.\n\nIt is.\n\nThe methanol in aspartame affects the dopamine system of the brain causing addiction. Methanol, or wood alcohol, is classified as a severe metabolic poison.\n\nAspartame is a dipeptide molecule produced by joining phenylalanine and aspartic acid. Aspartame itself does not occur naturally but is a manufactured substance. When aspartame is consumed, it is completely broken down by the enzymes in the digestive system into the two amino acids and a type of alcohol called methanol.\n\nMethanol is a schedule II Narcotic.\n\nWhat that means:\n\nSchedule II substances have high abuse potential and severe psychological and/or physical dependence liability. Examples of schedule II substances include narcotics, amphetamines, and barbiturates. Prescriptions for schedule II substances can never be ordered with refills and must be filled within 7 days of the date originally written.\n\nYet you can buy diet soda and are encouraged to drink it because it has been marketed as a health product.\n\nAccording to independent doctors and researchers, aspartame can cause a range of symptoms including but not limited to:\n\nHeadaches\n\nMemory Loss\n\nVision Loss\n\nDepression\n\nSeizures\n\nComa\n\nCancer\n\nWorse, it cam mimic symptoms of diseases like MS, Lupus, ADD, Diabetes, Alzheimer’s and Parkinson’s.\n\nIt can be dangerous to take with medications, has reactive properties when combined with MSG (mono sodium glutamate) which is found in tons of packaged foods, and will induce cravings for carbohydrates which often leads to weight gain.\n\nSo much for the myths of diet and or healthy!\n\n*Best Advice: Never touch a food with aspartame in it again.\n\n*Alternate Advice: If you don’t feel ready to give up diet drinks or foods but are having any of these symptoms try a 60-day aspartame free test and see how much your health improves.\n\nReferences:\n\nhttp://www.wnho.net/aspartame_death_tax.htm\n\nhttp://216.218.243.84/~aspartam/page_a13.html\n\nhttp://medical.tpub.com/14295/css/14295_263.htm\n\nhttp://andevidencelibrary.com/topic.cfm?cat=4089&auth=1\n\nhttp://www.mpwhi.com/what_is_aspartame-2up.pdf\n\nhttp://www.sciencedirect.com/science/article/pii/S1043661805001404 Aspartame – A Hidden Schedule II Narcotic", "https://www.naturalnewsblogs.com/alpha-lipoic-acid-miracle-molecule-combats-chronic-diseases-promotes-healthy-lifespan/": "Alpha Lipoic Acid: The Miracle Molecule that Combats Chronic Diseases and Promotes a Healthy Lifespan.\n\nWe usually think of miracle molecules as substances that we accidentally discovered to have potent drug properties that cured or greatly relieved individual suffering. Penicillin, perhaps the most well-known such substance, was discovered by Alexander Fleming in 1929 and is still used today. The disease paradigm that existed in that time period is very different from what we experience today. Acute, life-threatening diseases are now well-controlled, but chronic debilitating diseases have become the norm. The remarkable properties of the natural substance alpha lipoic acid make it the miracle molecule of our time.\n\nA Change in Focus From Acute Disease to Chronic Disease\n\nWhen penicillin was discovered, the primary focus of medicine was on the treatment of acute, life-threatening medical conditions. In the early 20th century, the average life expectancy was short (50+). There was little interest in treating the relatively few people who were dying of “old age”. This situation has changed as medical science has generally succeeded in keeping people alive by eliminating or treating many acute lethal conditions. And in so doing, science and medicine have created a longer-lived population that faces a great many age-related chronic diseases.\n\nThe Young Billionaires Make a Move\n\nOur highly successful efforts to extend life during the past 50 years have awoken many of our young billionaires to their own mortality. They are attempting a giant step forward, putting large sums into research on slowing or even stopping aging. I suspect that they will make some progress and we will be hearing exaggerated accounts of their exploits. The story fits well with our media that is fixated on the “fountain of youth” story-line. I won’t recognize any of them, but suspect that we will be seeing all of the billionaires in the same afterlife we all transition to. Unless frozen bodies somehow interfere with the normal process.\n\nLike the young billionaires, I have developed a strong interest in healthy aging and longevity, based on both personal and professional circumstances. The personal circumstance is that I am now in the ranks of the octogenarians. This circumstance gives me the opportunity to experience aging on a personal level, and put some healthy aging theories to the test in my private, still mobile laboratory. On the professional side, I am the Chief Science Officer for Ethical Alternative Products, the company that arguably makes the best alpha lipoic acid product currently available.\n\nAlpha Lipoic Acid – The Miracle Molecule You Probably Never Heard About\n\nI became aware of alpha lipoic acid about 20 years ago, and since then I have focused my attention on its life-enhancing, pro-health properties. Unlike penicillin, alpha lipoic acid is produced by the body and works as a co-factor in energy production. Surprisingly, the beneficial properties of alpha lipoic acid that combat chronic diseases are not realized by the small amount of ALA produced by the body. The real value of alpha lipoic acid for combating chronic diseases is realized when it is used in large supplemental amounts. In supplement form ALA counter-acts oxidative stress, a condition common to most chronic diseases.\n\nAlpha lipoic acid is well-known to our scientific community. Many University-based researchers are continuing to explore its beneficial effects on the human body. But for the most part ALA is unknown to the general public. The exceptions are individuals who use ALA on a regular basis to treat peripheral neuropathies, insulin resistance (pre-diabetes), and compromised liver function. Because it is not heavily advertised by large companies with large marketing budgets the public is unaware of ALA, and all of its beneficial effects. This situation exists because alpha lipoic acid is a natural substance that cannot be patented. Lack of patent protection keeps big companies from heavily promoting a product that can be copied and sold for a lower price. It may seem strange that you wouldn’t hear about a product with so many valuable properties, but the structure of our system precludes it.\n\nHow Can Alpha Lipoic Acid Help Me?\n\nIf you still doubt the importance of alpha lipoic acid in combating chronic diseases associated with aging, you can log on to the PubMed Database National Library of Medicine. After entering PubMed, enter the term “alpha lipoic acid” in the search box at the top of the page. You will see a list of all scientific studies performed on alpha lipoic acid. PubMed currently lists more than 4,500 papers on alpha lipoic acid, with this number increasing at a rapid pace.\n\nWhen alpha lipoic acid was discovered (i.e., isolated and identified) by Dr. Irwin Gunsalas in 1951, it was recognized as an important factor in the process of energy production. It wasn’t until many decades later that the other pro-health biological properties (in particular the anti-oxidant properties) were recognized. Alpha lipoic acid is recognized as the “universal” anti-oxidant because it is an amphipathic molecule . This means it has both lipid and aqueous regions that make it soluble in both the aqueous and lipid compartments of the body. This property, combined with its ability to regenerate other anti-oxidants, makes it a superior choice for treating oxidative stress. More recent research has revealed that ALA promotes glutathione synthesis, making its impact on oxidative stress even more robust.\n\nMost health-conscious people have no idea if they are suffering from oxidative stress. We would have difficulty understanding why alpha lipoic acid supplementation would be beneficial to our health. The amazing reality is that oxidative stress is part of the patho-physiology of most chronic diseases. And even more amazing, alpha lipoic acid is rarely used to avoid or lessen the impact of these diseases.\n\nOxidative Stress, Chronic Disease and Aging\n\nOxidative stress is defined as the endogenous imbalance between reactive oxygen species (ROS) and anti-oxidant molecules. This imbalance can occur as a result of infection, inflammation, UV radiation, pollution, excessive alcohol consumption, smoking, and aging, among others. The excess ROS or free radicals lead to molecular damage to cells and tissues. The imbalance can be reduced by minimizing the sources of the free radicals, or by increasing anti-oxidant capacity.\n\nThe “free-radical theory of aging” was proposed by Denham Harman in 1956. It postulates that the inborn process of aging is caused by the cumulative oxidative damage to cells by free radicals during aerobic respiration. Free radicals are unstable and highly reactive, as they attack nearby molecules to steal their electrons and gain stability. Free radicals are generated in vivo primarily within mitochondria during mitochondrial electron transport. While the “free radical theory of aging” has many believers, other theories have been advanced to explain aging. It’s interesting to note that one of the more prominent current theories on aging, “telomere shortening” appears to be mediated by oxidative stress damage to the DNA end-caps during cell division.\n\nNot a “Fountain of Youth” Drug, but a Steady Trickle of Pro-Health Biological Activity\n\nThe popular media is fixated on “magic bullet” drugs that will end the deleterious effects of aging. Popping a pill on a daily basis, or getting a drug or “young blood” infusions on a monthly or quarterly basis can avoid these effects. I have no doubt that this is the objective of the research programs being bank-rolled by the young billionaires. In their ideal scenario humans would be able to consume the unhealthiest foods, and be able to avoid using their muscles during everyday activities. And in spite of these unhealthy practices would survive forever thanks to the magic bullet that our scientists will have discovered. With due respect to the young billionaires and the Methuselah Foundation, finding that magic bullet isn’t in the cards for many centuries to come, if ever.\n\nFor the foreseeable future, I believe that alpha lipoic acid is the closest we will come to an anti-aging “magic bullet”. Alpha lipoic acid is a naturally occurring substance that doesn’t have the robust pharmacological effect associated with synthesized drugs. It also doesn’t have the harmful side effects that are almost always a part of the biological effects of drugs. Alpha lipoic acid is a strange and remarkable molecule. The small quantities that are produced by the body act as a co-factor in energy production by the mitochondria. When excess quantities of ALA are consumed, there is little or no effect in energy production, but oxidative stress is reduced. Because alpha lipoic acid acts as an anti-oxidant in lab experiments, we assume that it acts as an anti-oxidant inside the body. It’s now known alpha lipoic acid stimulates glutathione production and may exert its anti-oxidant effect through this pathway.\n\nOxidative Stress is the Common Connection\n\nOxidative stress is involved in the pathology of most chronic diseases. Administering a substance that counter-acts these effects would seem a logical course of action. Alpha lipoic acid fulfills this need admirably, as it is soluble in the lipid and aqueous compartments of the body. And it stimulates the production of our natural anti-oxidant molecules.\n\nAlpha lipoic acid is particularly effective in counter-acting the oxidative stress associated with nerve degeneration, and liver disease. Recent research suggests that it is beneficial in oxidative stress associated with sarcopenia (muscle-wasting), chronic kidney disease, secondary progressive MS, and telomere shortening. In addition, alpha lipoic acid has demonstrated other biological properties favorable to our overall well-being. Prominent among these properties are its effect on the genetic mTORC1 pathway. This pathway mimics the favorable effects of caloric restriction (CR) on diminishing chronic disease and promoting longevity. Alpha lipoic acid also improves insulin sensitivity, chelates heavy metals, restores the biological clock, protects the skin and diminishes wrinkles. The list continues to grow.\n\nWhere Can I Get This Incredible Pro-Health Product\n\nThere are thousands of places that sell alpha lipoic acid, but caution should be exercised due to one of the only practical drawbacks of this amazing molecule. Alpha lipoic acid in powder form is poorly soluble in water and thus poorly absorbed from the intestines. Poor absorption results in diminished bioavailability and ultimately diminished uptake in the cells where it exerts its biological effects. As with products like Advil and CoQ10, alpha lipoic acid can be formulated in a manner that enhances absorption and bioavailability. The source of the raw material alpha lipoic acid and its formulation for enhanced bioavailability are key factors in achieving the maximum benefits of this miracle molecule.\n\nLipoic Acid. Micro-nutrient Information Center. Linus Pauling Institute. Oregon State University.\n\nTrends in Oxidative Aging Theories.\n\nTelomeres, oxidative stress and inflammatory factors: partners in cellular senescence? Alpha Lipoic Acid: The Miracle Molecule that Combats Chronic Diseases and Promotes a Healthy Lifespan.", "https://www.naturalnewsblogs.com/warning-avoid-walmarts-great-value-unmeltable-ice-cream-sandwich-cost/": "Earlier this summer a mom in Cincinnati made an astonishing discovery. Her son accidentally left his Walmart’s Great Value Ice Cream Sandwich outside while playing in 80° F (about 27°C).\n\nAfter more than 12 hours she found the ice cream her son had left untouched and it wasn’t melted. The woman couldn’t believe what she was seeing and repeated the experiment. And to her astonishment the other ice cream didn’t melt either.\n\nA video of the everlasting, unmeltable ice cream went viral on internet (click here to see the video). An embarrassed Walmart spokesman came up with the theory that the ice cream sandwich didn’t melt due to its high cream content. But is a high cream content the real ingredient that makes this ice cream unmeltable?\n\nThe answer is NO, according to a professor Sean O’Keefe. It is actually the other way around. More cream or fat makes ice cream melt faster! Non-fat or non-cream ice cream takes longer to melt due to its higher water content.\n\nWhat Makes It Unmeltable?\n\nWalmart’s great value ice cream sandwich contains corn syrup, guar gum, carob bean gum, cellulose gum, carrageenan, artificial flavors, MSG, and much more additives and preservatives that aren’t even considered food. The high amounts of all sorts of gums in this type of ice cream is probably the reason why it doesn’t melt.\n\nGums are complex carbs that were originally derived from plants to be used as thickeners or gel-forming agents. These days however most gums are synthetically made in the lab.\n\nGums and other chemically altered substance are not found in high quality or homemade ice creams, but this one bursts with it. Real ice cream, or the one you make at home, actually contains very few ingredients. Milk, cream, sugar, vanilla, chocolate or fresh fruits are basically it.\n\nArtificial food ingredients have been linked to a wide range of health issues, including cancer, Alzheimer’s, allergies, and cardiovascular issues.\n\nAnd did you know that to be called an ice cream, the product must only contain 10% milk and the rest can be anything else. So as always make sure to read your labels, avoid processed food and try and make your own and safe ice creams at home so that you absolutely know what’s in them.\n\nThis Walmart ice cream issue is actually not the only story out there. Have you ever seen the picture passing by from the eternal Mc Donald hamburger that lasts forever without getting moldy (it is spoilage free since 1996)? They found that the meat patty is loaded with salt (sodium) which is a preservative and the hamburger bun doesn’t even come close to real, natural bread.\n\nSo I can’t stress enough how important it is to read food labels and opt for whole, fresh, organic foods as much as possible.\n\nAlso read:\n\n10 Easy Ways To Eat Organic Food Without Breaking The Bank\n\nClean Eating 101: Simple Rules To Live A Healthy And Clean Lifestyle\n\n10 Easy Ways To Alkalize Your Body And Improve Overall Health\n\nDon’t forget to download my FREE green smoothie eBook to sneak more fresh, whole foods into your diet or connect with me on Facebook or Google+ for more healthy tips, tricks, and recipes. Warning: Avoid Walmart’s Great Value Unmeltable Ice Cream Sandwich At All Cost", "https://www.naturalnewsblogs.com/breast-cancer-survivor-says-raw-food-diet-helped-heal/": "Janette Murray-Wakelin is a breast cancer survivor who credits a raw food diet, meditation, physical activity, and following her intuition for her ability heal. In the early 2000s, she was diagnosed with Stage 3 breast cancer and told that she had just six months to live, without any guarantees. However, within those same six months, she was given a clean bill of health and also went on to participate in hundreds of marathons in only one year.(1,2) That’s right, in just one year.\n\nShe explains that she was offered chemotherapy, but that it “didn’t make sense” to her.(1)\n\n“I was already compromised, so why would I compromise myself further so I’d get another six months of being sick?”(1) Rather than embrace what she calls a “very fear-driven” mindset that many doctors create in such a situation, she shunned their chemo and radiation recommendations in favor of alternative methods that she felt were significantly wiser and healthier choices. “Most people go with what their doctor says because they don’t realize that they can take responsibility and control themselves,” Murray-Wakelin says.(1)\n\nThe Decision to Walk Away from Traditional Cancer Treatments\n\nSo, without hesitation, she walked away from traditional cancer treatments and started asking herself what she could put in her body to make a difference. What made the most sense to her was to enjoy a diet filled with high-nutrient, living foods.(1)\n\nAustralia resident Murray-Wakelin, who was a vegetarian at the time of her diagnosis — something she says worked in her favor, making her better poised to fight her breast cancer and respond to juicing — had always been interested in fitness and health. However, she believes that accidental exposure to high-chemical substances that got on her skin and being in an area where she was exposed to toxic levels of pollution led to her diagnosis.(1)\n\nUpon receiving news of her breast cancer, she immediately immersed herself in research and read up on others who chose to forego traditional cancer treatments. Referring to many books and studies that have a slew of side effects and questionable results listed, she notes that “…the smaller the print got, the more it became obvious that this was not the thing to do.”(1) Instead, she turned to the book The Breuss Cancer Cure by Rudolph Breuss, doing a 42-day juice fast based on its writings.(1)\n\nHealing Foods for Breast Cancer Recovery\n\nFor her particular situation, the fast included several healthy foods from the Brassicaceae family such as beet root, broccoli, and Brussels sprouts.(1) After 42 days, she added other foods such as carrots and green apple to her juices.\n\nWheat grass was also a must, helping to rid harmful cells. “Cancer cannot survive in an oxygenated environment, therefore the more oxygen I could pump into the body through exercise, conscious breathing and drinking wheat grass, the better,” she says.(2) She says that the idea was to starve her cancer while at the same time, provide the body with nothing but essential nutrients to keep it going strong.(1)\n\nWhy Staying Physically Active Keeps Cancer at Bay\n\nAs for fitness, she explains that doctors told her to take it easy and to stop running. “So, the first thing I did,” she says with a laugh, “was increase my distance.”(1) Once again, she stresses the importance of how cancer cells can not thrive in an oxygenated environment, which is why she felt exercising more and not less, was essential.\n\nJust how active has she been?\n\nIn 2013, her and her husband ran 365 marathons for 365 consecutive days throughout the year. On January 1, 2014, they ran one more which set a new world record for the most consecutive marathons.(3) By the way, they’re both in their sixties! They say their 100% raw vegan plant-based diet, awareness of sustainability, and faith in human kindness and healing naturally keeps them motivated.(3) Barefoot shoes, they add, help too.\n\nShe describes having tons of energy and feeling “fantastic.”(2)\n\n“There is absolutely no doubt in my mind that consuming 100% raw food made a huge difference to my recovery time and to my overall healing,” she says.(2) “My diagnosis of cancer and resulting journey to optimum health has been an experience I am truly grateful for. I know for certain that I will continue on the raw path, as I continue to experience more health benefits and an ever-increasing enlightened consciousness. Every day is exciting when you are raw!”\n\nSources for this article include:\n\n(1) https://www.youtube.com/\n\n(2) http://www.rawcancure.com/\n\n(3) http://www.runningrawaroundaustralia.com/ Breast Cancer Survivor Says Raw Food Diet Helped Her Heal", "https://www.naturalnewsblogs.com/10-nutritional-deficiencies-that-cause-depression-and-mood-disorders/": "Depression and mood disorders are devastating health problems today. When you go to your doctor, their answer is often a prescription for one of the various popular anti-depressant drugs. Many doctors do not investigate for metabolic or nutritional deficiencies that may be the ‘real problem’ for your depression. Patients have no idea why they feel so awful or where to start looking for the answer. They expect their doctor to give them real solutions. Instead they get drugs as the easy fix. Drugs are not an easy fix because of the serious side effects that come with taking them. Doctors prescribe these drugs from information they get from the drug sales rep which often is only part-truth. The side effects and dangers of these drugs are down-played or left out altogether. Prescription drugs should only be prescribed after other medical problems have been ruled out.\n\nLearn About 10 Nutrient Deficiencies That Cause Depression and Mood Disorder Symptoms:\n\n\n\nIf you suffer from depression or mood disorders you may be deficient in one of the nutrients below. Researchers have found that many people who suffer from depression and mood disorders are deficient in not just one nutrient but several, all contributing to the symptoms.\n\n#1: Healthy Food Deficiency? Junk Food Diet Is your diet filled with sugar, junk foods, sodas, or processed foods? Do you often skip meals. If you suffer from depression or mood disorders, start a food diary of the foods you eat every day. You will find answers to your health problems while doing that. Your shopping cart and refrigerator tell the story of your health. My husband works as a cashier at Walmart. People shopping for their family fill their cart with junk sugar filled cereal, chips, candy, soda, , TV dinners, and over-processed food in general. Seven-Elevens thrive on selling candy, soda, and chips to the eat-on-the-run customers. There are very few fresh vegetables or fruit on the average American’s grocery list. This is why so many Americans are obese, depressed, and suffering from diabetes. If your life is not going well, eating junk food is not going to improve your outlook.\n\n#2: Omega-3 Fatty Acids Deficiency: These are found in foods such as fish and Flax Seed Oil. A deficiency of Omega-3 fatty acids or an imbalance between Omega 3 and Omega 6 fatty acids may be one of the contributing factors to your depression. Omega 3 Fatty acids are important to brain function and your mental outlook on life. They also help people who suffer from inflammation and pain problems. Researchers have found that many patients with depression and mood disorders are deficient in Omega 3 Fatty Acids. It is important to buy fish oil that has been cold processed and tested for heavy metals and other contamination. It should state that on the label.\n\n#3: Vitamin D Deficiency: Important to immune function, bones, and brain health. Sunlight is the richest source for natural Vitamin D. The Journal Clinical Nutrition in Jan 21st, 2013 published the result of research that analyzed over 18000 British citizens for Vitamin D deficiencies and associated mental disorders links. They found that a deficiency of Vitamin D was present in patients with depression and panic disorders. The study results stated that people who are deficient in Vitamin D are at higher risk for developing depression later in life. Most seniors are deficient in Vitamin D. Often people working long hours in offices are deficient as well. Get out in the sun. Take a walk during your lunch break or walk your dog. Play a game with your kids outside away from computers and the television. Get out of the house and into the sunshine. Just don’t overdo it if you are sensitive to the sun. Overdoing it is not good either.\n\n#4: B-Vitamins Deficiency: There is much research in Neuropsychiatry that proves the link between B-Vitamin deficiencies and mood disorders including depression. Buy gel capsules instead of tablets with at least 25 mg for each of the different B- Vitamins included in the formulation.\n\n#5: Zinc , Folate, Chromium, and Iron Deficiencies: Patients with depression are often found deficient in many nutrients including these. Often today’s foods are sadly lacking in minerals and trace minerals.\n\n#6: Iodine Deficiency: Iodine is necessary for the thyroid to work properly. The thyroid, part of the endocrine system, is one of the most important glands in your body. The thyroid gland affects every function of the body including body temperature, immune function, and brain function. Iodine is found in foods such as potatoes, cranberries, Kelp, Arame, Hiziki, Kombu, and Wakame. This problem was once solved by using Iodine enriched salt. Today iodine deficiency is again becoming a problem with salt free diets. Salty chips, processed foods, and junk food do not contain iodized salt.\n\n#7: Amino Acids Deficiency: There are 9 necessary amino acids that cannot be manufactured in your body. You must supply them to the body by eating quality food choices.\n\n\n\nAmino acids are found in meat, eggs, fish, high quality beans, seeds and nuts. You need to eat a variety of different foods to furnish the body with all the amino acids needed to be healthy. Not all foods contain all nine amino acids. Vegetable food sources for amino acids include Moringa Oleifera leaves. Your brain uses the amino acids found in the food you eat to manufacture neurotransmitters needed for optimal brain function.\n\nWhat are neurotransmitters and what do they have to do with depression? Healthy brain function needs the proper balance of neurotransmitters. Some neurotransmitters calm the brain and others excite the brain. Their balance in the brain creates stability of emotions and thinking. Often depression and other mental disorders are caused by imbalances in neurotransmitters. Dopamine, noradrenaline, and GABA are three important neurotransmitters often deficient in depression. Orthomolecular physicians have found that treatment with amino acids including tryptophan, tyrosine, phenylalanine, and methionine can correct different mood disorders like depression. The Orthomolecular doctor first takes urine and blood samples to test your amino acid levels. Then if he finds imbalances, you will be given amino acid supplements in the optimal dosage to correct the problem. Orthomolecular doctors treat the base cause for the depression or mental symptoms. If it is a nutritional imbalance such as a Omega 3 deficiency, you will be prescribed that supplement. Instead of treating with drugs, they treat the deficiencies that cause the mental symptoms with vitamins, minerals, and amino acids.\n\nThere are tests that prove nutrient deficiencies. The problem is often your standard medicine doctor will not give clearance for the tests, nor will your insurance pay for them. Most doctors are not schooled in nutrition and diet. They have no time to go over your eating and lifestyle habits. Saying that, a few companies and health providers exist who do have preventive health programs. The reality is a majority of people do not get quality preventive healthcare, especially those on Medicaid or Medical. You need to visit a holistic doctor who knows his nutrition. More than likely you will have to pay out-of-pocket for the tests. You can go through Life Extension Institute. After becoming a member, you can receive the tests through the mail. You take the kit to a lab to get your blood drawn. You then send the kit back by mail and receive the results by mail. They do not give you interpretation for the tests nor how to correct the problems found by testing. You can at least find out what vitamins and minerals you are deficient in. Drug-focused therapy is the main reason that so many people never get diagnosed properly. Insurance plans will pay for drugs but not nutritional supplements. That is the sad state of our health care system here. You must take control of your health and find a doctor whose goal is holistic and preventative medicine.\n\nReferences for Research:\n\nLife Extension : Facebook.com/LifeExtension ; Titter.com/LifeExtension ; Life Extension Customer service: 800-678-8989 It is a paid membership to access their products and research. Reduced cost on lab tests is part of membership benefits.\n\nhttp://healthyfoodpost.com/2012/10/15/what-are-the-best-sources-of-amino-acids/\n\nhttp://www.alternativementalhealth.com/articles/depression.htm\n\nhttp://www.newsmaxhealth.com/Dr-Brownstein/vitamin-D-depression-panic-attacks-sunshine/2013/06/19/id/5107\n\nhttp://www.moringa4healing.com/index.html Nutritional Deficiencies That Cause Depression and Mood Disorders", "https://www.naturalnews.com/2017-12-04-statins-are-gateway-drugs-take-one-you-will-need-more-prescriptions-side-effects.html": "(Natural News) One out of every three American adults take statins, and if you think that sounds like good news for statin manufacturers, you’re missing the bigger picture. All of Big Pharma benefits when people take statins. In fact, statins can really be thought of as gateway drugs. After all, they have so many side effects that you will likely end up taking several other medications after you start statins just to deal with them.\n\nWhat can happen to you if you take these dangerous drugs? They suppress your body’s immune system, rendering it less able to fight off infections. They also inhibit production of coenzyme Q10, which helps to regulate your immune and nervous system and maintain a healthy heart and blood pressure. There’s also a higher risk of neurological diseases when you take statins, with many patients reporting forgetfulness, confusion and memory loss. But don’t worry – whatever happens to you, Big Pharma has a solution for that, too!\n\nStatins also increase your risk of diabetes, so much so that the FDA has required that a warning label be placed on the package informing people of the link between statins, higher blood glucose levels and diabetes. The risk is especially heightened if you are an older woman. An Australian study found that elderly women who took high doses of statins had a 50 percent higher risk of developing diabetes. This could mean you’ll end up on diabetes medication for the rest of your life.\n\nAnd for what benefit are you placing yourself at so much risk? According to research published in BMJ, taking statins over the course of two to five years adds just 3.2 days to a patient’s lifespan on average – if the side effects don’t kill them first. Yes, they’ve been approved by the FDA, but how many times has the FDA had to pull drugs after initially approving them as their dangers became too obvious to ignore?\n\nStatin alternatives\n\nIf all this make you want to keep your distance from statins, you will be pleased to know there are some great alternatives. Dr. Jack Wolfson, a Phoenix-area holistic cardiologist, believes that a wellness model needs to be followed rather than a sickness one.\n\nIn an interview with Mike Adams, the Health Ranger, he pointed out that cardiologists sometimes fall into the easy routine of blindly prescribing statins as Big Pharma tells them to and collecting a paycheck. After all, they’ve got medical school loans to pay off.\n\nDr. Wolfson asks why people would want to choose statins, which can reduce the risks associated with high cholesterol slightly yet put them at risk of many other problems, when they could take safe actions that bring their risks down to zero? He said that nobody says they feel better when they take statins and blood pressure medications. In contrast, those who turn to evidence-based supplements often report feeling great, losing weight, and having more energy.\n\nSome of the alternatives he mentioned in the interview include beetroot powder, magnesium, and Omega 3. He says that we can make such a big difference in our health through food., and he also points out how powerful the sun can be in keeping us healthy. He also suggests that people get more physical activity, such as walking or gardening.\n\nWhen your health is less than optimum, Dr. Wolfson says, your body is deficient in nutrients, not pharmaceuticals. Drugs might be good for emergencies, but when it comes to prevention, you can’t beat a healthy, well-rounded and nutritious diet, physical activity, and good old-fashioned sunshine. What do you have to lose by trying it?\n\nWatch the full, shocking interview with Dr. Wolfson below.\n\nSources for this article include:\n\nNaturalNews.com\n\nNaturalNews.com Statins are gateway drugs for Big Pharma: Take one and you’ll need four or five more prescriptions for the side effects", "https://www.naturalnews.com/2017-11-13-camouflage-gardening-a-must-have-for-survivalist-and-preppers.html": "(Natural News) Every serious prepper knows how important it is to have their own garden so that they can continue to eat in the event that grocery stores become empty following societal collapse. However, it’s also important to realize that in such a situation, the rule of law may very well become nonexistent, meaning that it’s entirely possible that your garden may be raided and looted. That’s why it would be wise to consider growing a camouflage garden.\n\nAs explained by the website Survival At Home, camouflage gardening is the process of growing crops that can be used for both food and medical purposes in a way that makes them hard to identify to others who would otherwise attempt to steal them. Since the majority of Americans are disconnected from our food system and unable to tell the difference between medicinal herbs, for example, and decorative landscaping, camouflage gardening is a great option for those who want to remain self-sufficient without exposing their essential survival goods to the entire population. (Related: Growing a vegetable garden is much easier than you think – here’s how.)\n\nAs previously mentioned, the goal of a camouflage garden is to make it look like anything but food is being grown, while still producing a plethora of edible plants that can feed you and your family. One such plant is the daylily, which looks like nothing more than a beautiful purple and white flower but also contains edible tubers that taste similar to a water chestnut.\n\nSunchokes would be another great addition to your camouflage garden. Also called Jerusalem Artichokes, Sunchokes contain edible tubers similar to the daylily, but instead of tasting similar to water chestnuts, the tubers grown from Sunchokes taste and are used like potatoes. In addition, the Sunchoke’s edible tubers contain insulin and naturally occurring fructose, making them a great plant to grow in order to care for diabetics.\n\nAnother plant you can grow in your camouflage garden is Roselle, which is just as attractive as it is beneficial. Their calyces can be used for a number of things, from beverages to jams, or even dye and food coloring. Because of the fact that their leaves taste similar to spicy spinach, they can be eaten plain, cooked in soups, or added to other dishes for extra flavor. The stems of the Roselle are also very tough and durable, meaning that they can be used to make cordage or jute-like materials.\n\nMost people see roses growing in one’s front lawn and think that they are nothing but a decorative plant. The reality, though, is that roses have multiple benefits that any serious prepper would be interested in taking advantage of. Rose petals, for instance, are edible and contain high levels of water and vitamin C. The fact that roses have thorns also makes them a great deterrent for intruders looking to break into your home or your place of refuge.\n\nOf course, there are numerous other plants that you can grow that even though may not be camouflaged, are essential to your health and overall well-being, especially in a survival situation. Last year, Natural News outlined five fast-growing superfoods that would be great additions to your home garden: Spinach, which has been shown to help fight cancer and contains Vitamin C, folate, Vitamin K and iron; lettuce, which is a great booster for the immune system and chalk full of Vitamin C; radishes, which contain cancer-fighting anthocyanins, zinc, phosphorous and B-Vitamins; green onions, which are high in potassium and Vitamin C; and baby carrots, which have high levels of beta-carotene that the body transforms into Vitamin A.\n\nSources include:\n\nSurvivalAtHome.com\n\nNaturalNews.com Camouflage gardening: A must-have for survivalist and preppers", "https://www.naturalnewsblogs.com/category/news/politics-government/": "An easily burnable form of energy comes to us in the form of sugar or starch.\n\nCarbohydrates have a very bad public image in that … Politics & Government", "https://www.naturalnews.com/2017-12-04-putin-and-musk-may-be-right-industry-experts-say-it-is-theoretically-impossible-to-make-sure-ai-wont-harm-humans.html": "(Natural News) As researchers continue to make advances in artificial intelligence, or AI, the louder and more frequent the calls are becoming to not simply tread lightly with the technology but to abandon it completely.\n\nAnd why? Because many fear that the technology will someday turn on humans and wipe all of us out.\n\nOne of the most vocal in promoting this theory has been entrepreneur and Tesla founder Elon Musk who, with scientist Stephen Hawking, wrote an open letter to the tech industry in 2015 warning that AI would not only put tens of millions of people out of work, but likely will make self-learning robots far more intelligent than humans in the long run. And when that happens, they say, we’ll be at risk of extinction from killer robots.\n\nThis warning was recently repeated, albeit in a somewhat less dramatic way, by Russian President Vladimir Putin, who told a million Russian school children via satellite video link in September that AI “is the future” for “all of mankind.”\n\n“Whoever becomes the leader in this sphere will become ruler of the world,” he said.\n\nTurns out that these men may be exactly right.\n\nIn an essay published on the website of the IMDEA Networks Institute — a networking research organization with a multinational research team engaged in cutting-edge fundamental scientific research — “containing” a “superintelligence” AI system is “theoretically impossible,” meaning it could not be ‘taught’ or ‘forced’ to protect or defend humans.\n\n“Machines that ‘learn’ and make decisions on their own are proliferating in our daily lives via social networks and smartphones, and experts are already thinking about how we can engineer them so that they don’t go rogue,” the essay says.\n\nSome of the suggestions made thus far include “training” self-learning machines to ignore specific kinds of data and information that might allow them to learn racism or sexism and coding them so that they demonstrate values of empathy and respect.\n\n“But according to some new work from researchers at the Universidad Autónoma de Madrid, as well as other schools in Spain, the US, and Australia, once an AI becomes ‘superintelligent’ —think Ex Machina — it will be impossible to contain it,” the essay says.\n\nWhat would a “superintelligence” program look like? It likely would be one that contained every other program that exists, complete with the ability to obtain new programs as they become available. (Related: Elon Musk warns AI could wipe out humanity.)\n\nThen again, since AI is self-learning, at this stage the “superintelligence” robot, computer or device would be able to produce its own coding and programming, and in real time. That’s how fast these kinds of machines would learn — then produce and react.\n\nRight now the thought that machines can rule the world is nothing more than a theory. But it’s one that has some very smart people very concerned about where AI will take us, and not too long in the future.\n\nPutin may not have alluded to military applications for AI in his chat with Russian school children, but don’t think for a moment he isn’t thinking about how to adapt the technology to existing (and future) weapons systems.\n\nRather than just building “killer” robots that can learn at an accelerated speed, imagine standard weapons systems that think and adapt on the fly.\n\nTake ICBMs, for instance. At present, missiles have some ability to adjust in flight, thanks to satellite-fed data links. That makes them more difficult for anti-missile systems to hit.\n\nBut what if incoming ICBMs could spot threats and adjust to them in real time, without human intervention? They would become far more deadly and accurate – and far harder to defend against.\n\n“AI research is likely to deliver a revolution in military technology on par with the invention of aircraft and nuclear weapons,” Gregory Allen wrote for CNN. “In other words, Musk is correct that each country is pursuing AI superiority and that this pursuit brings new risks.”\n\nJ. D. Heyes is a senior correspondent for the Natural News network of sites and editor of The National Sentinel.\n\nSources include:\n\nCNN.com\n\nIMDEA.org\n\nNaturalNews.com Putin and Musk may be right: Industry experts say it is theoretically impossible to make sure AI won’t harm humans", "https://www.naturalnews.com/2017-12-04-how-relapses-from-illness-happen-researchers-discover-that-some-bacteria-hide-until-the-immune-system-calms-then-attack-again.html": "(Natural News) According to a study published in 2016, scientists have discovered a bacteria “alarm clock” that can wake dormant Salmonella in the body which enables the bug to trigger a relapse.\n\nThe researchers from Imperial College London say that the “alarm clock” is common among various types of bacteria, such as Salmonella and E. coli. Their discovery could explain why some people suffer repeated bouts of infections, like ear or urinary tract infections, even though they take antibiotics. The team aims to use these findings to look into “hard-to-treat infections.”\n\nDr. Sophie Helaine, the lead author of the research from the Department of Medicine at Imperial, said, “Whenever bacteria such as Salmonella invade the body, around a third of the bugs ‘cloak’ themselves as a defence mechanism against the body’s immune system. They enter a type of stand-by mode possibly to hide from the body’s immune system, that means they are not killed by antibiotics. The bacteria stop replicating and can remain in this dormant state for days, weeks or even months. When the immune system attack has passed, some bacterial cells spring back to life and trigger another infection.”\n\nDr. Helaine continued, “This is why, for instance, a woman may think she has recovered from a urinary tract infection – and yet days or weeks later it seems to return. Many patients may assume it’s a different infection – but actually it’s the same bug.” (Related: Boosting immune system with natural methods offers many health benefits.)\n\nShe adds that these so-called persistent bacteria also “fuel antibiotic resistance,” and this is why patients end up taking many courses of antibiotics for one infection. Taking this amount of antibiotics means that some bacteria are “developing resistance.”\n\nEarlier research from Dr. Helaine’s lab determined that Salmonella bacteria go into stand-by mode by “poisoning” themselves using toxins.\n\nIn the current study, the team showed a mechanism that Salmonella use “to detoxify themselves.” This wakes them from stand-by and lets them start growing again.\n\nDr. Helaine said it is possible that many bacteria use this same toxin, called TacT, to “switch into stand-by mode.” These bacteria include those that cause many intestinal, ear, throat, or urinary tract infections and even tuberculosis.\n\nDr. Helaine shares that if they can determine how to control this particular mechanism and “force the bacteria out of stand-by” they can then be treated with antibiotics, effectively killing them.\n\nFor the study, Dr. Helaine et al. used Salmonella cells in the laboratory to identify the bacterial alarm clock. The team tested a collection of over 4,000 proteins to look for those that wake the bacteria up. They isolated an enzyme called peptidyl-tRNA hydrolase (Pth) that was an effective alarm clock.\n\nThe scientists have determined that the toxin TacT “stops cell growth during times of attack by blocking protein production.” When the conditions are more suitable for cell growth, Pth molecules eliminate the block on protein production and lets the growth continue.\n\nDr. Helaine concluded, “When the bacteria are under attack they go to sleep and wait for better days. Then once the immune system attack has passed, the body is once again a favourable place to start an infection, and cell growth resumes.”\n\nBoost your immune system naturally\n\nDon’t wait until you need antibiotics to get better. Try these natural tips to boost your immune system instead:\n\nGet a good night’s rest and manage stress — Sleep deprivation and stress overload increase the hormone cortisol, prolonged elevation of which can suppress immune function.\n\n— Sleep deprivation and stress overload increase the hormone cortisol, prolonged elevation of which can suppress immune function. Quit smoking or avoid second-hand tobacco smoke — Smoking undermines basic immune defenses and increase raises the risk of bronchitis and pneumonia in everyone and middle ear infections in children.\n\n— Smoking undermines basic immune defenses and increase raises the risk of bronchitis and pneumonia in everyone and middle ear infections in children. Eat healthier — Add plenty of vegetables, fruits, nuts, and seeds to your diet so your body has all the nutrients your immune system needs.\n\nYou can read more articles about preventing infections and illness at Prevention.news.\n\nSources include:\n\nImperial.AC.uk\n\nEverydayHealth.com How relapses from illness happen: Researchers discover that some bacteria hide until the immune system calms, then attack again", "https://www.naturalnews.com/2017-11-06-no-longer-a-conspiracy-theory-china-running-chemical-warfare-against-america-with-steady-supply-of-deadly-opioid-chemicals.html": "(Natural News) When we think of weapons of war, most of us typically think about machine guns, frag grenades or bulletproof tanks. But in 2017, manmade machines aren’t the only type of weapon that is being used by various nations to harm their enemies.\n\nJust days ago, President Donald Trump left the United States for a 12-day tour of various nations in Asia. During his visit to Beijing, Trump plans on addressing China’s production and distribution of the synthetic opioid known as Fentanyl, which is considered by the DEA to be one of the most dangerous types of narcotics due to its cheap price, widespread use, addictive quality and it’s devastating effects. Considering the fact that the U.S.-China Economic and Security Review Commission has called the problem “China’s deadly export to the United States,” President Trump should be praised for speaking out about it on his tour of Asia. Indeed, forcing China’s hand on the production and distribution of Fentanyl is the right thing to do.\n\nKnown as “China Girl” or “China White” on the streets, Fentanyl is a highly dangerous chemical that has destroyed countless American lives, making it an extremely valuable export for Chinese-run drug cartels and distributors within the United States. Considering the fact that China’s authoritative government has control over virtually every aspect of its citizens lives, from what young people learn in school to what type of content is allowed to be spread across the Internet, it is without question that the regime would also be capable of stopping the production and distribution of Fentanyl as well. But just because they can doesn’t necessarily mean that they will.\n\nTo say that China has a solid understanding of just how effective a manufactured Opium War can be when it comes to destroying an entire nation is an understatement. This is because, in the 19th century, China experienced what they now call the “Century of Humiliation,” which first began amidst widespread opioid addiction and lasted until the mid-1900s. Now, it appears as though China is taking the lessons that it learned during those devastating hundred years and using it against its enemies, albeit under the radar.\n\nThe opioid epidemic in the United States is arguably more serious than it ever has been, with millions of Americans becoming severely addicted to the drug and hundreds of thousands of families being torn apart as a result. People are dying, and our nation’s leaders are working relentlessly to find an effective solution.\n\nLast month, President Trump and First Lady Melania Trump urged the people of the United States to join the fight against this ongoing opioid crisis and declared a state of emergency. “As Americans, we cannot allow this to continue,” the president said. “It is time to liberate our communities from this scourge of drug addiction. We can be the generation that ends the opioid epidemic.” (Related: Opioids are killing thousands of Americans but alternative medicine backers say there has always been a better way to treat pain.)\n\nTrump put emphasis on the fact that drug overdose deaths are the leading cause of unintentional deaths, and that opioid addiction kills more Americans than gun homicides and car accidents combined. “For too long we have allowed drugs to ravage American homes, cities, and towns,” he said. “We owe it to our children and to our country to do everything in our power to address this national shame and this human tragedy.” (Related: Opioid drug manufacturers have been caught bribing doctors with lucrative kickbacks.)\n\nPresident Donald Trump also took time to address the importance of treatment for opioid addictions. “We understand the need to confront reality right smack in the face – that millions of our fellow citizens are already addicted,” he argued. “We want them to get the help they need.”\n\nSources include:\n\nMcClatchyDC.com\n\nBreitbart.com No longer a conspiracy theory: China running “chemical warfare” against America with steady supply of deadly opioid chemicals", "https://www.naturalnews.com/2017-11-16-the-top-10-rules-for-the-next-generation-of-liberty-movement-leaders-part-4-of-4.html": "(Natural News) This is the fourth installment of a four-part series in which Natural News founder/editor Mike Adams, the Health Ranger, presents his 10 powerful rules for the next generation of liberty activists, bloggers, journalists and truth-tellers.\n\nAfter fighting for truth and liberty for over 15 years as one of the world’s top publishers, Adams has created a formula that can help anyone navigate the attacks, censorship, slander, and intimidation that’s dealt out by the corrupt institutions of government, corporations and media.\n\nIn a recent podcast, Adams laid out these rules which he believes are invaluable in helping our next generation of truth-seekers and truth-tellers to navigate the pitfalls and dangers of speaking up for liberty and freedom.\n\nPreviously, Adams noted that one of his rules is that liberty movement leaders who use the Internet to spread the truth about freedom should “plan to have all of your monetization cut off” — that is, every mainstream mechanism you try to utilize in order to fund your sites and organization.\n\n“You wouldn’t believe how many times this happens in the liberty movement,” Adams says in his podcast.\n\nMoving on, Adams — the creator of AlternativeNews.com, NaturalNews.com, FETCH.news, GoodGopher.com (the search engine for alternative media), and host of hundreds of websites authored by the some of the liberty movement’s most prolific authors — said one of his rules is that liberty leaders should never “backstab” others in the movement.\n\n“That’s going to come back to haunt you,” he explained.\n\n“There are certain people in this movement who are just egomaniacs who can’t stand anyone else being successful other than themselves,” Adams continued. As such, “they actively destroy anyone around them who becomes popular or effective.\n\n“This kind of thing goes on, and it’s very sad to see it, but it does exist,” he said. Adams’ advice: If you’re going to be a leader in the liberty movement, “be someone who is just collaborative in helping other people, instead of trying to destroy everybody else around you.”\n\nBy contrast, Adams goes out of his way to help others just getting started in the movement or even those who have been established for some time, not only because it’s the right thing to do but because it advances the cause of liberty. If we all do well, he believes, then we have a much better chance at restoring freedom and liberty across a wider spectrum.\n\nIn addition, Adams knows that the movement needs many voices, not fewer voices, and those should be diverse: Men and women, as well as liberty seekers from all walks of life, all ethnicities and all backgrounds.\n\nAnother rule the Health Ranger seeks to convey is this: Never use your website, radio show or other platforms to call for violence. Noting that leaders should always call for “peaceful revolution” whenever possible, Adams said.\n\n“I know sometimes its tempting” to call for violence “because the government works by coercion and the threat of violence all the time,” he says, but it’s just not wise to put yourself in that position.\n\nRemember that the government — even local governments — have many more resources at their disposal they can use to shut you down, arrest you, jail you, or find other ways to take away your freedom and your ability to make a living. Calling for violence against government entities is one sure-fire way to draw all the wrong kinds of attention to your cause.\n\n“We believe in non-violent revolution wherever possible,” Adams said.\n\nYou should take the time to listen to Adams’ complete “10 rules” for the next generation of freedom movement leaders by clicking here and viewing the video below. The top 10 rules for the next generation of liberty movement leaders (part 4 of 4)", "http://naturalnews.com/2017-07-18-natural-news-releases-new-app-for-android-iphone.html": "Enjoy the new app, and thank you for your daily readership!\n\nUsing our new app, you can browse articles and even save them for offline reading. Future upgrades of the app will include additional features that keep you informed while bypassing corporate censorship.\n\n( Natural News ) We’ve just released an exciting new app on both Android and Apple platforms. The app brings you articles, videos and much more, direct to you and without the censorship of Google, Facebook or email ISPs .\n\nAbout the author: Mike Adams (aka the “Health Ranger“) is a best selling author (#1 best selling science book on Amazon.com called “Food Forensics“), an environmental scientist, a patent holder for a cesium radioactive isotope elimination invention, a multiple award winner for outstanding journalism, a science news publisher and influential commentator on topics ranging from science and medicine to culture and politics. Follow his videos, podcasts, websites and science projects at the links below.\n\nMike Adams serves as the founding editor of NaturalNews.com and the lab science director of an internationally accredited (ISO 17025) analytical laboratory known as CWC Labs. There, he was awarded a Certificate of Excellence for achieving extremely high accuracy in the analysis of toxic elements in unknown water samples using ICP-MS instrumentation. Adams is also highly proficient in running liquid chromatography, ion chromatography and mass spectrometry time-of-flight analytical instrumentation. He has also achieved numerous laboratory breakthroughs in the programming of automated liquid handling robots for sample preparation and external standards prep.\n\nThe U.S. patent office has awarded Mike Adams patent NO. US 9526751 B2 for the invention of “Cesium Eliminator,” a lifesaving invention that removes up to 95% of radioactive cesium from the human digestive tract. Adams has pledged to donate full patent licensing rights to any state or national government that needs to manufacture the product to save human lives in the aftermath of a nuclear accident, disaster, act of war or act of terrorism. He has also stockpiled 10,000 kg of raw material to manufacture Cesium Eliminator in a Texas warehouse, and plans to donate the finished product to help save lives in Texas when the next nuclear event occurs. No independent scientist in the world has done more research on the removal of radioactive elements from the human digestive tract.\n\nAdams is a person of color whose ancestors include Africans and American Indians. He is of Native American heritage, which he credits as inspiring his “Health Ranger” passion for protecting life and nature against the destruction caused by chemicals, heavy metals and other forms of pollution.\n\nAdams is the founder and publisher of the open source science journal Natural Science Journal, the author of numerous peer-reviewed science papers published by the journal, and the author of the world’s first book that published ICP-MS heavy metals analysis results for foods, dietary supplements, pet food, spices and fast food. The book is entitled Food Forensics and is published by BenBella Books.\n\nIn his laboratory research, Adams has made numerous food safety breakthroughs such as revealing rice protein products imported from Asia to be contaminated with toxic heavy metals like lead, cadmium and tungsten. Adams was the first food science researcher to document high levels of tungsten in superfoods. He also discovered over 11 ppm lead in imported mangosteen powder, and led an industry-wide voluntary agreement to limit heavy metals in rice protein products.\n\nIn addition to his lab work, Adams is also the (non-paid) executive director of the non-profit Consumer Wellness Center (CWC), an organization that redirects 100% of its donations receipts to grant programs that teach children and women how to grow their own food or vastly improve their nutrition. Through the non-profit CWC, Adams also launched Nutrition Rescue, a program that donates essential vitamins to people in need. Click here to see some of the CWC success stories.\n\nWith a background in science and software technology, Adams is the original founder of the email newsletter technology company known as Arial Software. Using his technical experience combined with his love for natural health, Adams developed and deployed the content management system currently driving NaturalNews.com. He also engineered the high-level statistical algorithms that power SCIENCE.naturalnews.com, a massive research resource featuring over 10 million scientific studies.\n\nAdams is well known for his incredibly popular consumer activism video blowing the lid on fake blueberries used throughout the food supply. He has also exposed “strange fibers” found in Chicken McNuggets, fake academic credentials of so-called health “gurus,” dangerous “detox” products imported as battery acid and sold for oral consumption, fake acai berry scams, the California raw milk raids, the vaccine research fraud revealed by industry whistleblowers and many other topics.\n\nAdams has also helped defend the rights of home gardeners and protect the medical freedom rights of parents. Adams is widely recognized to have made a remarkable global impact on issues like GMOs, vaccines, nutrition therapies, human consciousness.\n\nIn addition to his activism, Adams is an accomplished musician who has released over fifteen popular songs covering a variety of activism topics.\n\nClick here to read a more detailed bio on Mike Adams, the Health Ranger, at HealthRanger.com.\n\nFind more science, news, commentary and inventions from the Health Ranger at:\n\nDiaspora: (uncensored social network)\n\nShare.NaturalNews.com\n\nGAB.ai:\n\nGAB.ai/healthranger\n\nVimeo:\n\nVimeo.com/healthranger\n\nPodcasts:\n\nHealthRangerReport.com\n\nOnline store:\n\nHealthRangerStore.com\n\n#1 Bestselling Science Book Food Forensics:\n\nFoodForensics.com\n\nFacebook:\n\nFacebook.com/HealthRanger\n\nTwitter:\n\nTwitter.com/HealthRanger\n\niTunes:\n\nitunes.apple.com/us/podcast/the-health-ranger-report/id1063165791\n\nYoutube:\n\nYouTube.com/TheHealthRanger\n\nG+\n\nplus.google.com/u/0/b/106753783877820567659/\n\nSoundCloud:\n\nSoundcloud.com/healthranger\n\nHealth Ranger’s science lab\n\nCWClabs.com\n\nHealth Ranger bio\n\nHealthRanger.com\n\nTruthWiki.org\n\nSearch engine:\n\nGoodGopher.com Natural News releases new app for Android and iPhone ... get it here", "https://www.naturalnews.com/2017-11-18-more-politically-correct-justification-for-bad-behavior-maybe-cyberbullies-are-angry-because-they-have-adhd.html": "(Natural News) Some researchers are putting forth the notion that cyberbullies who troll certain websites and who use Twitter as an offensive weapon are actually suffering a psychological condition known as ADHD, in what sounds like yet another far-Left attempt to justify hate and bad behavior.\n\nAs reported by the U.K.’s Daily Mail, new research allegedly suggests that persons suffering from the condition swear more, are angrier and use words like “hate” and “cry” much more often than non-sufferers. This was suggested after scientists analyzed Twitter posts and recorded their findings.\n\nIn addition, the scientists said that these people often post more frequently between the hours of midnight and 6 a.m., according to findings which were published in the Journal of Attention Disorders, the Daily Mail noted.\n\n“On social media, where you can post your mental state freely, you get a lot of insight into what these people are going through, which might be rare in a clinical setting,” said study author Sharath Chandra Guntuku of the University of Pennsylvania.\n\n“In brief thirty- or sixty-minute sessions with patients, clinicians might not get all manifestations of the condition, but on social media, you have the full spectrum,” Guntuku added.\n\nWhile the study’s results didn’t specifically link ADHD with cyberbullying, its findings claim that sufferers may be more likely to troll other users online.\n\nTo come up with their results, researchers said they followed and analyzed about 1.3 million tweets that were posted by users who self-reported a diagnosis of ADHD. Researchers compared their tweets to users who did not have the disorder. (Related: Is it time to break up the social media giants by using anti-trust laws?)\n\nAs the Daily Mail noted further:\n\nAlthough the study did not specifically mention online bullying, results reveal ADHD sufferers post more swear words on Twitter than non-patients.\n\nThey also more frequently use words such as ‘hate’, ‘cry’, disappointed’ and ‘sad’.\n\nADHD patients also often post tweets between midnight and 6am.\n\nResearchers have hypothesized that quick responses that are possible via Twitter from other users could put ADHD patients in better moods.\n\nThe scientists involved in the study hope that eventually they or others can create condition-specific apps that can provide some insight into mental health disorders like ADHD, anxiety and depression so that patients can better learn and identify their own triggers.\n\nBut how valid are these findings? In the age of social media, there is so much purposeful trolling of certain accounts belonging to public figures, politicians, entertainment stars and others that it’s hard to measure what is and isn’t real. In fact, trolling is a ‘regular thing’ now and is meant to drive narratives and even create news cycles (yes, Twitter is now considered a legitimate “news source” by the “mainstream” media).\n\nOther experts believe that the mainstream social media has itself created and perpetuated bad behavior [there are alternatives, by the way]. Because online communication is not face-to-face and can be made anonymously, they say that people now interact with each other in ways they would never have even a decade ago, before social media became as prominent as it is today.\n\nThis isn’t new. Back in April 2013, Relevant reported that a study found that 80 percent of people surveyed experienced an “increase in rudeness” on social media sites, while one-in-five reported reducing face-to-face contact with a friend over something posted online.\n\nAlso, according to the Wharton School at the University of Pennsylvania, some experts believe that social media is actually making the world less stable.\n\nStill, others just believe that technology, in general, is making humans less sociable. As The Wall Street Journal reported in May 2015, though we use technology to maintain near-constant contact with social networks, some believe that “we spend so much time maintaining superficial connections online that we aren’t dedicating enough time or effort to cultivating deeper real-life relationships. Too much chatter, too little real conversation.”\n\nIs an increase in cyberbullying really tied to ADHD — or are people just demonstrating worse behavior because they can do so from a distance, anonymously?\n\nSources include:\n\nDailyMail.co.uk\n\nNaturalNews.com More politically correct justification for bad behavior: Maybe cyberbullies are angry because they have ADHD", "https://www.naturalnews.com/2017-12-05-standard-procedure-for-heart-attack-found-to-be-ineffective-recent-study-finds-oxygen-therapy-does-not-improve-survival.html": "(Natural News) Some of the common practices seen in modern medicine are not quite as effective as commonly believed, and oxygen therapy for heart attack patients could be one of them as newly presented research has shown that oxygen therapy does not improve the survival rate of patients who have heart attack symptoms.\n\nThe study’s lead author, cardiologist Dr. Robin Hofmann, said that the findings call into question the current routine practice of giving oxygen therapy to patients suspected of having a heart attack.\n\nIn the randomized trial, 6,229 patients with a suspected heart attack in 35 Swedish hospitals were studied. Half of them were given oxygen using an open face mask, while the other half were simply exposed to the air in the room without using a mask.\n\nThere was no statistically significant difference in the mortality rate of any cause after one year between the two groups, with the oxygen group noting a mortality rate of 5 percent and the air group 5.1 percent. In addition, the two groups did not exhibit any significant differences in terms of secondary endpoints, such as the risk of another heart attack or markers in the blood indicating heart muscle injury.\n\nPatients who were considered to have a high risk, such as the elderly, smokers, and those with diabetes or a history of heart disease, showed similar mortality risks, indicating that the treatment may not be as effective as once believed for those in high-risk groups. The median duration of the oxygen therapy administered in the study was 11.6 hours.\n\nThis trial was the first of its kind of a scale big enough for the findings on morbidity to be considered meaningful. It enrolled six times the number of patients that were involved in all of the past randomized trials on this therapy combined, and it looked at a wider range of patients in order to boost the relevancy of its results.\n\nAccording to guidelines issued by the European Society of Cardiology (ESC) for treating patients who have ST-segment elevation myocardial infarction, the current recommended treatment for patients with heart failure, hypoxia, or breathlessness is oxygen via a mask or nasal prongs.\n\nSwedish cardiologist Professor Stefan James of Uppsala University said that the ESC’s guidelines have been shifting slowly in favor of restricting the use of oxygen, and this new data helps support that notion.\n\nNot harmful, not helpful\n\nHe believes the results of this study will have a swift impact on future guidelines and clinical practices. While some experts had been concerned that oxygen therapy might even be harmful after a different trial revealed bigger infarctions in patients who received oxygen therapy, this study did not point to an indicated risk – it only showed that it may not be necessary or offer benefits. Therefore, Professor James points out there is no cause for concern.\n\nEven though oxygen therapy might not be harmful, it does cost money and time, and the time normally used to administer it can now be used for something that might actually help the patients. Oxygen therapy is believed to cost around $100 per patient each day in the U.S., which adds up to significant costs when you consider the number of patients who go to hospitals with suspected heart attacks.\n\nDiscussing the results at a recent convention, Dr. David Newby of Scotland’s University of Edinburgh said that the trial yielded very useful answers to a serious question. “We need to do proper clinical implementation trials where, when we implement it to the patients that we see in the clinic, does it have the benefit that we have [in the trial]? And we’ve had a resounding no for oxygen therapy in normoxic patients.”\n\nFollow more news on heart health at Heart.news.\n\nSources include:\n\nESCardio.org\n\nMedscape.com Standard procedure for heart attack found to be ineffective: Recent study finds oxygen therapy does NOT improve survival", "https://newstarget.com/2017-11-19-liberal-media-admits-the-ultimate-goal-is-gun-confiscation-from-all-citizens-at-gunpoint.html": "Liberal media admits: The ultimate goal is gun confiscation from all citizens… at gunpoint!\n\nRemember all those times the liberal Democrats assured those on the right that they’re not out to take away anyone’s guns? Well, add that one to the long list of the left’s broken promises, right along with “if you like your doctor you can keep your doctor” and “I did not have sexual relations with that woman.”\n\nEarlier this month, David Scharfenberg of the Boston Globe wrote an article titled “Hand Over Your Weapons,” in which he actually argued that total gun confiscation might be the only real solution to preventing mass shootings in this country. “The logic of gun control lies, at bottom, in substantially reducing the number of deadly weapons on the street – and confiscation is far and away the most effective approach,” Scharfenberg said. “Is there any conceivable turn of events in our politics that could make confiscation happen? And what would a mass seizure look like?”\n\nRight from the start, it’s clear that Scharfenberg hasn’t spent much time thinking this idea through. Total gun confiscation in America would most likely be a two-part process. First, the people would be given a chance to voluntarily surrender their firearms to their local or state government within a certain time frame. Millions of gun owners would inevitably refuse, citing their right to bear arms under the Second Amendment of the Constitution. Tensions between the government and the people would continue to grow to the point where federal agents would literally start going door to door collecting firearms, potentially igniting a civil war within a matter of months.\n\nSorry, Mr. Scharfenberg, but your idea really isn’t a good one. (Related: Leftists are lying about gun control by failing to mention that the vast majority of gun deaths in America are suicides.)\n\nHis piece in the Boston Globe continued, “Ultimately, if gun-control advocates really want to stanch the blood, there’s no way around it: They’ll have to persuade more people of the need to confiscate millions of those firearms, as radical as that idea may now seem.”\n\nBut the truth is that idea doesn’t just seem radical; it is radical. It really makes you wonder whether or not proponents of gun control ever even consider the Second Amendment before making the arguments that they do. It wasn’t long ago that Democrats tried to argue that their gun control proposals were in full compliance with the Constitution; now, however, it’s as if the Constitution has been thrown out the window completely. Simply put, the liberals’ arguments have transformed from “we want more gun regulations, but don’t worry, we will respect the Second Amendment at the same time” to “we want more gun regulations, and we want them now.”\n\nFurthermore, liberals consistently deny the fact that there is a positive relationship between gun laws and crime rates – that is, when more restrictions and regulations on firearms are implemented, crime rates go through the roof. Such is the case in cities like Chicago and Baltimore, both of which are run by liberal Democrats and have high crimes rates as a result of strict gun laws.\n\nOn the contrary, when lawmakers create an environment that embraces the right of the people to keep and bear arms for self-defense, crime rates generally decline. As reported by Breitbart News earlier this year, data from the Crime Prevention Research Center (CPRC) indicated that concealed carry permits increased by an astonishing 215 percent between the years 2007 and 2015, while the murder rate has declined by 14 percent during that same period.\n\nIf it is true that mass shootings happen as a result of too many guns in the hands of the American people, how is it that crime rates go down while concealed carry rates go up? Could it be that allowing the people to defend themselves is a much more rational solution to gun violence than going door to door confiscating firearms?\n\nSources include:\n\nTruthRevolt.org\n\nBreitbart.com Liberal media admits: The ultimate goal is gun confiscation from all citizens… at gunpoint!", "https://www.naturalnews.com/2017-11-20-now-or-never-time-to-reclaim-our-food-independence.html": "(Natural News) While most of us are proud of our country’s pioneer roots and awed by the strength and resilience of the early homesteaders, few of us would choose to live the way they did. Providing for themselves and their families meant that the frontier men and women worked hard every day from sunup to sundown. What we may not realize though, is that those men and women were free in a way that most of us have never been.\n\nStanding in the checkout line at the supermarket after a hard day’s work we might feel blessed to have modern conveniences, but in truth we are nothing more than slaves to a system we have little to no control over.\n\nEven just a few decades ago, many families were proud of their ability to provide their own fresh fruit, veggies, meat, fish, preserves and nuts. While it took hard work and cooperation from the entire family, these people were truly free; they were independently able to meet all their own needs when it came to their food.\n\nModern society tends to look down on people who try to take care of themselves. We love the ability to run to the nearest store when we need bread or milk, and even those of us who try to make wise food choices are more likely to head for the nearest Whole Foods than to try to grow our own organic produce. (Related: The WHOLE TRUTH about Whole Foods.)\n\nConsciously or subconsciously, many of us view self-sufficiency as being beneath our dignity.\n\nAs noted by the American Farm Bureau Federation (AFBF):\n\nMost Americans believe they have outgrown farm work, which is reflected in their unwillingness to take farm jobs, even temporarily.\n\nThe Texas Pioneer Woman, writing for Grit notes:\n\nProviding for your family’s need was a source of pride and accomplishment. Today when I tell others that our family works together to grow and raise our food, I get strange looks and a lot of complaints of that is too hard of work and too time consuming. I am seen as an oddity.\n\nThe fact is, taking the time and making the effort to reclaim your family’s food independence will mean better quality, non-GMO, pesticide-free fruits and veggies for your family; it will mean you can enjoy hormone and antibiotic-free, grass-fed meat and chicken; and it will mean delicious, wholesome eggs from organic, free-range chickens.\n\nWorking together as a family in this way also provides wholesome association, enjoyable exercise, and increased absorption of vitamin D from exposure to more sunlight. It will provide an opportunity to teach little ones about how things grow, the value of hard work, and the importance of caring for animals in a kind and humane way. (Related: Discover the joy and freedom of fending for yourself at Homesteading.news.)\n\nAnd reclaiming your food freedom will also mean more money left over at the end of the month to spend on other things.\n\nThe following tips can help you loosen the ties that bind your family to reliance on commercially produced food:\n\nStart your own organic garden.\n\nStop purchasing manufactured, processed foods — avoid anything that comes in a box and has more than one ingredient.\n\nCook and prepare your own food at home.\n\nKeep chickens at home and start harvesting their delicious, fresh eggs.\n\nIf you’re feeling more adventurous (and if your council allows it), invest in a cow so that you can have fresh, raw milk.\n\nOf course, it isn’t necessary to start slaughtering your own meat and to never set foot in a store again. But, every small change you implement will make you freer, until eventually you are no longer enslaved to or reliant on others for your next meal.\n\nSources include:\n\nGrit.com\n\nDucksters.com\n\nNaturalNews.com Now or never: Time to reclaim our food independence", "http://www.naturalnews.com/2017-05-28-walmart-costco-kroger-grocery-chains-failing-grade-antibiotics-meat.html": "(Natural News) If you’re regular at Costco or Kroger, avoid buying the chicken next time. Alongside Albertson’s/Safeway, Publix, and Walmart, these massive grocers failed when it came to selling antibiotic-free chicken to the public. All five retailers fell short in a survey conducted by the Natural Resources Defense Council (NRDC), reported OrganicAuthority.com. Each one received a grade of “D” when it came to their lack of progress on the promotion of antibiotic practices, and their inability to provide antibiotic-free chicken offerings.\n\nFor their survey, the NRDC looked at the retailers’ branches in Charlotte, Chicago, Houston, Jacksonville, Los Angeles, and Philadelphia. The NRDC selected these cities to represent the country’s four census regions. These locations were then graded according to the following categories: policy (20 points), consumer education at point of purchase (five points), brand score antibiotic use (20 points), and brand score certification (10 points). The raw total of these categories was 55 points, and each grocer scored as such: Walmart received 20.9 points (38 percent), Albertson’s/Safeway received 21.5 points (39 percent), Publix received 21 points (38 percent), Kroger received 18.4 points (33 percent), and Costco received 22 points (40 percent).\n\nSans Costco, all other retailers scored poorly in policy, which was defined as “Commitment to phase out routine use of antibiotics described on major retailer website” and “Timeline to phase out routine use of antibiotics described on major retailer website.” This was especially notable, as large chicken producers like Tyson and Perdue have moved away from or pledged to move away from the use of antibiotics. Walmart was noted as the biggest offender in this regard. Not only does the company have the most number of suppliers with antibiotic-free chicken products, but Walmart has called for greater transparency from producers. Moreover, the NRDC discovered that the retailers’ own private-label chicken brands were sourced from producers with questionable antibiotic-free practices. (Related: Perdue announces that its chicken products are now 95 percent antibiotic-free)\n\nAs for helping consumers in making informed choices, only Publix had the necessary signage in all of their stores. All of their branches had displays that informed consumers of producers with responsible antibiotic policies. However, this did not include producers who were still in the process of phasing out antibiotics from their products. Though all the retailers offered United States Department of Agriculture (USDA)-certified chicken or Raised Without Antibiotics (RWA) chicken, there were no indications that these poultry products had been certified by third parties.\n\nWhole Foods may not have included in the survey, but the NRDC lauded it as the sole grocer to “have earned top score in all categories.” Their policy to sell antibiotic-free livestock products goes beyond chicken and covers beef, pork, and turkey. Whole Foods also made it easier for consumers to understand their purchases better, something that all the other retailers failed to do.\n\nThe NRDC concluded their survey by asking for retailers to commit themselves to the elimination of antibiotic-laden products from their chains, and for consumers to “vote with their wallets” by purchasing RWA and USDA-certified chicken.\n\nCarmen Cordova, a staff scientist under the Food and Agriculture Program of the NRDC, said this about the results of the survey: “The top five grocery store chains in the country feed millions of Americans, so their actions have a big impact on public health — for better or worse. Supermarkets can either continue to ignore the spread of drug-resistant infections, or they can answer their customers’ call to be a part of the solution.”\n\nRather than curing diseases among chickens, antibiotics are more often used to promote quicker growth in the animals and to prevent them from getting sick. According to OrganicAuthority.com, this practice allows antibiotic-resistant bacteria to thrive, which in turn is extremely harmful to humans and animals alike.\n\nVisit FoodSupply.news for similar stories.\n\nSources include:\n\nOrganicAuthority.com\n\nNRDC.org 1\n\nNRDC.org 2 Walmart, Costco, Kroger, Publix and Albertson’s all receive failing grades for selling meats loaded with antibiotics", "https://www.naturalnews.com/2017-11-09-hysterical-left-wingers-go-insane-over-president-trump-feeding-koi-fish-in-japan-because-democrat-journalists-are-stupid.html": "(Natural News) Most of us never thought we’d see the day where even the way in which a president feeds a school of koi fish would be subject to scrutiny from the progressive left, yet here we are.\n\nA number of left-wing journalists are now criticizing President Trump for the way in which he fed koi fish during his first state visit to Japan. Apparently, dumping the remains of a box of fish food into a pond is now something that we as Americans should be concerned about. Forget about the drug cartels flooding across our unsecured southern border or the national debt that continues to climb without end; no, we need to focus on President Trump’s fish feeding skills.\n\n“Trump and Japanese PM Shinzo Abe were scheduled to feed koi spoonfuls of food. Until Trump poured his entire box of fish food into the pond,” wrote CNBC reporter Christina Wilkie on Twitter. Oh, the horror.\n\nAnna Fifield, a columnist for the Washington Post, wrote, “Trump dump: president throws entire box of fish food into precious koi carp pond” and Zack Whittaker, a security editor at CBS, even called the non-controversy “Trump’s latest diplomatic incident.”\n\nPerhaps we need to launch yet another criminal investigation.\n\nRegardless of how you feel about the president’s political agenda, the idea that Donald Trump has been viciously attacked and scrutinized more than any other president before him should not be up for debate. The left-wing mainstream media has gone far beyond simply criticizing Trump for his policy proposals and the direction in which he is taking our country; they have made things personal, slandering our commander-in-chief for everything from his hair, to the way he forms sentences, to how he feeds koi fish while overseas in Japan.\n\nIf this is the game that the liberals want to play, then conservatives should be more than willing to play along.\n\nWho could forget the time when Barack Obama declared in the months leading up to the 2008 presidential election that he had “traveled to every corner of the United States,” and that he had visited “57 states” with “one left to go?”\n\nOr what about the time Obama turned into a stuttering mess when he was trying to promote the idea of nationalized health care at a town hall event in Virginia?\n\nOf course, it’s not just the former president who has a history of foolish statements and remarks. Failed Democratic presidential candidate Hillary Clinton doesn’t exactly have a way with words either, at one point on the campaign trail telling an audience at a town hall event that “Libya was a different kind of calculation, and we didn’t lose a single person.”\n\nRight, of course. Not a single person died… except for Ambassador Christ Stevens, State Department diplomat Sean Smith, and CIA contractors Tyrone Woods and Glen Doherty in Benghazi on September 11, 2012.\n\nLiberals say and do stupid things all the time, and yet if you were to do some digging on the Internet, chances are you wouldn’t find any negative comments from Washington Post columnist Anna Fifield, CNBC reporter Christina Wilkie or CBS editor Zack Whittaker. They probably remained silent when Obama announced he had been to 57 states, silent when Obama turned into a stuttering mess in Virginia, and silent when Hillary Clinton declared that we didn’t lose a single person in Libya.\n\nThe reason for this is because sadly, journalism no longer exists within the mainstream media. The vast majority of television networks and national newspapers have turned into giant propaganda machines that are out to do everything in their power to discredit and politically damage Donald Trump and the Republican Party. They will try anything to bring our president down, even if it means generating outrage over how he feeds a bunch of fish. (Related: How to avoid being brainwashed by the mainstream media.)\n\nSources include:\n\nDailyCaller.com\n\nFoxNews.com Hysterical left-wingers go insane over President Trump feeding koi fish in Japan… because Democrat journalists are stupid", "https://www.naturalnews.com/2017-12-05-4-out-of-5-cases-of-cancer-among-blacks-can-be-prevented-with-vitamin-d.html": "(Natural News) In a recent video lecture, the Health Ranger explained the many ways in which blacks are being targeted for genocide. The shocking YouTube video titled “The Science Agenda to Exterminate Blacks” describes a variety of “tactics that seek to eliminate blacks from our planet,” including the revelation that many cases of cancer could easily be prevented by addressing the rampant vitamin D deficiency seen in black communities.\n\nAs Mike Adams, also the director of CWC Labs, contends, “Every black person in Chicago, in Detroit, New York and the U.K. could prevent cancer — about four out five cancers, by the way — with nothing but vitamin D.” Adams notes that vitamin D deficiency is especially common in people with darker, more melanin-rich skin. You can watch the full lecture here.\n\nIn the past, it’s been reported that some 75 percent of black people living the United States suffer from vitamin D deficiency. And this deficiency comes with a host of other issues; namely, an increased risk of cancer. Further, vitamin D deficiency can also make cancer more aggressive — so not only are vitamin D deficient people more likely to have cancer, it’s more likely that their cancer will be harder to treat as well.\n\nProstate cancer is a perfect example of this. Mike Adams touches on this disparity in his video, noting that prostate cancer rates for black men in the U.K. are considerably higher than for other races — and their cancer is typically more aggressive. Harvard Prostate Knowledge, the brainchild of Harvard Medical School and Harvard Health Publications, also touches on research that shows vitamin D deficiency can play a role in the incidence and aggressiveness of prostate cancer.\n\n“New findings suggest that prostate tumors in particular can become highly aggressive when a man’s vitamin D levels are too low. A report in the journal Clinical Cancer Research showed that the lower the vitamin D level, the more aggressive the prostate cancer,” the organization explains.\n\nWriting for Live Science, author Christopher Wanjek also reported on a meta-analysis which showed that disparities in cancer rates between races can be attributed to vitamin D deficiency. Wanjek stated that “the researchers found that low vitamin D is independently associated with each of the cancer types for which an unexplained health disparity exists between African-Americans and white Americans.” Numerous cancers were linked to the vitamin D disparity: Bladder, breast, colon, endometrial, lung, ovarian, pancreatic, prostate, rectal, testicular, and vaginal cancer, as well as Hodgkin’s lymphoma and melanoma.\n\nOther studies have demonstrated a link between people of color and cancer incidence. For example, a study of over 1,000 men showed that black men are approximately 74 percent more likely to develop prostate cancer. Further, the researchers also found that the prostate cancer mortality rate was higher in black men also.\n\nIt is abundantly clear that many types of cancer can be attributed to vitamin D deficiency — it is also evident that vitamin D deficiency strongly affects minority communities and that there are very real health consequences associated with this deficiency. Yet, as Mike Adams contends, very little is being done to address the fact that vitamin D deficiency is hurting black people around the world. Indeed, these communities are being denied access to valuable health information — information that could keep cancer at bay.\n\nVitamin D is also known as the sunshine vitamin; and as Adams notes, sunshine is practically free. Even if you need a supplement, it surely costs less than conventional cancer treatments. [Related: Learn more about the sunshine vitamin at VitaminD.news.]\n\nSources for this article include:\n\nYouTube.com\n\nLiveScience.com\n\nHarvardProstateKnowledge.org 4 out of 5 cases of cancer among blacks can be prevented with vitamin D", "https://www.naturalnews.com/2017-11-18-president-trump-saves-the-elephants-big-game-hunting.html": "(Natural News) Believe it or not, the murder of elephants with hunting rifles is routinely called “conservation” by government regulators. (Note carefully that human depopulation is also being promoted as a way to “save the planet” these days.) After government bureaucrats at the US Fish and Wildlife department announced a recent decision to allow big game “trophies” to be imported into the United States, President Trump reversed the decision and reinstated the elephant trophy ban, reports the UK Daily Mail.\n\n“Put big game trophy decision on hold until such time as I review all conservation facts. Under study for years. Will update soon with Secretary Zinke. Thank you!” he tweeted.\n\nThis means that U.S. big game hunters will no longer be able to bring their “trophies” back to the United States, creating a strong disincentive for them to go hunt the elephants in the first place (big game hunters think it makes them “macho” to hang the heads of dead animals on their walls). Effectively, President Trump just saved many elephants of Zimbabwe.\n\nHunting elephants is one of the most insanely cruel and evil acts imaginable\n\nNow, for my take on all this:\n\nAs you probably know, I’m a long-range target shooter, trained to hit targets at 1,000+ yards with precision and accuracy. Yet I would never think of deploying such skills against an innocent, intelligent conscious being such as an elephant.\n\nElephants are intelligent, aware and majestic creatures. They have excellent memories, they experience emotions, and they grieve for the loss of their loved ones. In many ways, elephants display the “humanity” that now seems to be lacking in most humans. We should look to elephants for inspiration, not for target practice.\n\nTo this day, I still cannot understand how a human being can think of hunting elephants or other big game as a form of entertainment. The depth of cruelty and evil in such acts is almost too intense to accurately describe in mere words. The murder of an elephant is, in many ways, much like the murder of an innocent child. Yet all across America, the ultra-wealthy line up to murder elephants and other large game so that they might acquire bragging rights for having killed an innocent being.\n\nNote that only the ultra-wealthy can afford to hunt big game in Africa. This is not an activity that everyday firearms owners pursue. Hunting big game probably costs on the order of $100,000+ by the time you factor in the travel, hunting guides, local licenses and all the rest. Big game hunting, in essence, is the cruel “sport” of the heartless and wealthy… people with too much time and money on their hands and no sense of empathy for the animal kingdom.\n\nAs a firearms advocate, I often encounter people who enjoy hunting animals. It has never made any sense to me, and I often try to explain to these people, “Rifles are for defending liberty, not for killing innocent animals.” The Second Amendment, after all, was actually written to protect the rights of the people to shoot tyrants, not for hunting purposes.\n\nWild hogs, rattlesnakes and “nuisance” creatures\n\nIn Texas, where I’m based, there’s a lot of hunting of wild hogs, which are a genuine nuisance to farmers and ranchers across the South. These wild hogs tear up fields, effectively creating potholes that subsequently tear up tractors and other equipment. Because these wild hogs are such a nuisance, Texas and other states have declare “open season” on those hogs year-round. So farmers routinely shoot them, even when such efforts seem to do nothing to stem the tide of the hogs. (They reproduce rapidly and live off the wild onions in the dirt. These wild hogs are the ultimate survivalists…)\n\nAt one level, I can sort of understand other people shooting wild animals that become a strong nuisance to their own ranch operations, but I personally don’t hunt them on my ranch. I see them frequently, however. On certain days, I’ll encounter 40 – 50 of these wild hogs when walking my own animals, and just yesterday I spotted what surely must have been a 350 lb. male hog, journeying on his own. All wild hogs run from humans and seem to pose no actual risk to human beings (although they do have tusks, but I’ve never seen one attempt to attack me or any other human).\n\nTechnically, shooting one of these wild hogs is child’s play. It takes virtually no skill at all (and therefore proves nothing). So I wouldn’t even think of shooting one of these creatures as any sort of “challenge” in the first place. Anyone can easily approach these wild hogs to within 75 yards or closer, and if you can’t hit your target at 75 yards, you probably shouldn’t own a rifle in the first place.\n\n(By the way, I do shoot rattlesnakes when I encounter them on my property. I do not shed any tears over shooting rattlesnakes, as they pose a very serious hazard to my goats, donkeys and dogs. They are also extremely dangerous to humans and can cause you to lose an entire foot or leg due to medical amputation. Importantly, when shooting rattlesnakes, you must accurately hit their head on the first shot to completely nullify them as a threat. Even half a rattlesnake can still bite you as long as their head is still functioning. Fortunately, when coiled in their striking position, rattlesnakes make a very still target that’s easy to shoot: Their rattles are going off, but they are motionless and coiled. One shot to the head instantly stops the rattle and causes the snake to collapse dead. If you’re a terrible shot and can’t accomplish this with a solid bullet, try a revolver with a .410 gauge shotgun shell in it, such as The Judge. Or just use a 20 ga. shotgun.)\n\nCruel to kill wild hogs for sport, but justifiable in extreme survival situations\n\nAs a prepper and practical person, I should disclose that if a total collapse event were to take place that thrust us all toward starvation due to a collapsed food supply, I might harvest a few wild hogs for meat (for myself as well as my dogs), but shooting a wild animal is never something I would pursue as “sport” or “entertainment.” Wild hogs have consciousness, too. They are intelligent, aware and capable of feeling pain. To put any animal through the pain and suffering of being shot is an unacceptable activity except in the most dire survival circumstances, in my view.\n\nI say all this as an accomplished shooter. I recently tied for first place in a pistol competition shoot. My battle rifle skills are well polished, and my long-range rifle skills are better than probably 99 out of 100 rifle owners, since most rifle owners have no clue how to calculate long-range ballistics to put rounds on target at extreme distances. I’m saying all this because I want you to know that just because a person is proficient in firearms doesn’t mean they enjoy shooting innocent animals. Firearms proficiency and “hunting” are not synonymous. Many anti-gun people on the Left tend to dishonestly conflate these two concepts, falsely asserting that all firearms owners are simultaneously cruel to animals. That’s a blatant lie.\n\nMy mission is the protection of life and liberty. That’s why I advocate for natural medicine while also being a highly proficient firearms operator. In my view, firearms should be deployed to save lives, not to take innocent life. Even in a case where firearms must be deployed to defend liberty, such actions must always be pursued only as a last-ditch defense when all other options have been exhausted.\n\nFirearms are tools that should be used to SAVE lives, not take lives\n\nFirearms are tools that, in my view, should be used to save lives. That’s why you will never find a big game “trophy” in my house. Nor will I ever hunt animals for entertainment purposes, as such acts stand in total violation of my principles and ethics.\n\nHunting is not a necessary activity to acquire very high-end proficiency as a long-range shooter, by the way. Technically, the skill that most hunters lack is mathematics. You need good math skills to compensate for real-world conditions such as wind, inclination, moving speed of the target, the cosine of the wind angle, etc. That’s because all bullets follow the laws of physics, and the laws of physics are well described by mathematics. If you suck at math, you will also suck at long-range shooting. (There are a lot of hunters in America who are terrible at math and terrible at shooting. I would tell hunters that it is highly unethical for you to hunt animals when your firearms skills are so poor, as you’re more likely to wound the animal than actually kill it. If you’re going to hunt a living creature, at least have the decency to take its life as quickly and painlessly as possible.)\n\nMy hope is that I never have to take a life with a firearm. Should that unfortunate day come — due to collapse, self-defense or national defense — I will of course deploy all the tools in my possession in the defense of life and liberty, but I won’t celebrate it. I’ll probably shed tears of sadness.\n\nUntil then, I pray that we may all live in a world where innocent beings can be free to roam without being targeted for murder. And I pray that we can live in a world where the tyranny of the deranged, totalitarian Left is held at bay so that the Second Amendment need never be activated in national self-defense. I pray that my firearms need only shoot paper and steel targets, never flesh and bone. And I pray that the Left never attempt a nationwide confiscation of citizens’ firearms, for such a proclamation would likely unleash a torrent of bloodshed across our nation, probably ending in civil war or armed revolt.\n\n– Mike Adams President Trump saves the elephants of Zimbabwe: Big game hunting trophy ban to remain in place", "https://newstarget.com/2017-11-14-putin-is-concerned-there-will-soon-be-genetically-modified-superhuman-solders-calling-on-world-leaders-to-agree-to-limitations-and-regulations.html": "Putin is concerned there will soon be genetically modified superhuman soldiers; calling on world leaders to agree to limitations and regulations\n\nThere is no shortage of legitimate and very serious criticisms one could lodge against Russian President Vladimir Putin, but his concerns about matters like GMOs, artificial intelligence and genetic engineering are surprisingly on point.\n\nSpeaking at a youth festival in Sochi recently, he mentioned the very real possibility of an army of trained killers being created by altering human genetic code. He’s so concerned about it that he said that world leaders need to agree on tight regulations to avoid creating killer soldiers who are incapable of feeling fear or pain.\n\nHe added that getting into genetic code that has been created by either nature or God could lead to all manner of consequences. Speaking of what type of men this technology could create, he said:\n\n“He can be a genius mathematician, a brilliant musician or a soldier, a man who can fight without fear, compassion, regret or pain. As you understand, humanity can enter, and most likely it will in the near future, a very difficult and very responsible period of its existence.\n\n“What I have just described might be worse than a nuclear bomb.”\n\nScientists already working on genetically altering soldiers’ genetic codes\n\nHe may be on to something: The Pentagon’s top-secret Defense Advanced Research Projects Agency (DARPA) has been said to be working on a way to enhance the ability of humans in war zones through the alteration of soldiers’ genetic codes.\n\nSoldiers who are not susceptible to fatigue and empathy and who are highly focused, intelligent and strong, would have a distinct advantage over their enemies, there’s no doubt, but they’d also pose an incredible danger to society at large. It is even believed that the super soldiers developed by DARPA could grow new limbs to replace those lost in combat, making them the very definition of formidable foes.\n\nWill combining genetically engineered soldiers with AI spell the end of humanity?\n\nPutin also recently spoke out about AI robots and their potential to wreak havoc on humanity. When Yandex CEO Arkady Volozh was discussing AI’s potential while Putin toured the Moscow headquarters of the internet firm, Putin threw the CEO off by asking him when the technology would “eat us.”\n\nHe has also stated that whoever ends up becoming a leader in artificial intelligence will “become the ruler of the world.”\n\nThe realm of AI could be another source of high-powered soldiers that won’t be slowed down by human emotions and feelings. In fact, experts have predicted that the American military is going to have more robotic soldiers in its ranks than actual humans by the year 2025. By mid-2019, a new robotic fleet will be tested that contains self-driving, unmanned army trucks and underwater drones.\n\nWhile sending in a robot to check for mines is undoubtedly a good way to potentially save the lives of our soldiers, the prospect of a fully automated robot that can find humans and shoot them from a few miles away is a very frightening one.\n\nLike Putin, the CEO of Tesla and SpaceX, meanwhile, counts himself among the voices who are very concerned about the possibilities here, with Elon Musk saying that he considers AI to be a “fundamental existential risk for human civilization.”\n\nAI firm DeepMind’s Shane Legg recently said that he, too, believes technology will likely play a role in human extinction.\n\nWhether it’s through genetic modification, artificial intelligence or a combination of the two, it’s quite possible that warfare is about to change dramatically, and it’s not certain that any of us will be left standing.\n\nSources include:\n\nDailyMail.co.uk\n\nNaturalNews.com\n\nNaturalNews.com Putin is concerned there will soon be genetically modified superhuman soldiers; calling on world leaders to agree to limitations and regulations", "https://www.naturalnews.com/2017-11-19-risks-geoengineering-artificial-intervention-global-warming.html": "(Natural News) Geoengineering, also known as climate engineering, is exactly what it sounds like. This engineering involves using technology to manipulate the climate system and counter the effects of global warming. Though sound in theory, researchers from the University of Exeter have discovered that the application of geoengineering in one hemisphere could lead to massive damage in another.\n\nFor their study, the team focused on stratospheric aerosol injection, wherein aerosols are artificially introduced into the atmosphere. The presence of aerosols reflects back sunlight before it can reach the Earth’s surface, essentially cooling the planet; a technique not unlike the aftermath of volcanic eruptions.\n\nAccording to ScienceDaily.com, the team utilized simulations with a “fully coupled atmosphere-ocean model” to study the effects of stratospheric aerosol injection on storms in the North Atlantic. They found that by doing so, they could decrease tropical cyclone activity — which has been linked to destructive storms such as Hurricane Katrina. Unfortunately, this approach could simultaneously increase the chances of drought in the Sahel, an area between the Sahara to the north and the Sudanian Savanna to the south.\n\nBy contrast, the researchers found that injecting aerosols into the atmosphere above the southern half of the planet greatly reduced drought in some parts of Africa, the Sahel included. However, the frequency of tropical storms in the Atlantic grew as a result.\n\n“Our results confirm that regional solar geoengineering is a highly risky strategy which could simultaneously benefit one region to the detriment of another,” said Dr. Anthony Jones, lead author of the study and climate expert at the University of Exeter. “It is vital that policymakers take solar geoengineering seriously and act swiftly to install effective regulation.” (Related: Geoengineering to reduce climate change could adversely affect rainfall, scientists report.)\n\nForget “effective regulation”, this study is even more proof that climate hacking is anything but a bright idea. There’s simply no good to be had from messing with Mother Nature. Even if you could determine the best points for shooting aerosols into the atmosphere (as a series of separate yet similar studies have demonstrated), gauge the ideal amount of sulfur dioxide, and balance out cooling differences between the poles and the equator, there will be consequences. Extreme meteorological events like heat waves and hurricanes, and changes to power generation and water scarcity, are just some of them.\n\nPlus, as Pacific Northwest National Laboratory climate scientist Ben Kravitz pointed out, keeping the planet cool would require multiple megatons of aerosols annually. Is bending the weather to your whims worth all that? Not in the least.\n\nVisit ClimateScienceNews.com to get your fix of all things related to the weather and our climate.\n\nSources include:\n\nScienceDaily.com\n\nNature.com\n\nPopSci.com New research exposes the risks of geoengineering to artificially intervene in global warming: It may devastate the planet", "https://www.naturalnews.com/2017-12-05-the-mouth-is-a-first-responder-for-the-immune-system-new-study-provides-clues-for-how-the-body-defends-against-oral-invaders.html": "(Natural News) New research has identified how the mouth acts as a trigger for the immune system’s defenses to kick in once the fungus Candida albicans – which causes oral thrush – has invaded the body.\n\nThe international team, led by the researchers at the University of Pittsburgh School of Medicine, studied how microbes inside the mouth called commensals, which are usually harmless to healthy individuals, can cause severe and painful oral infections when the immune system is compromised. One of these so-called commensals is the fungus Candida albicans, which causes oral candidiasis, more commonly known as oral thrush.\n\nCandida becomes an infectious microbe when the immune system is weak, which makes infants highly prone to developing oral thrush, as well as people with HIV/AIDS and those on immunosuppressants such as chemotherapy.\n\nThe study aims to know how fungal immunity in the mouth operates, as seen in people with healthy immune systems, who still harbor the Candida fungus in their mouths but without its invasive form.\n\nThe researchers used mouse models infected orally with Candida and human oral epithelial cells (OECs) cultured in vitro, to study how Candidalysin (a toxin secreted by Candida) is fended off by the OECs and another immune cell called helper T cells, as the fungal toxin attacks the mucous membrane lining in the inside of the mouth.\n\n“To use a Game of Thrones analogy: The oral epithelial cells form a protective ‘wall’ that keeps the marauding Candida invaders at bay. Patrolling the wall are the helper T cells, which use IL-17 as their weapon to protect the kingdom,” said the paper’s first author, postdoctoral fellow Akash Verma, Ph.D.\n\nThe research is further detailed in ScienceDaily.com.\n\nFacts about oral thrush\n\nOral thrush is a yeast infection on the inside of the mouth and on the tongue, caused by the fungus Candida albicans, which harmlessly thrives in your mouth unnoticed, until it grows uncontrollably and becomes invasive, triggering an immune response. Infection from this fungus is characterized by white lesions or bumps on the inner cheeks and tongue.\n\nInfants and toddlers, whose immune systems have not fully developed, are highly susceptible to oral thrush. It causes difficulty feeding, fussiness, and irritability. However, this infection is treatable and rarely escalates into a more complicated infection.\n\nThere are no noticeable signs at the onset of this infection, but over time the fungus continues to grow and the symptoms begin to appear, which include:\n\nCreamy white lesions or bumps on the tongue, inner cheeks, gums, tonsils, or sometimes on the roof of the mouth.\n\nSlight bleeding when the bumps are scraped.\n\nDry, cracked skin at the corners of the mouth.\n\nDifficulty swallowing due to soreness and pain.\n\nLoss of taste.\n\nPeople whose immune systems are significantly weakened, such as HIV/AIDS patients and cancer patients, are also highly prone to the infection. In severe cases, the lesions may spread all the way to the esophagus. This causes pain and difficulty in swallowing.\n\nOral thrush treatment depends on the age and overall health of the infected individual. HealthLine.com gives a list of do-it-yourself remedies, including:\n\nBrushing your teeth with a soft toothbrush; be careful not to touch the bumps.\n\nReplacing your toothbrush every day until the infection subsides.\n\nRefraining from using mouthwashes or breathsprays.\n\nRinsing your mouth with a salt-water mixture.\n\nMaintaining appropriate blood sugar levels if you have diabetes.\n\nEating unsweetened yogurt to help restore and maintain healthy levels of good bacteria.\n\nRead more about natural remedies for different infections at Remedies.news.\n\nSources include:\n\nScienceDaily.com\n\nHealthLine.com The mouth is a first responder for the immune system: New study provides clues for how the body defends against oral invaders", "https://www.naturalnewsblogs.com/leaky-gut-blood-brain-barrier-bbb/": "What Leaky Gut Is\n\nThe terms “leaky gut” and increased intestinal permeability refer to the same thing, and the idea is this: the junctions in your small intestine ought to be tight enough that nothing can get in or out unassisted. In a leaky gut, the junctions are loose enough that food particles can come in contact with the bloodstream prematurely (before they’ve been broken down into something your bloodstream would recognize and be able to use). Your blood therefore thinks the food particles are foreign invaders, and it creates antibodies against them. Symptoms in most cases mimic those of Irritable Bowel Syndrome, and include food sensitivities, gas and bloating, alternating constipation and diarrhea. Almost universally, a disrupted intestinal barrier will also have an abnormal microbiome.\n\nBut research now shows that symptoms of Leaky Gut Syndrome might look entirely different from the classic IBS presentation. In fact, Leaky Gut may be one of the underlying causes in illnesses involving disruption in the Blood Brain Barrier (BBB). These conditions can present with neurological symptoms, cognitive distortion, mood disruption, and even myelination disorders.\n\nWhat the Blood Brain Barrier (BBB) Is\n\nLike the tight junctions in the small intestine, the Blood Brain Barrier protects the brain from toxins and pathogens that might be circulating in the bloodstream, but grants entry to things like nutrients, oxygen, and glucose.\n\nThe gut certainly influences the Blood Brain Barrier by means of GI-derived hormonal secretion, allowing amino acids and some drugs to cross the BBB, and also influencing the secretion in the Central Nervous System (CNS) of cytokines, the inflammatory arm of the immune system. But a number of studies also show that the microbiome can directly affect the BBB. In fact, this study directly shows that an unhealthy microbiome can lead to increased BBB permeability, while a correcting the microbiome causes the BBB to “tighten up.”\n\nThe BBB and Demyelination Illnesses (Multiple Sclerosis, Autism)\n\nSince the gut can alter production of inflammatory cytokines within the CNS, it’s not surprising that there may be a connection between autoimmunity in the CNS and the gut microbiome. Myelination (the fatty covering on nerve cells) is also influenced by gut microbes, and investigations are currently underway regarding possible connections between the microbiome and Multiple Sclerosis.\n\nAutism has also been characterized by myelination changes in the Prefrontal Cortex (the part of the brain associated with executive functioning), and this study shows that autism is 1) characterized by a disrupted BBB, and 2) usually also characterized by increased intestinal permeability. Microbiota therapy may therefore soon be an official recommendation for autism.\n\nThe Upshot\n\nIf you or someone you love suffers from a neurological disorder, even if there are no apparent gut symptoms, testing for intestinal permeability and balancing microbiome may be therapeutically helpful.\n\nTo find out what is causing your gut health issues, take the Gut Health Quiz. It’s free!\n\nResources: Leaky Gut and the Blood Brain Barrier (BBB)", "https://newstarget.com/2017-11-12-china-has-developed-a-magnetic-propulsion-drive-for-use-on-nuclear-submarines-making-them-almost-silent.html": "China has developed a magnetic propulsion drive for use on nuclear submarines, making them almost silent\n\nThe China Shipbuilding Industry Corporation (CSIC) has recently unveiled and tested a new magnetic propulsion motor that may put China at par with the U.S. and other Western naval forces. According to reports, the new technology is the country’s first permanent system of its kind and may enable nuclear submarines to move about with better speed and increased stealth.\n\nReports have indicated that the new magnetic propulsion system has been tested on naval vessels docked at Sanya, in South China’s Hainan Province. As per the reports, this area serves as the headquarters for the country’s conventional and nuclear submarines. The state media has noted that the tests were carried out on October 18, and have shown positive results as far as vessel speed is concerned.\n\nReports have also revealed that the new technology’s magnetic drive utilizes a superconducting magnet to force water through the submarine’s shaft, which is then subsequently funneled out at the back. The magnetic drive requires less moving parts, which makes the vessels more quiet than conventional submarines, experts say.\n\n“Submarine and anti-submarine technology and capabilities have long been considered a weak link in Chinese naval power. It appears that they are making concerted efforts to address this shortfall,” states Eric Wertheim, author of Combat Fleets of the World.\n\nChinese submersible arsenal ships are also on the works\n\nReports have also revealed that the Chinese Navy is currently developing submersible arsenal ships with the ability to fire missiles at the surface, or submerge below the waves to carry out an underwater attack. (Related: Thermonuclear missile launch near Los Angeles is final sign of World War III on the precipice… US, China and Russia all escalating covert attacks in run up to global war.)\n\nData obtained from Chinese media show that naval experts are mulling over two types of partially-submerged warships that can displace about 20,000 tons. Experts note that the ships’ design could mask their radar signatures as they submerge, which in turn would enable the large, missile-carrying warships to carry out stealthier operations. The design is also set to allow the ships to perform high-speed mission at the surface, the experts added.\n\nReports claim the country has been allegedly testing potential models since 2011, and that a proof-of-concept model developed by the Bohai Shipbuilding Heavy Industrial Corporation will be available in the year 2020.\n\nSources include:\n\nDailyMail.co.uk\n\nMotherboard.vice.com China has developed a magnetic propulsion drive for use on nuclear submarines, making them almost silent", "https://www.naturalnews.com/2017-11-18-remember-when-democrats-applauded-bill-clinton-sexual-misconduct-multiple-women.html": "(Natural News) Given the sexual harassment allegations engulfing Judge Roy Moore, the GOP candidate for U.S. Senate in Alabama, it is interesting to recall the reaction of most liberals to Bill Clinton’s misconduct in and out of the White House. For many Democrats, the tawdry behavior was irrelevant and just about sex.\n\nWhile the 42nd president’s escapades were minimized, Juanita Broaddrick is on record accusing Clinton of raping her in a Little Rock hotel room when he was a candidate for governor of Arkansas, a story that the mainstream media buried. As president, Clinton pandered to the far-left feminist constituency and positioned himself, as his wife did, as a champion of women’s rights, which may be why he received a pass.\n\nDuring the 1992 presidential campaign, most media outlets ignored allegations by Gennifer Flowers that she had a 12-year relationship with candidate Clinton. After a protracted legal struggle, Clinton entered into an out-of-court settlement with Paula Jones in her sexual harassment lawsuit, and his law license was suspended for five years. Kathleen Willey accused Clinton of groping her in the Oval Office. Democrats and their media allies mostly ridiculed Jones and ignored Willey. Dolly Kyle recently published a book about her long affair with Clinton. Over the years, the names of other women involved with “Slick Willie” have also surfaced.\n\n“Of course, many liberals and Democrats stood by Mr. Clinton despite the allegations because they agreed with his policy stances and did not want to reward those on the other side,” the New York Times observed.\n\nThe Daily Wire recalls that Clinton enjoyed the support of his coalition even after impeachment proceedings were launched attendant to his false statements made under oath about his affair with White House intern Monica Lewinsky.\n\nDespite this, Democrats applauded Clinton after his impeachment and portrayed him as the victim of “politics of personal destruction.”…\n\nWhat is even more disturbing about the hypocrisy of the media and the Democrats is that they claim to support women and encourage victims to come forward, even as Bill’s accusers say Hillary tried to silence them.\n\nSome 20-plus years later, Democrats may or may not be changing their tune, particularly against the backdrop of ultra-liberal U.S. Senator Al Franken being accused of groping a woman, plus the disturbing track record of movie mogul Harvey Weinstein and other Hollywood liberals whose misbehavior has now come to light. (Related: Read more about Clinton wrongdoing and the hypocrisy of Democrats and the fakestream news media at Clinton.news.)\n\nI was 35 years old when Bill Clinton, Ark. Attorney General raped me and Hillary tried to silence me. I am now 73….it never goes away. — Juanita Broaddrick (@atensnut) January 6, 2016\n\nGiven recent events, liberal writers at the Times, Vox, The Atlantic, and elsewhere have recently changed their tune about Bill Clinton, the Washington Free Beacon reported, although it’s a reasonable to wonder if they would have come forward had Hillary Clinton been elected president in 2016.\n\n“Bill Clinton should have resigned,” Vox reporter Matt Yglesias wrote…arguing that Clinton’s affair in the 1990s with then-White House intern Monica Lewinsky should have resulted in his resignation because it was an abuse of power.\n\nLooking back, The Atlantic writer Caitlin Flanagan wrote this about the Clinton scandals.\n\nThe Democratic Party needs to make its own reckoning of the way it protected Bill Clinton… The party was on the wrong side of history, and there are consequences for that.\n\nClinton himself has not weighed in, according to the New York Times.\n\nMr. Clinton has kept publicly quiet amid the flurry of sexual misconduct stories lately, and his office had no comment on Wednesday. But other Democrats were not as willing to come to his defense this week. Of a dozen prominent political activists contacted on Wednesday, none went on the record on Mr. Clinton’s behalf.\n\nMany Democrats, and those in the mainstream media, had no hesitation, however, in publicly denouncing President Trump when the Access Hollywood “locker-room talk” tape surfaced about a month before the election.\n\nSources include:\n\nDailyWire.com\n\nNYTimes.com\n\nWashingtonFreeBeacon.com\n\nVox.com\n\nTheAtlantic.com\n\nInquisitr.com Remember when Democrats applauded Bill Clinton despite his sexual misconduct against multiple women in the 1990s?", "https://www.naturalnews.com/2017-11-09-too-fat-to-fly-airlines-to-begin-weighing-passengers-and-charging-accordingly.html": "(Natural News) The global obesity epidemic, which is especially critical in Western societies, is causing ripple effects in industries outside of traditional medicine as they struggle — literally — to accommodate people who are straining the system, so to speak.\n\nOne of the affected industries is transportation and, in particular, air transport. One Finnish airline is preparing to implement a new policy: All passengers will be weighed prior to boarding flights so that they can more accurately gauge fuel use.\n\nOfficials with the airline, Finnair, told CNBC that it has already asked about 180 passengers to step on a scale before stepping onto flights out of Helsinki International Airport last week. In all, the airline needs to weigh about 2,000 passengers in order to get an accurate reading of passenger weights and their carry-on baggage.\n\nThe just-launched study will be continued into next year, officials said, because they allegedly want to see how overall flight weights differ from when passengers are carrying heavy winter coats versus when they are traveling lighter in weather that is warmer. Airline officials said they would protect passenger privacy and keep the data private.\n\nCNBC reported further:\n\nThe aim of the weigh-ins, which might be more familiar to travelers who have flown on small planes, is to update nearly decade-old data on average passenger weights as it expands its route network and needs to accurately forecast payloads and how much fuel it requires.\n\n“We have a strong safety culture at Finnair, and are also a very data-driven organization, so we want to ensure we have the best possible data in use in aircraft performance and loading calculations,” Finnair officials said in a statement.\n\nOfficials noted that the airline is currently utilizing European Aviation Safety Agency information dating back to 2009. The information contains standard weights including carry-on luggage for male passengers at 88 kilograms (194 pounds), 70 kilograms (154 pounds) for female passengers, and 35 kilograms (77 pounds) for the average child.\n\n“Now we feel it is time to update the data, as our traffic has developed and grown a lot,” Finnair officials said. “We have a very international customer base, as many of our customers transfer with us between Europe and Asia, and then we have our domestic traffic as well.”\n\nWhile Finnair officials likely would never admit it publicly, they have to be concerned with the “growing” population — that is, not its expanding passenger base but how much those passengers are expanding, thanks largely to poor diets.\n\nAccording to the Centers for Disease Control and Prevention, more than one-third of U.S. adults (36.5 percent) are obese, but that figure is even higher among the traveling public — 40.2 percent among adults 40-59 years old. (Related: Obesity epidemic continues to ravage American youth: Nearly three-quarters aren’t eligible for military service.)\n\nIn Europe, rates are even higher: As of 2014, 51.6 percent of the European Union’s adult population (18 years and older) were considered obese.\n\nThe argument the airlines seem to be making is that heavier people cost more to fly, and it’s an argument that others have made as well. In fact, columnist Tony Webber, writing for The Sydney Morning Herald, argued that heavier passengers should have to pay more for their tickets.\n\n“To cut to the chase: People who weigh more should pay more to fly on planes – in the same way that people who exceed their baggage allowance must fork out extra,” he wrote.\n\nWhy? “The fuel burnt by planes depends on many things but the most important is the weight of the aircraft,” he argued. “The more a plane weighs, the more fuel it must burn. If the passengers on the aircraft weigh more, the aircraft consumes more fuel and the airline’s costs go up.”\n\nWhile it’s not clear that airlines are prepared to charge heavier customers more, it is clear that heavier passengers most definitely do affect flight costs (and therefore will affect the prices of tickets, meaning they’ll go up).\n\nJ. D. Heyes is editor-in-chief of The National Sentinel.\n\nSources include:\n\nSMH.com.au\n\nCNBC.com\n\nNaturalNews.com Too fat to FLY? Airlines to begin weighing passengers (and charging accordingly)", "https://newstarget.com/2017-11-09-how-hospitals-keep-patients-sick-feeding-ensure-nutrition-shake.html": "How hospitals keep their patients sick by feeding them Ensure, a “junk food” nutrition shake\n\nOnce upon a time, long long ago, doctors used to take some time to educate their patients on how to maintain a healthy body and mind through nutrition and stress reduction. Unfortunately, a horrible and evil monster invaded the land (let’s call it Fraudzilla) and decided that this idea of nutrition was nonsense and the people’s ills were better managed through synthetic and toxic medications created in a lab. Since the lure of money was so promising, doctors took the bait and abandoned all common sense and logic with regards to helping patients overcome chronic health problems.\n\nIt was the beginning of the end for quality health care, as this method of medicine became ingrained in nearly all areas of the world. Doctors became busy pill pushers, and any semblance of nutrition advice went out the door, along with the patient’s chances of a solid recovery.\n\nThen came the final death blow. In their infinite wisdom, hospital staff started endorsing their “flagship recovery product” to any patient who needed some serious help, so they could get a leg up on their recovery. However, this recovery product was of no help at all, and for many, it created their final curtain call.\n\nFor anyone with any common sense, it’s about to become crystal clear why hopes of recovery from illness are virtually destroyed when this “nutrition shake” is taken as any part of the antidote.\n\nThe “nutrition shake” that wasn’t\n\nBefore the ingredients are unveiled for this very popular nutrition shake, keep in mind that these formulas could make a healthy person sick, so try to fathom what this would do to someone who is already very sick. It’s not pretty.\n\nSo lo and behold, the “nutrition shake” commonly recommended to sick and desperate patients.\n\nEnsure Original Nutrition Shake\n\nIngredients: Water, Corn Maltodextrin, Sugar, Milk Protein Concentrate, Blend of Vegetable Oils (Canola, Corn), Soy Protein Isolate, Nonfat Milk. Less than 0.5% of: Magnesium Phosphate, Potassium Citrate, Natural & Artificial Flavor, Cellulose Gel, Salt, Calcium Carbonate, Calcium Phosphate, Choline Chloride, Ascorbic Acid, Sodium Citrate, Cellulose Gum, Potassium Chloride, Monoglycerides, Soy Lecithin, Carrageenan, Potassium Hydroxide, Liquid Sucralose, Ferrous Sulfate, Zinc Sulfate, Acesulfame Potassium, dl-Alpha-Tocopheryl Acetate, Niacinamide, Manganese Sulfate, Calcium Pantothenate, Copper Sulfate, Thiamine Chloride Hydrochloride, Pyridoxine Hydrochloride, Vitamin A Palmitate, Riboflavin, Chromium Chloride, Folic Acid, Biotin, Sodium Molybdate, Potassium Iodide, Sodium Selenate, Phylloquinone, Vitamin D3, and Vitamin B12.\n\nAnalysis: The first ingredient, water, would seem to be fine on the face of it, until you realize that the probability of this water being properly filtered is very low, which means you are drinking dirty water, most likely the equivalent to tap water. You can find out here why that’s a big problem.\n\nThe second ingredient is corn maltodextrin, a high glycemic GMO ingredient, with little to no nutritional value. [For more on GMOs, visit Biotech.news.]\n\nThe third ingredient, sugar, speaks for itself. The number one thing someone who is very sick should avoid indiscriminately is sugar, in any form (especially white).\n\nThe fourth ingredient is milk protein concentrate, which may seem helpful for some, but when you consider the allergic effects and mucous that milk creates in the body, it immediately becomes a health hazard. This is before you even discuss the fact that this milk is not organic, so could be filled with hormones, steroids, and puss, along with GMO residue from cows being predominantly fed corn.\n\nAs we get further into the ingredients we see more GMOs (canola, corn and soy protein isolate/soy lecithin), artificial flavors, toxic thickeners (carrageenan), artificial sweeteners (sucralose), and a myriad of isolated and synthetic vitamins and minerals that are poorly absorbed. This is the classic format for multivitamin formulas, but this article explains why these formulas are expensive toilet flushers, at best.\n\nYes folks, this is supposed to HELP with recovery from illness. Do you see the problem here?\n\nBut wait, perhaps you haven’t been recommended Ensure, but the Boost shake instead. Well, a quick look at their primary ingredients shows water, corn syrup, sugar, milk protein concentrate, and vegetables oils of canola, corn, and sunflower. Perhaps in an effort to save face, they have half way down the ingredient list “stevia leaf extract,” but this is a far cry from turning this formula into anything that facilitates recovery.\n\nAnd you thought these were nutrition shakes and your doctor knew best.\n\nThe good news is, there are a few bonafide nutritional formulas out there that actually remove all the harmful ingredients and put together a bounty of highly nutritious whole foods in a condensed (not isolated vitamins and minerals) format that is easily absorbed by the body. This is EXACTLY what anyone recovering from illness needs, and the same goes for anyone who wants to avoid the hospital in the first place. An ounce of prevention is certainly worth a pound of cure.\n\nSo if you or someone you love is dealing with sickness and need a simple recovery drink, please avoid these commonly hospital recommended nutritional shakes. Instead, focus on nutrient dense, highly digestible, superfood powders that can be easily mixed into juice, water, or even a smoothie. If you need a high quality source, get the Health Ranger’s Fermented Super30 which will provide the nutrients required for a healthy recovery (and a healthy life, for that matter).\n\nRemember, nutrition is paramount to your health and overcoming any challenges you may face. Make it a daily habit to flood your body with optimal nutrition, and should you come down with an illness, be wary of nutritional shakes offered by hospital staff, and choose whole food nutrition instead.\n\nSources for this article include:\n\nNaturalnews.com\n\nEnsure.com\n\nBoost.com How hospitals keep their patients sick by feeding them Ensure, a “junk food” nutrition shake", "https://www.naturalnews.com/2017-10-23-new-study-backs-up-reports-of-near-death-experiences-claiming-that-consciousness-continues-to-work-after-the-heart-has-stopped.html": "(Natural News) Imagine lying on a hospital bed, closing your eyes, and then being able to hear the doctors announce your own time of death. If this sounds strangely familiar to you, perhaps you’re thinking of the recently released remake of the 90s horror film Flatliners, which is about a group of young doctors who intentionally poison their hearts to find out what life is like after death. But in an eerie twist, it turns out that the movie may not be entirely fictional after all.\n\nScientists have discovered that even after a person’s body stops showing signs of life, their consciousness continues to work, meaning that in theory, hospital patients are able to hear the doctors announce their time of death.\n\nA team of researchers from New York University Langone School of Medicine recently observed people who suffered cardiac arrest and then came back to life in order to find out more about what happens after we die. The studies author, Dr. Sam Parnia, explained the team’s findings to Live Science: “They’ll describe watching doctors and nurses working and they’ll describe having awareness of full conversations, of visual things that were going on, that would otherwise not be known to them.” Dr. Parnia added that the recollections were all verified by medical and nursing staff.\n\nDoctors have traditionally defined death based on when the heart officially stops beating and blood stops flowing to the brain. “Technically, that’s how you get the time of death – it’s all based on the moment when the heart stops,” Dr. Parnia explained. “Once that happens, blood no longer circulates to the brain, which means brain function halts almost instantaneously. You lose all your brain steam reflexes – your gag reflex, your pupil reflex, all that is gone.”\n\nThe idea that you remain conscious in the moments after death really is like something out of a horror movie, and it becomes even more terrifying when you put yourself in that situation. Imagine what it would be like to hear doctors talking about your death, but not being able to move or respond in any way; no longer living, but thinking as if you were. For these reasons, the revelation that consciousness continues after death is both unsettling and also a significant discovery for the scientific community that will no doubt have a large impact on future research. (Related: Consciousness survives after the body’s organs stop functioning.)\n\nEarlier this week, the Daily Express published an article on this very topic, and included several stories of individuals who have passed away, come back to life, and then decided to share their experiences with others. One such person, who remained nameless, experienced one of these out of body experiences after a suicide attempt. “I remember feeling terrified,” the person explained. “It was so dark and I could not see anything below me, so it was hard to figure out what was going on.” (Related: A study of 2000 patients reveals that life after death is real.)\n\nWhile this particular individual had a rather negative life-after-death experience, not all of the accounts that the Daily Express mentioned were bad. Indeed, one person, who goes by the name of Richard, explained that he didn’t feel any pain whatsoever after collapsing from a seizure. Rather, he told about how he felt a sense of peace as he made his way closer and closer to a bright light. Yet another person named Alexander also said that he had a relatively positive experience, feeling a sense of warmth and happiness as he moved closer to what he described as a “bright light almost like at the end of a tunnel.”\n\nThis new study, along with all of these accounts of people who have experienced life after death, will no doubt change the way research on the issue is conducted in the future, and it could even change the way in which we define death itself.\n\nSources include:\n\nDailymail.co.uk\n\nExpress.co.uk New study backs up reports of near-death experiences, claiming that consciousness continues to work after the heart has stopped", "https://www.naturalnews.com/2017-12-04-joy-behar-of-the-view-is-an-enabler-of-fake-news-after-defending-network-colleagues-bogus-russia-collusion-hoax-about-michael-flynn.html": "(Natural News) One of the co-hosts of ABC’s“The View,” Joy Behar, is the embodiment of a fake news enabler, making her one of the many establishment media types who are responsible for betraying Americans.\n\nYou may recall that on Friday, network colleague Brian Ross of ABC News reported that former Trump national security advisor Michael Flynn was instructed by candidate Donald J. Trump to meet with Russian officials. The Ross report fit nicely into the “Trump-Russia collusion” narrative manufactured by the Left following Hillary Clinton’s unexpected and embarrassing loss in the November 2016 election.\n\nOnly, the Ross report was bogus. He was later forced to correct it during the network’s Friday edition of “World News Tonight,” saying his “anonymous” source had changed the story to reflect that in actuality, Trump instructed Flynn to contact Russian officials regarding the formulation of a joint strategy to combat ISIS after he became president-elect, which is not only perfectly legal and normal but even expected of incoming administrations.\n\nPoof! Like all the fake news before it suggesting a “collusion” link between Team Trump and Mother Russia to “steal the election” from Hillary, Ross’ story, too, disintegrated. And he was suspended for a month, though he ought to be fired: Ross also intimated after the Aurora, Colo., theater shootings that the mass murderer had a link to the conservative Tea Party, which was also false.\n\nAnyway, on her program Monday, Behar — who, along with her co-hosts repeated Ross’ phony report to hoots and hollers of joy from the mind-numbed minions in the studio audience on Friday — discussed her “celebration” last week, claiming she was “guilty of premature evaluation.”\n\nHar, har, Joy…who wrote that for you?\n\nBehar said Monday, “So, on Friday’s show, apparently I was guilty of premature evaluation. I hear they have a pill for that now. Here’s what happened. ABC News reporter Brian Ross released a story claiming when Trump was a candidate he told Michael Flynn to contact the Russians. Ross later corrected himself saying t was when Trump was president-elect. Ross has been suspended for a month. Sunny you have a statement.”\n\nSunny Hostin, a legal correspondent and analysts for ABC, read the network’s statement:\n\nWe deeply regret and apologize for a serious error. The reporting made by Brian Ross had not been completely vetted by our process. As a result of our reporting over the next several hours, we realized it was wrong. We corrected it on air and online. It is vital we get the story right. And retain the trust we have with our audience. These are our core principles. We fell far short of that yesterday. Effective immediately Brian Ross is suspended for four weeks without pay.\n\n“Okay. That’s ABC’s statement. Brian Ross released a statement also on Sunday. He said, ‘My job is to hold people accountable. That’s why I agree with being held accountable myself.’ That’s why I agree with being held accountable myself. He has basically –I would say that this is — people are slamming this as fake news. To me at this time a mistake. He didn’t deliberately put out a false piece of information he made an error. What do you girls think?” (Related: ABC forced to “correct” FAKE NEWS report that candidate Trump directed Michael Flynn to talk to Russians — “Collusion” hoax takes another hit.)\n\nThe other co-hosts weighed in as well, with the only “conservative” on the panel — Megan McCain, daughter of Sen. John McCain, RINO-Arizona — calling what Ross put out “fake news.”\n\nAnd as for Behar, she isn’t “guilty of premature evaluation.” Her problem is that she — like all of the other insane, Left-wing establishment media types — is stricken with “Trump Derangement Syndrome.” These people really do believe the phony “Trump-Russia collusion” narrative, which is why they are so quick to accept any ‘reports’ that appear to substantiate their unshakeable belief.\n\nAnd while people like her claim Trump is the one with mental issues, to believe something that isn’t real is the epitome of mental derangement.\n\nThere was no “Trump-Russia collusion,” because if there had been, given all of the Deep State leaks since Trump won a year ago, we’d have seen real evidence of collusion by now.\n\nJ.D. Heyes is also editor-in-chief of The National Sentinel.\n\nSources include:\n\nBreitbart.com\n\nTheNationalSentinel.com Joy Behar of “The View” is an enabler of FAKE NEWS after defending network colleague’s bogus “Russia collusion” hoax about Michael Flynn", "https://www.naturalnews.com/2017-12-05-is-the-vaccine-industry-more-like-harvey-weinstein-or-jared-fogle.html": "(Natural News) Long-time Natural News readers know that the vaccine industry is more than just a scandal, it represents a direct health threat to all of us, thanks in large part to behind-the-scenes shenanigans between Big Pharma and the federal government’s healthcare approval agencies.\n\nBut perhaps the most sinister thing about the industry is the harm it does to those we seek to protect most: Mothers and our children.\n\nAnd that begs the question — is the industry more like habitual sexual predator Harvey Weinstein, the Hollywood mogul accused of multiple unwanted sexual advances and activities against women, or disgraced Subway spokesman Jared Fogle, who was busted in 2015 for paying to have sex with minors and possessing child pornography?\n\nAs for the harm vaccines do to women, this mostly comes in the form of mercury-laced flu shots, even to expectant mothers. In 2012, Natural News reported that expectant mothers who were given flu shots containing mercury were more likely to have a child with ADHD:\n\nNew research published in the journal Archives of Pediatrics & Adolescent Medicine reveals that even low-level mercury exposure during pregnancy can cause children to develop attention deficit hyperactivity disorder (ADHD) and other similar hyperactive and behavioral conditions.\n\nThe study, by researchers from Boston University’s School of Public Health analyzed links between mercury levels and the consumption of fish among pregnant women. They concluded that eating more fish helps to reduce the risk of impulsiveness, hyperactivity, and atypical inattention behavioral patterns in kids.\n\nBut they also noticed that exposure to as little as one microgram per milliliter of mercury during pregnancy can cause serious mental health issues in kids.\n\n“Low-level prenatal mercury exposure is associated with a greater risk of ADHD-related behaviors, and fish consumption during pregnancy is protective of these behaviors,” wrote Dr. Sharon K. Sagiv, Ph.D., M.P.H, and her colleagues. “These findings underscore the difficulties of balancing the benefits of fish intake with the detriments of low-level mercury exposure in developing dietary recommendations in pregnancy.”\n\nAs for women and children, vaccines “medically rape” them all the time, according to Natural News founder and editor, Mike Adams, the Health Ranger. In a column in March, he wrote that thanks to vaccine mandates in some states like California, government authorities are forcing women and their children to be injected with toxic, foreign substances while calling it “public health policy.”\n\nIn those states, governments essentially “own” your children, he continued, meaning they “can require them to be penetrated and contaminated with diseased DNA, human fetal tissue, brain-damaging heavy metals and more (all those are real ingredients used in vaccines today, by the way),” Adams continued. (Related: Twenty-four states with vaccine bills that restrict medical rights and treat humans like animals to track vaccination status.)\n\n“Most women agree that ‘NO means NO’ when it comes to decisions about their bodies, yet the vaccine industry has declared that it stands in favor of medical rape by demanding that ‘NO means YES!’” he said.\n\nThe same is true for our kids: Such vaccine mandates allow them to be penetrated with toxic foreign substances that have been proven, through studies, to harm them.\n\nIt’s true. As Natural News noted in the 2012 article, “According to the National Network for Immunization Information (NNII), vaccines contain anywhere from two to three micrograms of thimerosal per milliliter of vaccine, and this is in a lowest case scenario. When thimerosal is actually added to vaccines on purpose as a preservative, rather than simply being left over as a trace residue from the manufacturing process, levels of mercury contamination can be much higher.”\n\nSo who does the vaccine industry most emulate — serial sexual abuser Weinstein or serial child molester Fogle? Maybe the correct answer is both.\n\nJ. D. Heyes is a senior correspondent for Natural News and editor of TheNationalSentinel.com.\n\nSources include:\n\nNaturalNews.com\n\nNaturalNews.com Is the vaccine industry more like Harvey Weinstein or Jared Fogle?", "https://newstarget.com/2017-11-15-explosions-not-a-problem-for-the-new-russian-superman-suit-for-soldiers.html": "Explosions? Not a problem for the new Russian “Superman suit” for soldiers\n\nAs Russia continues to beef up its military prowess, the country appears ready to outfit its infantry with futuristic super suits — specifically, futuristic super suits that will allow foot soldiers to walk through explosions unscathed.\n\nSuch is what was shown in a newly released video. In it, a man dressed head-to-toe in a combat suit can be seen stepping across a grassy field as he’s assailed by landmine explosions and searing flames. The man appears to be uninjured, and his suit shows little sign of damage.\n\nAccording to the DailyMail.co.uk, the “Superman suit” is a part of Ratnik, a Russian infantry combat system designed to improve the efficacy and connectivity of warfare personnel. Those involved with the program accomplished this by developing combat gear like thermal and night vision monoculars and, of course, the Superman suit.\n\nThe suit itself is said to be made of aramid or aromatic polyamide, a man-made, high-performance material characterized by its high strength, excellent resistance, and low flammability. The use of aramid has made it so that the suit can withstand over half a minute of direct contact with fire. Though the shock of landmine blasts can harm wearers of the suit, it still offers protection from the heat of grenade explosions.\n\nThe heatproof suit is expected to be ready for use by the year 2020, though Russia has gone on record to state that the suit was utilized in combat in 2016. No other details beyond this were given.\n\nWhat is known, however, is that the unveiling of the suit comes hot on the heels of the country’s latest military training exercises. Experts believe that these exercises, conducted on both land and sea, are demonstrations of strength by President Vladimir Putin — which may indeed be the case. (Related: WWIII could be fought with robotic exoskeletons; Russia, US compete to develop military exoskeletons.)\n\nJust last month, the Russian military showed off the Ratnik-3, an all-black suit that came kitted with an impressive array of features. Developed by the Russian state-owned Rostec, the Ratnik-3’s features included a stamina- and strength-boosting exoskeleton, the latest in bulletproof armor, a full-face visor and helmet equipped with a heads-up display (HUD), and a watch capable of enduring a nuclear blast.\n\nRostec furnished the Ratnik-3 with 59 items in all. Yet according to Colonel General Oleg Salyukov, Commander-in-Chief of the Russian Ground Forces, the total weight of the gear was reduced by 30 percent.\n\nSalyukov further added: “The implementation of the project will allow [us] to increase the performance of a soldier by 1.5 times in completing various tasks.”\n\nIn addition to having five integrated systems — which include life support, protection, command and communication, protection, and energy saving subsystems — the suit was designed for round-the-clock use under all weather conditions.\n\n“The level of technology and the reliability of the elements of servicemen’s outfit is growing,” said Sergey Abramov, Industrial Director for Rostec’s Armament Cluster Division. “Correspondingly, the level of a soldier’s capabilities on the battlefield is increasing. This new development by Central Scientific Research Institute for Precision Machine Engineering is another step in this direction.”\n\nSimilar to the fireproof suit, Russia is expected to roll out the Ratnik-3 for use in 2020. Though even with all of this new technology coming out to improve upon the country’s infantry, some believe that the future of their military lies in robotics.\n\n“I see a greater robotization, in fact, future warfare will involve operators and machines, not soldiers shooting at each other on the battlefield,” said Lieutenant General Andrey Grigoriev.\n\nWhichever direction the country takes, it’s best to keep a careful and wary eye on Russia.\n\nKeep up to date on all news relating to Russia by visiting WWIII.news today.\n\nSources include:\n\nDailyMail.co.uk 1\n\n\n\nDailyMail.co.uk 2 Explosions? Not a problem for the new Russian “Superman suit” for soldiers", "https://www.naturalnews.com/2017-12-04-abc-forced-to-correct-fake-news-report-that-candidate-trump-directed-michael-flynn-to-talk-to-russians-collusion-hoax-takes-another-hit.html": "(Natural News) Far-Left Democrats and their sycophantic allies in the “mainstream” media so want the “Trump-Russia collusion” narrative to be true that they are willing to throw away all sense of reason and reality to believe it.\n\nThat’s the only way to explain a series of events on Friday that left another legacy news organization with egg on its face and no closer to the truth about what did — and did not — happen last year regarding the campaign of President Donald J. Trump.\n\nAs The National Sentinel and others reported, ABC News reporter Brian Ross filed a “bombshell” of a story early Friday morning, as former Trump national security advisor Michael Flynn was heading to a federal court to plead guilty to charges that he lied to FBI agents — charges that were going to be brought by special counsel Robert Mueller.\n\nRoss, citing an “anonymous” source (as usual), claimed that during last year’s campaign, then-candidate Donald Trump instructed Flynn to make contact with Russian officials.\n\nBoom! Finally, the “proof” the insane Left and its supporters have been waiting for since the Clinton campaign and Democrats invented the fake narrative that Trump and Russia “colluded” to “steal the election.”\n\nSo credible the story seemed that it not only sent shockwaves through the political establishment but also through financial markets: The Dow tanked 350 points following the news, as investors were just sure that the evidence of collusion had been found after all these months and Trump would soon be preparing for his impeachment.\n\nOnly, it turns out that the “source” for Ross’ story changed his version of events. As The National Sentinel noted, Ross appeared during Friday evening’s “World News Tonight” broadcast to issue a “clarification” — that Trump only instructed Flynn to look for ways to bolster U.S.-Russia ties after the election, and that the GOP nominee only asked Flynn to make actual contact with Russian officials after he became president-elect, which is not only proper but wholly anticipated of a transitioning new administration. (Related: So now that Michael Flynn is cooperating with Mueller, is Trump the next to be charged? Not so fast says THIS expert.)\n\n“[A] clarification tonight on something one of Flynn’s confidants told us and we reported earlier today,” Ross said during last night’s newscast. “He said the president had asked Flynn to contact Russia during the campaign.\n\n“He’s now clarifying that saying, according to Flynn, candidate Trump asked him during the campaign to find ways to repair relations with Russia and other world hot spots. And then after the election, the president-elect asked him to contact Russia on issues including working together to fight ISIS,” Ross said.\n\nSo — no collusion confirmation, just another phony-baloney, plastic-banana, fake news story we can add to all the others alleging ‘proof’ that Trump ‘colluded with Russia to steal the election from Clinton.’\n\nCNN, of all networks, actually outed Ross. That’s odd in and of itself because CNN isn’t known for being terribly accurate in its reporting of the Trump administration, either. But there you have it: Even a broken clock is right twice a day.\n\nThe cable news outlet noted:\n\nCNN had reached out to ABC News in the early afternoon to ask why Ross’ initial reporting was not included in the network’s online story about Flynn pleading guilty to lying to the FBI.\n\nSeveral hours later, a spokesperson for the network told CNN that Ross would be issuing a “clarification” on “World News Tonight,” which airs at 6:30 p.m. ET.\n\nThe Ross lie drew immediate condemnation from other establishment media reporters as well.\n\n“If we want to regain trust in the media, we need to admit our mistakes, especially when as consequential as this. Retract. Correct. Don’t use weasel words to describe it,” Jonathan Swan of Axios tweeted.\n\nIf we want to regain trust in the media we need to admit our mistakes, especially when as consequential as this. Retract. Correct. Don’t use weasel words to describe it. https://t.co/jFIavaQ4yv — Jonathan Swan (@jonathanvswan) December 2, 2017\n\nFormer CNN and Fox News anchor and host Greta Van Susteren also criticized ABC for trying to “sugar coat” its mistake by characterizing it as a “clarification.”\n\nIt’s important to note this isn’t the first major gaffe by Ross. He was forced to apologize for a 2012 report in which he suggested that the Aurora, Colo., theater killer may have had a connection to the conservative Tea Party movement.\n\nIt’s not clear that ABC News has finally had enough of Ross, but if the network wants to regain even a modicum of trust, it will fire him immediately.\n\nJ.D. Heyes is also editor-in-chief of The National Sentinel.\n\nSources include:\n\nCNN.com\n\nTheNationalSentinel.com ABC forced to “correct” FAKE NEWS report that candidate Trump directed Michael Flynn to talk to Russians — “Collusion” hoax takes another hit", "https://www.naturalnews.com/2017-11-03-how-much-you-think-about-your-mistakes-may-determine-the-difference-between-making-excuses-and-learning-a-lesson.html": "(Natural News) “That was a colossal mistake, but I meant well and tried my best, so I’m not going to beat myself up about it.” Sound familiar? We all do it. After all, excusing our mistakes makes us feel better and helps us to cope with the failure. However, an interesting new study conducted by a collaboration of scientists from Kansas, Stanford and Ohio State Universities, has found that while making us feel better temporarily, excusing our mistakes does not have the best long-term outcome. The study was published online in the Journal of Behavioral Decision Making.\n\nThe U.K.’s Daily Mail recently reported:\n\nWe’re often told [to] avoid dwelling on past mistakes if we want to move forward. But one group of scientists say the opposite may be true. They claim feeling the pain of failure leads to more effort to correct your mistake and perform better in the future. Researchers found that people who just thought about a failure tended to make excuses for why they were unsuccessful. This meant they didn’t try harder when faced with a similar situation.\n\nThe research team reached their conclusions after conducting several experiments, one of which involved asking 98 college students to search online for the price of a blender with specific technical specifications. The student who discovered the cheapest blender would win a cash prize.\n\nWhile they were waiting to find out who had won, the students were divided into two groups. One group was asked to focus on their emotional response to winning or losing, while the other group was told to focus on thinking about how they had done. Each person was told that they would need to write about their responses after the competition.\n\nThe experiment was rigged, of course, so that nobody found the lowest priced item – essentially, everybody failed.\n\nThe goal of the experiment was to determine how the two groups would handle another task in the future, so the participants were then given an additional task. Some were asked to search for a low-priced book as a gift for a friend (a similar task to the previous one), while the rest were asked to search for a gift book that was simply the best choice for a friend (a non-similar task).\n\nThe Times explained the results of the experiments:\n\nEmotionally motivated participants spent nearly 25 percent more time searching for a low-priced book than did participants who had only thought about —rather than dwelled on the pain of — their earlier failure.\n\nThere was no significant difference in effort made by participants when the second task wasn’t like the first.\n\nEssentially, the researchers found that people who made mistakes and then allowed themselves to focus on how bad those mistakes made them feel, were more likely to try harder the next time they dealt with a similar situation to avoid experiencing those emotions again. (Related: To learn more about human emotions and how to cope with them visit Psychiatry.news.)\n\n“All the advice tells you not to dwell on your mistakes, to not feel bad,” said Selin Malkoc, co-author of the study. “But we found the opposite. When faced with a failure, it is better to focus on one’s emotions — when people concentrate on how bad they feel and how they don’t want to experience these feelings again, they are more likely to try harder the next time.”\n\nUnfortunately, most of us try to protect ourselves from the effects of our mistakes, and protecting our egos often comes first. This emotional distancing makes us less likely to learn from those mistakes and avoid them in the future. (Related: Finnish researchers map how emotions are expressed physically in human bodies.)\n\nSo, next time you really mess something up – as all of us do from time to time – try to focus on how bad you feel about it, rather than excusing the error. If the results of the experiment are to be believed, this will set you up for a greater chance of success the next time you deal with a similar situation.\n\nSources include:\n\nDailyMail.co.uk\n\nOnlineLibrary.Wiley.com How you deal with your mistakes may determine the difference between making excuses and learning a lesson", "https://www.naturalnews.com/2017-11-17-operator-of-keystone-pipeline-quietly-cleaning-up-spill-of-210000-gallons-of-oil-from-largest-ever-leak-in-south-dakota.html": "(Natural News) As many environmentalists and local Native American tribes feared, a massive leak of some 210,000 gallons, or about 5,000 barrels, of oil has occurred along a section of the Keystone Pipeline in South Dakota, making it the largest-ever spill.\n\nThe company quietly announced via a November 16 tweet that it is “currently responding to an incident in Amherst, SD.”\n\n“We have activated emergency response procedures and dispatched ground crews to assess the situation,” the tweet continued.\n\nAs reported by Circa News, the company said it shut the pipeline down around 6 a.m. CST on Thursday after employees said they saw a drop in pressure.\n\nWe are currently responding to an incident in Amherst, SD. We have activated emergency response procedures and dispatched ground crews to assess the situation. https://t.co/oFyyU5YYo0 — TransCanada (@TransCanada) November 16, 2017\n\nThe spill is the largest Keystone leak to have occurred to date in South Dakota, according to a spokesman from the state’s Department of Environment and Natural Resources, Brian Walsh, in an interview with CNN.\n\nThe network reported that the leak was discovered just days before Nebraska officials are set to announce a decision as to whether the proposed Keystone XL pipeline, which is a related project, can move forward.\n\nBecause of the pending nature of that decision, some have speculated that perhaps the Keystone Pipeline in South Dakota was sabotaged in an effort to influence Nebraska officials into deciding against extending the pipeline project into their state.\n\nThe spill also occurred as Native American tribes in the Dakotas renew their efforts to protect natural water supplies against the potential that they could be contaminated by the recently completed Dakota Access Pipeline.\n\nAttorneys for the Standing Rock and Cheyenne River Sioux tribes have filed papers in federal court Wednesday asking a judge to reconsider their proposals regarding the pipeline, which federal officials and pipeline developers have said were not needed.\n\nThat said, Walsh told CNN that the section of pipeline where the leak occurred was buried.\n\n“It is a below-ground pipeline, but some oil has surfaced above ground to the grass,” Walsh said. “It will be a few days until they can excavate and get in borings to see if there is groundwater contamination.”\n\nThere were no initial reports that any oil had leached into surrounding waterways or water systems.\n\n“The safety of the public and environment are our top priorities and we will continue to provide updates as they become available,” the company said in a statement. (Related: Oil pipelines vs. rail transport: The statistics on spills vs. safety point to a clear winner.)\n\nThe Environmental Protection Agency is currently monitoring the situation and will provide assistance as required, a spokesman for the agency told CNN.\n\n“EPA is aware of the spill and is receiving periodic updates from the state of South Dakota, which is overseeing response activity at the spill site,” he said.\n\nAs Natural News reported in December 2016, local Native American tribes’ worse fears were realized when a pipeline spilled thousands of gallons of oil into a creek just 150 miles from the Dakota Access Pipeline in North Dakota:\n\nA North Dakota pipeline spill has released many tens of thousands of gallons of crude oil into a nearby creek, just two and a half hours away from Cannon Ball, ND, where activists have been protesting the construction of the Dakota Access Pipeline for months.\n\nMembers of the Standing Rock Sioux, along with allies in the environmental movement from around the country, had been speaking out against the pipeline for months, having rallied together to fight its construction on grounds leaks from the pipeline would pollute groundwater sources and water systems.\n\nAt the time, North Dakota officials estimated that 176,000 gallons of crude oil spilled from the Belle Fourth pipeline into nearby Ash Coulee Creek, near the city of Belfield — which was about 150 miles from the location of DAPL protest camps.\n\nJ. D. Heyes is also editor-in-chief of TheNationalSentinel.com.\n\nSources include:\n\nCirca.com\n\nNaturalNews.com Operator of Keystone Pipeline quietly cleaning up spill of 210,000 gallons of oil from largest-ever leak in South Dakota", "https://www.naturalnewsblogs.com/pineapple-juice-found-500-effective-cough-syrup/": "With winter on our doorstep, many of us end up with a nasty cold or cough. While most people run to the store for over-the-counter meds packed with artificial dyes and chemicals, I prefer to go all-natural and avoid the harmful side effects of commercially available cough syrups.\n\nYou would be surprised of how many natural remedies are in your pantry right now. Pineapple juice is one of these wonderful healing ingredients to soothe a persistent cough or sore throat.\n\nIn 2010 Indian researchers tested the effectiveness of natural substances such as pineapple juice to treat tuberculosis (find the study here). They found that a mixture of pineapple juice with raw honey, pepper and salt work extremely well to dissolve mucus and soothe a persistent cough. Patients recovered up to 5 times quicker with this all natural pineapple remedy compared to OTC cough syrup.\n\nBenefits Of Pineapple Juice\n\nPineapple thanks its many health benefits to a powerful enzyme called bromelain which acts as an antioxidant to reduce inflammation and swelling of the sinuses. It eliminates bacteria and fights infections.\n\nOnly 1 cup of pure pineapple juice contains 50% of your daily recommendation of vitamin C, another powerful antioxidant to strengthen your immune system and soothe a sore throat or cough.\n\nNext to bromalain and vitamin C, pineapple is also a good source of vitamin A, thiamin, riboflavin, vitamin B-6, folate, pantothenic acid, magnesium, manganese and potassium, which are all essential nutrients to keep your body healthy.\n\nPowerful All-natural Cough Suppressant Recipe\n\nIf you have a juicer it is best to make your own juice, or opt for unprocessed natural pineapple juice instead. Most commercially available brands contain too much sugar and added flavors and are low in the actual real fruit.\n\n1 cup pineapple juice\n\n¼ cup fresh lemon juice\n\n1 piece of ginger (about 3 inches)\n\n1 tablespoon raw honey\n\nPinch of salt\n\n½ teaspoon cayenne pepper\n\nBlend or juice all ingredients. Take ¼ cup of this remedy up to 3 times a day and your cough or sore throat will be gone in no time.\n\nNote: to improve digestion and effectiveness add a pinch of turmeric as well.\n\nFor more healing recipes, connect with me on Facebook or Google+, or subscribe to my weekly newsletter and claim your FREE Green Smoothie eBook. Pineapple Juice Found To Be 500% More Effective Than Cough Syrup", "https://www.naturalnews.com/2017-11-15-peter-schiff-exposes-bitcoin-bubble-theres-no-real-value-in-bitcoin.html": "(Natural News) Investment guru and financial expert Peter Schiff isn’t convinced that the popular online cryptocurrency Bitcoin is really worth what the market says it is. During a recent interview with Scott Gamm on The Street, Schiff contended that Bitcoin holds no real value because it isn’t backed by anything other than people’s trust, and that at some point the digital fiat is likely to crash and burn.\n\nSchiff has never really been a fan of Bitcoin, as he once famously likened it to “digital fool’s gold.” Bitcoin represents little more than a bubble, in his opinion – a game of “hot potato” in which some people are going to get really rich when the music stops playing, while many others who bought into the hype later on are going to lose big time.\n\nThough the price of Bitcoin recently reached its highest level yet at roughly $7,800 per coin, the cryptocurrency has been in a constant state of flux almost from its start. However in recent months, it’s been steadily climbing, which has caught the attention of many investors looking to get rich quickly. But Schiff warns that the risks are much more significant than many people believe.\n\n“There’s no real value, I believe, in Bitcoin,” Schiff stated emphatically when asked about Bitcoin’s bullish trend.\n\nIn many ways, Bitcoin is more of a BitCON, in Schiff’s view. He says that most people who are jumping onboard these days are doing so not to use Bitcoin as an everyday medium of exchange, but rather as a speculative investment asset for making money. At some point, this tactic will fail, which will happen right around the time that a critical mass of folks comes to the realization that Bitcoin isn’t actually worth anything at all.\n\nIs Bitcoin the equivalent of digital gold? Schiff says no\n\nOne of the biggest problems with trying to utilize Bitcoin as an everyday medium of exchange is that the platform upon which the cryptocurrency was built is simply far too slow to process the number of transactions necessary to support an entire economy. While Visa and MasterCard are able to process tens of thousands of transactions per second, Bitcoin transactions are limited to just a handful per minute.\n\nAnd even with its limited quantity, the mathematical limitations of Bitcoin prevent it from really lasting into the future. This presents great risks because nobody knows when Bitcoin will fail, though many believe that this failure is a mathematical certainty.\n\nEven so, many people are now looking to Bitcoin not to replace fiat currency, but rather to replace gold as a store of wealth for investment purposes. Schiff says this is pretty much a joke as well, and that Bitcoin can’t really pass the muster in terms of competing with actual physical gold in what it can actually be used for practically.\n\n“[Bitcoin] is a digital asset, but what it’s actual value is remains to be seen. But it has nothing in common with gold,” says Schiff. “There are certain things that you could say it has with gold, but you can’t do anything with it.”\n\n“None of the real world uses of gold (are applicable to Bitcoin). I mean, gold is used in jewelry; you can’t make jewelry out of a Bitcoin. Gold is used in consumer electronics; it’s used in medicine; it’s used in aerospace. There’s no use for Bitcoin other than storing it as an asset.”\n\nAt the same time, many people value Bitcoin for what it is, and that alone gives it “value,” at least in terms of a cash exchange price. But will this last forever? Schiff certainly isn’t convinced that it will.\n\nSources for this article include:\n\nSGTReport.com\n\nNaturalNews.com Peter Schiff exposes Bitcoin bubble: \"There's no real value in Bitcoin\"", "https://www.naturalnews.com/2017-11-20-wars-keep-on-killing-gulf-war-illness-causes-dna-damage-in-vets-according-to-new-research.html": "(Natural News) Gulf War Illness (GWI), or Gulf War Syndrome, is the name given to a cluster of chronic symptoms affecting Gulf War veterans and civilian workers. The cause behind these symptoms — which range from fatigue to joint pains to memory problems — has been studied and debated on for the longest time. Yet scientists from Rutgers Medical School and the Veterans Affairs New Jersey Health Care System may have found an another potential answer, and lingering effect of this conflict; one that lies in mitochondrial DNA (mtDNA).\n\nAccording to lead researcher Michael J. Falvo, the idea for looking into the mitochondria came shortly after he joined the Veterans Affairs New Jersey Health Care System. There, he learned that numerous Gulf War veterans had unexplained symptoms throughout many areas of their bodies. “To me, that sounded awfully consistent with the symptoms of mitochondrial disorders. After reviewing the literature, I realized at that time there was no published study on GWI that investigated whether mitochondrial dysfunction contributed to symptoms,” explained Falvo.\n\nAs part of their study, Falvo and his colleagues recruited 28 participants: 21 veterans who had GWI, and three veterans without GWI, and four non-veterans who served as the control group. Blood samples were collected from each participant, which were then analyzed using a revolutionary technique that allowed the researchers to study the mtDNA without having to isolate it from total DNA.\n\nThey discovered that the veterans with GWI had more mtDNA and a greater number of lesions, implicating an overabundance of DNA damage. As stated on ScienceDaily.com, the lesions were direct measures of DNA damage, while the extra copies of mtDNA were reflections of the body’s response to the damage.\n\nTheir findings were consistent with the symptoms of patients who had mitochondrial dysfunction. People with this condition tend to experience a variety of symptoms across different organ systems, namely the muscles and nerves. Veterans who had GWI have reported feeling the same symptoms. Furthermore, there are veterans who claimed to have been exposed to dangerous chemicals and toxins during the war. (Related: Gulf War illness found to be caused by toxic chemicals.)\n\n“Mitochondrial dysfunction among veterans with GWI may help explain, in part, the persistence of this illness for over 25 years. For example, chemical and environmental exposures during deployment may have provided the initial [harm] to mtDNA and accumulation of damage,” noted the researchers. Mitochondria, the energy powerhouses of cells, are highly sensitive to damage that could be caused by toxins.\n\nFollowing this, Falvo has stated that he and his colleagues intend on expanding their efforts to further confirm the results of their study. “More importantly, we want to gain new knowledge of the damage of mtDNA on mitochondrial function and the recovery process. We need to be sure that our findings are robust. For us, that means confirming the present results but also investigating what might be contributing to mitochondrial DNA damage or its lack of repair,” he said.\n\nFast facts on Gulf War Illness\n\nGWI is marked by a variety of chronic symptoms, with each affected person experiencing them differently. The most common ones are fatigue, musculoskeletal pain, cognitive problems, skin rashes, and diarrhea.\n\nA 2013 report by the Institute of Medicine stated that one-third (roughly 175,000 to 250,000, or 25 to 35 percent) of Gulf War veterans have been impacted by this condition.\n\nPast explanations for GWI have included psychological factors like post-traumatic stress disorder (PTSD); exposure to chemical warfare agents; other chemical agents such as smoke from oil well fires; and even depleted uranium.\n\nCurrently, there’s no known specific treatment for GWI, though one option suggested by research is cognitive-behavioral therapy, which is believed to help affected persons manage their symptoms.\n\nFeel free to visit Medicine.news today for more stories focusing on health and well-being.\n\nSources include:\n\nScienceDaily.com\n\n\n\nHopkinsMedicine.org Wars keep on killing: Gulf War illness causes DNA damage in vets, according to new research", "https://newstarget.com/2017-11-17-did-you-know-that-buying-and-selling-bitcoin-is-illegal-in-the-united-states-thanks-to-totalitarian-money-transmitting-business-registration-laws.html": "Feds claim that buying and selling large amounts of Bitcoin without a license is illegal in the United States due to “money transmitting business registration” laws\n\nA Michigan man by the name of Bradley Anthony Stetkiw has run into some serious trouble with local authorities after he tried to sell several hundred thousand dollars’ worth of Bitcoin online. According to the Feds, Stetkiw’s actions in selling the cryptocurrency supposedly violate laws that prohibit the operation of an “unlicensed money transmitting business,” for which selling Bitcoin in high amounts apparently qualifies.\n\nCharges filed in local district court say that the 52-year-old man had been running a Bitcoin exchange through a website called “LocalBitcoins” that facilitates the buying and selling of Bitcoin locally before he was apprehended. Government officials are claiming that Stetkiw needed to acquire a license, also known as getting the government’s permission, before engaging in this alleged “business venture,” which he apparently did not do. So they set up a sting operation in which federal agents purchased various amount of Bitcoin from Stetkiw on six separate occasions until he met the “anti-money laundering” regulatory threshold.\n\nReports indicate that Stetkiw had already sold about $150,000 worth of Bitcoin prior to the Feds launching their sting operation. After these same Feds purchased another $56,000 in Bitcoin from Stetkiw, they facilitated his crossing of the $200,000 threshold, resulting in his swift arrest and indictment for failing to obtain a government stamp of approval before conducting his private affairs.\n\nStetkiw committed no crime against anyone; he simply failed to pay the government ‘mafia’ its cut of the profits\n\nBased on what we know about the case, Stetkiw didn’t harm anyone, steal their property, or in any other way commit an egregious act that would be deserving of such a fate. He simply bought and sold Bitcoin like millions of other people do – though he did so in high volume, which obviously caught the attention of the Feds who wanted their cut of the profits.\n\nStetkiw’s only “crime,” in other words, was failing to comply with the obscure money transmitting business registration requirements that are apparently outlined in Title 31 of the United States Code, Section 5330. What this suggests is that this was purely a case of rogue government officials using a technicality to nab an honest, hard-working man of his money and property.\n\nBecause Bitcoin is so new to the financial scene, there’s no preexisting precedent to determine how Bitcoin transactions are to be handled under the law. Nobody could have guessed, in other words, that buying and selling large amounts of Bitcoin over a certain threshold – in this case $200,000 worth – requires a special permit, and yet Stetkiw was treated with the full brunt of this largely unknown law.\n\nHe isn’t the only one, either. As of this writing, there are several other cases ongoing in which independent, United States-based Bitcoin sellers are being targeted, arrested, and taken down simply for conducting Bitcoin transactions online. The implications of this are dire for the rest of the Bitcoin world, which will now have to pore through every letter of the law to try to figure out what they may or may not be doing “illegally” without knowing it.\n\n“The government really dislikes it when people make a living by conducting moral business practices without paying for their permission to do so,” writes Mac Slavo for SHTFplan.com. “These arrests also suggest what many have feared for years: the government is attempting to take down bitcoin using nefarious means since they cannot figure out how to regulate the cryptocurrency.”\n\nSome people believe that Bitcoin is currently in the throes of a massive speculative bubble. For the latest news on the rise and fall of Bitcoin, stay tuned to Bubble.news.\n\nSources for this article include:\n\nSHTFplan.com\n\nNaturalNews.com Feds claim that buying and selling large amounts of Bitcoin without a license is illegal in the United States due to “money transmitting business registration” laws", "https://www.naturalnews.com/2017-11-19-babies-that-were-exclusively-breastfed-have-less-than-half-the-risk-of-eczema.html": "(Natural News) Adding to the wealth of evidence that prove the benefits of beast milk, a new study finds that breastfeeding could lower the risk of eczema in children by half, as reported by the Science Daily.\n\nA team of researchers from King’s College London, Harvard University, University of Bristol, and McGill University assessed whether prolonged and exclusive breastfeeding lowered the risk of asthma, atopic eczema, and low lung function in adolescence. In the study, published in the Journal of the American Medical Association (JAMA) Pediatrics, they analyzed data from a total of 13,557 teenagers aged 16 from Belarus, all of whom were enrolled in the Promotion of Breastfeeding Intervention Trial (PROBIT). The PROBIT study initially recruited 17,046 mothers and their newborn babies from June 1996 to December 1997.\n\nThe researchers studied 31 maternity hospitals and one outpatient clinic associated to each hospital. These participating institutions were randomly assigned to either take part in a breastfeeding program or not. Breastfeeding programs trained nurses, midwives, and doctors to promote and support mothers to breastfeed their babies. The researchers then followed up with the babies until they reached adolescence to determine the effect of supported breastfeeding to their lung function, asthma, and eczema. The participants were tasked to answer surveys on the three health issues. In addition, the researchers conducted a skin examination for eczema, and a breath examination for lung health.\n\n“PROBIT, the largest randomized trial ever carried out in the area of human lactation, continues to yield scientifically and clinically important information more than two decades after its inception,” said Michael Kramer of McGill’s Faculty of Medicine and the Research Institute of the McGill University Health Centre (RI-MUHC), the lead investigator on the PROBIT study.\n\nThe findings of the study revealed that children whose mothers received support to breastfeed exclusively for a sustained time from birth had a 54 percent lower risk of eczema at the age of 16. However, there was no association between breastfeeding and the risk of asthma. Eczema is a skin condition that causes the skin to be itchy, dry, cracked, sore, and red. About one in every five children and one in 10 adults suffer from eczema.\n\n“The [World Health Organization] WHO recommends between four and six months of exclusive breastfeeding to aid prevention of allergy and associated illnesses. Our findings add further weight to the importance of campaigns like the Baby-Friendly Hospital Initiative (BFHI), which is tackling low rates of breastfeeding globally,” Carsten Flohr, lead author of the study, explained.\n\nMoms who breastfeed longer will become more attentive mothers\n\nBreastfeeding does not only benefit the babies, but also the mothers. A study revealed that women who breastfeed for longer will continuously become more attentive mothers up to 10 years, as reported by The Daily Mail. (Related: Breast-milk is the elixir of human life.)\n\nResearchers from Boise State University examined data from 1,272 families who took part in the National Institute of Child Health and Human Development’s Study of Early Child Care. They measured maternal sensitivity by the timing of a mother’s responsiveness to her child, her emotional tone, how flexible her behavior was, and her ability to recognize her child’s cues by conducting interviews and videotaping participating families in the homes until the child turned 11 years old.\n\n“It was surprising to us that breastfeeding duration predicted change over time in maternal sensitivity,” said Jennifer Weaver, lead author of the study.\n\nThe study, which was published by the American Psychological Association, suggested that the time spent breastfeeding helps develop the relationship of the child and mother.\n\n“Ultimately, I do hope that we will see breastfeeding examined more closely as a parenting factor, not just as a health consideration, to allow us to more fully understand the role that breastfeeding plays in family life,” Weaver expressed.\n\nFind out more health benefits of breast milk at AlternativeMedicine.news.\n\nSources include:\n\nScienceDaily.com\n\nDailyMail.co.uk\n\nJAMANetwork.com Breastmilk: The gift that keeps on giving… Babies who were exclusively breastfed have less than half the risk of eczema as teenagers than those that were not", "https://www.naturalnewsblogs.com/10-common-habits-seriously-damage-kidneys/": "Our kidneys are super important for our health. They filter our blood, produce hormones, absorb minerals, produce urine, eliminate toxins, and neutralize acids. So as one of the most important organs in your body, your kidneys deserve some love.\n\nDamage or steady decline of your kidneys can often go unnoticed for years as your kidneys can still do their job with as little as 20% of their capacity. Therefore kidney diseases are often referred to as “The Silent Diseases”. That’s why it is so important to take care of them before it is too late.\n\nHere’s a list of 10 common habits that put a lot of pressure on your kidneys and can cause serious damage over time.\n\n1. Not Drinking Enough Water\n\nYour kidney’s most important function is to filter blood and eliminate toxins and waste materials. When you don’t drink enough plain water during the day toxins and waste material start to accumulate and can cause severe damage to your body.\n\n2. Too Much Salt In Your Diet\n\nYour body needs sodium or salt to work properly. Most people however consume too much salt which may raise blood pressure and put a lot of stress on the kidneys. As a good rule of thumb, no more than 5 grams of salt should be eaten on a daily basis.\n\n3. Frequently Delaying The Call Of Nature\n\nMany of us ignore the urge to go because they are too busy or want to avoid public bathrooms. Retaining urine on a regular basis increases urine pressure and can lead to kidney failure, kidney stones, and incontinence. So listen to your body when nature calls.\n\n4. Kick The Sugar Habit\n\nScientific studies show that people who consume 2 or more sugary drinks a day are more likely to have protein in their urine. Having protein in your urine is an early sign your kidneys are not doing their job as they should.\n\n5. Vitamin And Mineral Deficiencies\n\nEating a clean, whole food diet full of fresh vegetables and fruits is important for your overall health and a good kidney function. Many deficiencies can increase the risk of kidney stones or kidney failure. Vitamin B6 and magnesium, for instance, are super important to reduce the risk of kidney stones.\n\nAn estimated 70 to 80 percent of Americans isn’t getting enough magnesium, so there may be a good chance that you are one of them. Click here to learn more about magnesium deficiencies.\n\n6. Too Much Animal Protein\n\nOver consumption of protein, especially red meat, increases the metabolic load on your kidneys. So more protein in your diet means your kidneys have to work harder and this can lead to kidney damage or dysfunction over time.\n\n7. Sleep Deprivation\n\nWe have all heard how important it is to get a good night’s rest. Chronic sleep deprivation is linked to many diseases and kidney diseases are also on the list. During the night your body repairs damaged kidney tissue, so give your body the time to heal and repair itself.\n\n8. Coffee Habit\n\nJust as salt, caffeine can raise blood pressure and put extra stress on your kidneys. Over time excessive consumption of coffee can cause damage to your kidneys.\n\n9. Painkiller Abuse\n\nWay too many people take painkillers for their small aches and pains, while there are many all-natural, safe remedies available. Excessive use or painkiller abuse can lead to severe damage of liver and kidneys.\n\n10. Alcohol Consumption\n\nAlthough there is nothing wrong with enjoying a glass of wine or having a beer once in a while, most of us don’t stop after just one drink. Alcohol is actually a legal toxin that puts a lot of stress on our kidneys and liver.\n\nTo stay healthy and avoid kidney issues it is important to eat lots of fresh, whole foods and if you keep the above information in mind and avoid these common habits as much as possible, your kidneys will not be under constant stress and your body will thank you for that.\n\nIf you want to reset your kidneys and heal your body from the inside out, click here to access a 10-day whole food fruit and veggie detox that won’t leave you hungry or short in nutrients,\n\nDon’t forget to download my FREE green smoothie eBook to sneak more kidney-friendly leafy greens and fruits into your diet or connect with me on Facebook or Google+ for more healthy tips, tricks, and recipes. 10 Common Habits That Seriously Damage Your Kidneys", "https://www.naturalnews.com/2017-11-20-scientists-explore-why-fear-is-fun-for-some-the-flight-or-fright-chemicals-are-also-present-in-happiness.html": "(Natural News) What do fear and excitement have in common? Experts reveal, in an article by the Daily Mail, that the “fight-or-flight” response triggered by fear can become a rush of excitement under a different situation.\n\nFear is a fundamental emotion experienced by all complex organisms against perceived danger or threat to their physical being or existence. However, some of the chemicals responsible for the “fight-or-flight” response also trigger the more positive emotional states in humans such as happiness and excitement. This explains why we feel a certain “rush” when we intentionally give ourselves a scare.\n\nStudies suggest that context is a major factor in how we perceive and experience fear. During Halloween for instance, your brain recognizes that the scary people and things around you are intentional and meant as a make-believe, quickly adjusting this experience into enjoyment. On the other hand, if a stranger suddenly chases you into a dark alley, your brain will perceive it as a form of threat and send off danger signals throughout your body that make you want to flee immediately.\n\nThe reaction to fear starts from the area in the brain called the amygdala. This almond-shaped set of neurons is responsible for processing memory, decision-making, and emotional reactions. The amygdala responds to triggers brought about by fear, such as the sight of a predator, and activates areas in your body in preparation for motor functions involved in the fight-or-flight response. The brain decides which parts of your body to slow down and which to boost up in order to be more efficient in the face of danger.\n\nAnother part of the brain that interprets perceived threat is the hippocampus, which is closely connected with the amygdala. It is involved in a higher-level processing of context (together with the prefrontal cortex), which helps a person identify if a perceived threat is real. For instance, seeing a lion in the wild can trigger a strong fear reaction, whereas seeing a lion in its enclosure in a zoo will trigger curiosity more than anything. The different reactions are brought about by the contextual processing of the hippocampus and prefrontal cortex.\n\nExperience is a major factor in identifying a real threat from a perceived one, but instructions such as spoken words and written notes are also an effective tool in instilling fear. For instance, if a sign says the dog is dangerous, proximity to it will trigger a fear response.\n\nFear can bring about a positive experience to some people. A sudden, unexpected moment of fright puts our minds on high alert in an instant and makes us focus on the here and now – a perfect distraction from situations that make us anxious such as trouble at work or deadlines in school. It can also be a hilarious moment between friends – humans are able to pick up on the current emotional state of those around them, so when your friend has gone from screaming to laughing inside a haunted house, you feel a sense of relief and laugh along.\n\nFactors such as context, distraction, and social interaction may influence the way we experience fear, but they are all connected by our sense of control. When the brain is able to recognize that a situation is not a real threat, it will relabel the experience as enjoyable, as we feel in control at that moment. Nevertheless, when the brain perceives the experience as “too real,” an extreme fear response can overcome the sense of control over the situation. For instance, a person who enjoyed a movie about alien invasion may feel uncomfortable sitting through a documentary-style movie about demonic possessions because it may seem “too real.”\n\nThere are abnormal levels of fear in the form of disorders like phobias such as social phobia, generalized anxiety disorder, separation anxiety, PTSD, and obsessive compulsive disorder. These can be debilitating and, without proper supervision and appropriate treatment, can halt a person’s normal life. (Related: Different Types of Anxiety Disorders.)\n\nSources include:\n\nDailyMail.co.uk\n\nTheConversation.com Scientists explore why fear is fun for some; the fight-or-flight chemicals are also present in happiness", "https://www.naturalnews.com/2017-12-05-twitter-just-silenced-pj-medias-terrorism-editor-in-latest-censorship-scheme-to-eliminate-voices.html": "(Natural News) A veteran journalist from the popular independent media website PJMedia.com has had her personal Twitter account removed from the social media platform indefinitely, and there doesn’t appear to be any legitimate reason for this besides Twitter’s continued assault on conservative free speech.\n\nBridget Johnson, who specializes in covering issues related to terrorism, was reportedly suspended from Twitter not for posting an offensive tweet or for arguing with anyone, but just because – as Twitter has offered Johnson no explanation for this sudden act of censorship. It has been over a week, in fact, since Johnson was last able to access her Twitter account, and many of her followers and supporters are demanding answers.\n\nAs explained in Twitter’s Help Center, there are only two types of suspension that the social media giant imposes on its users. One is a “temporary timeout” that results in a user’s account being reinstated rather quickly, usually within just a few hours. The second type of suspensions is more “permanent,” and is considered to be a much more serious mode of action.\n\nBy all appearances, Johnson’s Twitter account was subjected to the latter form of suspension, which is something of an anomaly as Johnson has always acted professionally and with dignity while using her Twitter account. She has furthermore not been observed engaging in abusive or otherwise unacceptable behavior, which begs the question as to why she was apparently targeted for removal.\n\n“While many Twitter users engage in abusive behavior on the platform, Bridget does no,” writes colleague Paula Bolyard for PJMedia.com.\n\n“Nor does she brawl with other users or engage in flame wars. She’s a veteran journalist who, prior to joining the PJM team, worked at The Hill, the Rocky Mountain News, and the Los Angeles Daily News. She is an NPR contributor and has also been published at USA Today, The Wall Street Journal, National Review Online, Politico, the New York Daily News, The Jerusalem Post, the New York Observer, The Washington Times, and RealClearWorld. Bridget is a respected terror analyst and is known for her fact-based, impartial reporting.”\n\nThe technocracy’s sinister crusade against free speech strikes again\n\nA quick perusal of Twitter’s terms of service regarding all of the potential causes for account suspension reveals that, once again, the social media platform is in violation of its own guidelines. The only reasons given as to why Twitter might suspend an account permanently is if they appear “spammy” or fake, if they pose a security risk, or if they include “abusive tweets or behavior.”\n\nAn archived view of Johnson’s Twitter account activity shows none of the above – unless, of course, Twitter has once again decided to arbitrarily apply its own definitions of “abusive” to condemn content that its employees or shareholders (which include Saudi leaders like Prince Alwaleed Bin Talal Bin Abdulaziz Alsaud, who was recently arrested) find objectionable or that go against their personal agendas.\n\nThis seems to be the only possibility, in this case, as to why Johnson’s account was suspended. Somebody didn’t like what she had to say, so they targeted her account for removal with no explanation as to why. And as of this writing, she personally has yet to receive a response from Twitter providing any input on the matter.\n\nAs we reported earlier in the year, Twitter, along with other social media giants like Facebook and Google, decided to implement new free speech restrictions to silence users presenting politically “incorrect” views. Following Twitter’s implementation of this policy, the company had this to say in apparent contradiction of what it’s actually doing in reality:\n\n“We stand for freedom of expression and people being able to see all sides of any topic. That’s put in jeopardy when abuse and harassment stifle and silence those voices. We won’t tolerate it and we’re launching new efforts to stop it.”\n\nDiscover more news coverage of the dangerous CULT of the Left at LeftCult.com.\n\nSources for this article include:\n\nPJMedia.com\n\nQZ.com Twitter just silenced PJ Media’s terrorism editor in latest censorship scheme to eliminate non-liberal points of view", "https://www.naturalnews.com/2017-12-04-natural-vs-artificial-herd-immunity-what-have-failed-vaccination-programs-taught-us.html": "(Natural News) Herd immunity is a concept by which an infectious agent can no longer spread across a population because a sufficiently large percentage of individuals have immunity, either from a history of exposure to the wild-type of the infectious agent, or due to acquired immunity from vaccination with a vaccine designed to protect against the wild-type. From an individual perspective, herd immunity can afford protection to one who is not immune.\n\n(Article by Dr. James Lyons-Weiler, PhD, republished from WorldMercuryProject.org)\n\nThis type of immunity exists within populations to varying degrees depending on the number of individuals who are immune to the infectious agent. Other factors that influence the spread of pathogens include attributes of the infectious agent, attributes of the vaccine, the route, mode and rate of transmission of the infectious agent, the lethality of the infectious agent, and the diversity of types of the specific pathogen for which immunity is sought.\n\nRegardless of whether immunity is achieved via a vaccine, or via natural infection, the total percentage of individuals who are immune can have an effect of slowing down the rate of spread of infection via natural transmission. Herd immunity is sought, in part, due to concern over individuals who are immunocompromised because they are more likely to contract a circulating pathogen in a population in which the infectious agent is relatively free to spread. It is generally thought that there is an inverse relationship between the percentage of a population that is immune, and the chance that a person who is not immune will come into contact with an individual who can transmit the virus.\n\nEither through natural immunity or through vaccination, sufficient herd immunity can, in principle, bring the rate of transmission of an infectious agent to zero, with immune individuals collectively acting as a barrier to the spread of the infectious agent, until it “burns out.” Unless there is a natural reservoir, herd immunity can be a factor that can contribute to the eradication of infectious agents.\n\nIn most mainstream descriptions of herd immunity, the contribution of natural immunity is diminished, or not even mentioned, as the individuals are counted as part of the percentage that have been infected. However, the statistic of interest to epidemiologists tracking the spread of infectious disease is the number of new transmissions, so any individual who has recovered from a previous infection, and who is now immune, most typically does not represent a source of potential new infections.\n\nIndividuals who have natural immunity, whether via natural infection, or passive immunity in babies who acquire their mothers’ antibodies, all contribute to a reduction in the rate of occurrence of new transmissions. Some viruses and bacteria however, are inherently capable of re-infecting, either because they rapidly evolve (such as the cold virus, or the influenza virus), or there are many types (such as HPV), or because they result in a poor or non-specific immune response.\n\nThe determination of the benefit of widespread vaccination for any vaccine must consider not only the ability to protect those at risk, but also the downstream costs due to vaccine injuries.\n\nVaccines: Efficacy and Injury\n\nEfficacy of specific vaccines vary, and thus a difference exists between the rate of vaccination and the rate of immunization. This difference is one of the reasons why there can be no one fixed rule for percentage of vaccination rate required to achieve sufficient herd immunity. Other factors include:\n\nthe incidence of the disease at a given time\n\nvariation among vaccines in terms of the period of immunity (the period for which a vaccine confers protection against the wild-type)\n\nthe nature in which vaccination is conducted.\n\nWhen only an identifiable segment of the population is at risk of acquiring an infection, such as is the case for Hepatitis B, targeted vaccination can be an effective means of control. The determination of the benefit of widespread vaccination for any vaccine must consider not only the ability to protect those at risk, but also the downstream costs due to vaccine injuries. The calculations used to bring a Hepatitis B full-population (mass vaccination) program forward did not include any explicit determination or estimation of the cost of Hepatitis B vaccination beyond the cost of the vaccine units themselves.\n\nVaccine injury is a poorly-studied factor that can directly impede the ability of vaccines to contribute to herd immunity.\n\nObviously, a vaccine that imparts a higher risk of injury than is relayed to the public, either due to weak, poor, or fraudulent vaccine safety science, will cause a manifestation and realization of that risk, which then will be shared across news media outlets (1980s-late 1990s) and, with mainstream media afraid of losing advertising revenue from direct-to-consumer marketing, via social media outlets (late 1990s-present).\n\nFor example, widespread vaccine injury reports by thousands of parents including immediate (same or next day) symptoms such as seizures, screaming, head-banging, loss of verbal communication, etc. have contributed to vaccine hesitancy. This will reduce vaccine uptake, thereby limiting the ability of that vaccine to contribute to herd immunity. Such has been the case now for many vaccines currently on the CDC vaccination schedule. The cause of the inability of the vaccine to contribute to herd immunity in these cases results from clearly misleading information on the safety of the product, magnifying distrust.\n\nSome vaccines come with warnings that those receiving the vaccine should not go near infants who have not been vaccinated against that infectious agent. This is the case of vaccines against the Bordetella pertussis bacterium, which causes whooping cough (a treatable respiratory disease).\n\nPertussis is also an interesting infectious agent with respect to the concept of herd immunity. According to the CDC, individuals should be vaccinated two weeks prior to being near a newborn. Consider then this quote from the CDC:\n\nMore than 95 percent of U.S. children receive three or more doses of pertussis vaccines, while less than 1 percent are completely unvaccinated. Because of this, we usually find that most pertussis occurs among vaccinated people. This does not mean that the vaccine doesn’t work, it just means that most people are vaccinated but protection wears off.\n\nAnd yet the herd immunity threshold score (the target percentage) allegedly required to acquire herd immunity is between 88% and 93%. The difficulties in expecting herd immunity with vaccination against B. pertussis were known back in the 1990s (Fine, 1993):\n\nThe cyclical pattern of pertussis provides a classic example of mass action dynamics…. Consideration of age-dependent transmission has suggested a slightly lower estimate, 88 percent, assuming no waning of immunity…. Given that these herd immunity estimates are higher than most estimates of the protective efficacy of a complete course of pertussis vaccine… and that there is evidence of waning vaccine-derived protection… it appears that eradication of this infection is not currently possible by childhood vaccination alone.\n\nVaccination of those most at risk of being infected is considered to be the most efficient use of herd immunity. These strategies are sometimes called “bubble” or “ring” (around an outbreak) and cocoon (around an individual) vaccination. The CDC recommendscocoon vaccination for infants for pertussis, leading to new vaccination of individuals who will be near the infant shortly after birth with the DTaP/TDap vaccine. This recommendation persists in spite of the findings of epidemiologists who reported in 2012 that to prevent one infant death, one million parents would have to be vaccinated. Fear tactics—such as the Glaxo Smith Kline ad featuring a new grandmother, supposedly not recently vaccinated with TDap, turning into a wolf—are used to aggressively promote the cocooning strategy. Nicola Klein, a pediatrician and vaccine researcher who led a recent Pediatrics study on vaccinations for whooping cough stated, “I haven’t seen any studies that show a strong protective effect from the cocooning strategy.”\n\nVaccine Failure\n\nThe vaccination paradigm holds that a specific percentage of vaccinated in a population will bring about herd immunity fails at 95 percent in part because people who are vaccinated lose their immunity. With acellular pertussis, the immunity is lost fairly quickly; one study in 2005 found that adolescents who were schedule-compliant for pertussis vaccination only had 73% effectiveness within one year of the final booster, and that the effectiveness rate dropped to 34% within two to four years. Compared to natural immunity, which lasts four to 20 years, the pertussis immunization program cannot be expected to contribute to herd immunity as well as vaccine proponents would have us believe.\n\nDr. James Cherry, in a commentary accompanying the Acosta et al. study, found the results, which he calls “vaccine failure”, “disappointing” and pointed out that case-control studies tend to inflate efficacy. He attributes the failure of the TDap and DTaP vaccination program to five factors:\n\nwaning immune responses\n\na change in the typical immune response in vaccine recipients\n\ninsufficient antigenicity of the vaccine due to missing proteins that would cause longer immunity as in the natural infection\n\nimproper formulation of the antigens that are in the vaccines\n\na stronger response of the original vaccine components than to new epitopes in the later vaccine\n\nVaccines other than the TDap/DTaP have been developed with high efficacy. Why have these not been brought forward? Combined vaccines have caused gridlock on improvement in terms of both safety and efficacy, and this gridlock has lead ACIP and CDC to adopt unsafe strategies. Unfortunately, the failure of the proposed ten-year booster TDap program resulted in calls for vaccination with TDap during pregnancy—each pregnancy.\n\nFor a vaccine to be administered to pregnant women without adequate safety data is, in my view, nothing short of medical malpractice. Pertussis vaccination during pregnancy was actually put into policy with zero safety data. The use of TDap during pregnancy was recommended by the CDC in 2013—before, even as they admitted, sufficient safety testing was available. The subsequent and few vaccine safety studies conducted for TDap during pregnancy focused primarily on maternal outcomes, and have not properly accounted for fetal deaths (e.g., excluding cases of spontaneous abortions). Maternal immune activation is especially problematic for brain development.\n\nIn a review of one study in its recommendation, the CDC reported that fever was observed in 2.4%–6.5% of recipients of a TDap booster (indicating increased risk of neurodevelopmental issues, per maternal immune activation), and while those rates were similar to controls, they noted that, “Safety data on use of Td during multiple pregnancies have not been published,” and yet they still recommend TDap in each and every pregnancy.\n\nThe use of an absence of evidence as evidence of absence belies an approval bias that reaches outside the realm of science.\n\nAnd herein we see the same logical fallacy that CDC has been using since 2004 to have vaccines approved. The use of an absence of evidence as evidence of absence belies an approval bias that reaches outside the realm of science.\n\nIn a study earlier this year, Perry et al reported that 3% of women who received TDap during a pregnancy were not likely to accept another TDap during subsequent pregnancies due to responses to the first dose. However, they also noted that maternal reactions following receipt of TDap are common: two-thirds of the study population had noteworthy negative reactions.\n\nACIP Wants Three Doses of MMR? What For? 19% Efficacy?\n\nIn their anti-trust case against Merck, two whistleblowers have asserted that the actual efficacy of the MMR vaccine against the wild-type mumps virus may be as low as 10%. ACIP recently recommended a third dose of MMR to help stem the growing number of mumps outbreaks across the country. For over a decade, mumps outbreaks worldwide have involved—almost exclusively—vaccinated individuals. In an article reviewing the Merck fraud case, Dr. Paul Offit, MD is quoted as “believing” that all young people should be required to get a third MMR dose before entering college. This “belief”, like ACIP’s “belief” that TDap would be safe during pregnancy, is not science-based.\n\nBased on Merck “science,” MMR is claimed to have a two-dose “efficacy” of 80-85% (“efficacy” is in quotes because this is for the vaccine strain, not the wild type). If the whistleblowers’ allegations are correct, under a naïve model in which repeated vaccination increases immunity in the previously vaccinated at the same rate as the unvaccinated (a dubious but best-case scenario), my calculations tell me that the expected population-wide efficacy of MMR against wild-type mumps after three doses is 14.5%. To achieve the reported immunity (85%), individuals would have to receive a stunning 14 doses of MMR. If the single-dose efficacy is 68%, four doses are needed to achieve 85% overall efficacy. Note that even this falls short of Merck’s goal of 95% efficacy to achieve herd immunity. Clearly, if TDap/DtaP is a failed vaccine, MMR is an absolute blunder.\n\nTheory vs. Reality\n\nSo, what have we learned about herd immunity from admitted failures such as the TDap/DTaP vaccination program and ongoing mumps outbreaks within vaccinated populations? A meta-analysis in 2015 estimated that assuming 85% efficacy, in every additional year after the last dose of DTaP, the odds of infection increased by 1.33 times and that only 10% of children vaccinated with DTaP would be immune to pertussis 8.5 years after the last dose. Reviewing last year’s Harvard mumps outbreak and the current outbreak at Syracuse University, nearly all the students diagnosed with mumps had been “properly vaccinated” against mumps with the MMR. Given that the only solution offered to us from the CDC is more boosters, I would say that we have not moved or improved in artificial immunization—at least against B. pertussis or mumps—in decades. There are calls for lifelong adult boosters against pertussis to “increase herd protection” as if that is still (or ever was) a viable concept when considering pertussis.\n\nThe US leads all industrialized nations in the rates of deaths of infants on the first day of life. Starting in 2011, there were more fetal deaths than infant deaths in the United States (National Vital Statistics Report, CDC), and the rate of maternal death during pregnancy is skyrocketing, beyond all western countries. One study in the Lancetreported a rate of 26 deaths per 100,000 pregnancies in the US.\n\nWe have also learned that the vaccine industry, including the CDC, will continue to allow society to expend time, energy and resources on demonstrably failed vaccine programs, ambivalent to the risks of adverse events associated with each and every vaccine, and that they will desperately try to move the goal post of performance, or ditch their vaccination efforts onto another unsuspecting segment of the population without sufficient safety testing.\n\nRead more at: WorldMercuryProject.org Natural vs. artificial herd immunity: What have failed vaccination programs taught us?", "https://www.naturalnews.com/2017-11-15-trump-nominates-big-pharma-executive-to-run-hhs-proving-government-has-been-hopelessly-corrupted-by-the-drug-industry.html": "(Natural News) There’s a new chief in town, Alex Azar, who, should he receive confirmation from Congress, will soon take over as head of the United States Department of Health and Human Services (HHS). But not everyone is happy with this decision because Azar is the former president of Lilly USA, the American arm of drug giant Eli Lilly and Company, and a well-known pharmaceutical industry lobbyist – which just goes to show that nothing ever really changes in Washington, D.C.\n\nPresident Donald Trump chose Azar as a replacement for Dr. Tom Price, who resigned from being head of the HHS back in September after a series of stories was published showing that Price had abused his privilege within the administration by using private charter jets and government planes rather than commercial airlines to conduct his business. The President has dubbed Azar as being “a star” for better health care, and has promised that he will work toward lowering prescription drug prices and implementing more health care reforms.\n\nBut Azar’s direct ties to the drug industry have many health freedom advocates concerned that it will just be more of the same. A graduate of Yale Law School, Azar is hardly new to D.C., having served as general counsel and then as deputy secretary of the HHS during the administration of President George W. Bush. Azar has also in the past represented the drug industry before members of Congress whom he was trying to lobby for legislation designed to benefit Big Pharma.\n\n“Azar spent nearly a decade at Indianapolis-based Eli Lilly, where he rose to become president of the pharmaceutical giant’s U.S. operations before leaving earlier this year,” writes Adam Cancryn and Sarah Karlin-Smith for Politico, noting that former Democratic presidential candidate Bernie Sanders (I-Vermont) is planning to “vigorously oppose” Azar’s nomination because of his drug industry ties.\n\nAlex Azar has said he will continue to fight Obamacare\n\nWhere Azar is earning considerable praise amongst hardline conservatives, however, is his position with regards to the Affordable Care Act (ACA), also known as Obamacare. Azar will be directly responsible for overseeing Obamacare’s implementation and function, though he doesn’t agree with the legislation at all and has indicated publicly that he believes it “is failing completely on its own terms.”\n\nLike President Trump, Azar had hoped to see Obamacare scrapped entirely with a repeal-and-replace alternative bill. But as many Natural News readers well know, establishment Republicans like Arizona Senator John McCain made sure that this didn’t succeed, which means parts of Obamacare are still in use while others, including the individual mandate, are reportedly in the process of being scrapped.\n\nAzar is also unhappy with the way that Obamacare’s expansion of Medicaid coverage has progressed, explaining to the media that he would rather see government money sent through “private-sector vehicles” in order to deliver health care to more Americans. So while he may not be a top pick in terms of his past positions at Eli Lilly and the appearance of revolving door politics-as-usual that this creates, he could be helpful in eventually achieving a complete dismantling of Obamacare.\n\n“As a former Deputy Secretary of Health and Human Services and private sector executive, Alex Azar has the qualifications and experience to get results,” believes Senator Lamar Alexander of Tennessee, who currently serves as chairman of the Senate Health Committee. “The Senate Health Committee will promptly schedule a hearing on his nomination,” he added about his intention to see that Azar receives confirmation.\n\nThe corruption of Big Pharma runs deep. To keep up with the latest developments in the field and how they affect health freedom, visit DangerousMedicine.com.\n\nSources for this article include:\n\nCNBC.com\n\nPolitico.com\n\nNaturalNews.com\n\nNYTimes.com Trump nominates Big Pharma executive to run HHS, proving government has been hopelessly corrupted by the drug industry", "https://www.naturalnews.com/2017-12-05-federal-reserve-vice-chairman-declares-bitcoin-a-serious-risk-to-financial-stability-crypto-markets-plunge.html": "(Natural News) The private central banking cartel is so worried about losing its grip on the financial instruments of the world that this mafia-like group of robber barons is now claiming that digital “cryptocurrencies” like Bitcoin “pose serious financial stability issues.”\n\nAt the recent 2017 Financial Stability and Fintech Conference, Federal Reserve vice chairman of supervision Randy Quarles stated that people pulling their money out of fiat currencies like the United States dollar and putting them into cryptos like Bitcoin “may not pose major concerns at their current levels of use,” but that in time, “more serious financial stability issues may result if they achieve wide-scale usage.”\n\nSponsored by the Federal Reserve Bank of Cleveland, this meeting at which Quarles spoke dealt with all sorts of issues ranging from general financial stability to the role of the private Federal Reserve in issuing and controlling what most people today falsely assume is a public, government-issued currency (in reality, the U.S. dollar is a fake fiat currency controlled by a private group of individuals working on behalf of their own interests).\n\nWhile rumors have recently begun to circulate that the Federal Reserve might be considering the issuance of its own Bitcoin knockoff in the near future, the private banking group has since denied such claims, insisting that its Monopoly-like Federal Reserve Notes are probably here to stay.\n\nAt the same time, both the Trump administration and the Federal Reserve have indicated that they intend to “keep an eye” on Bitcoin (as if they’re some kind of all-powerful entity that gets to decide who puts their money where).\n\n“The [Bitcoin situation] is something that is being ‘monitored’ by our team – Homeland Security is involved,” White House Press Secretary Sarah Huckabee Sanders stated recently upon being asked by a reporter if President Trump has an opinion on Bitcoin.\n\n“I know it’s something that he’s [Trump] keeping an eye on – And we’ll keep you posted when we have anything further on it.”\n\nFederal reserve hilariously says Bitcoin is backed by nothing while ironically ignoring that the dollar is also backed by nothing\n\nIn a humorously ironic explanation as to the alleged “drawbacks” of cryptocurrencies like Bitcoin, Quarles added at his meeting that these digital assets aren’t backed by anything of actual value, and neither do they have any “intrinsic” value.\n\nWhat makes such a claim absolutely ludicrous is the fact that the U.S. dollar is similarly worthless, backed only by the promise of value and people’s trust that it even hold value. The only difference between Bitcoin and the U.S. dollar is the fact that the U.S. dollar is printed on a piece of paper.\n\nMeanwhile, Bitcoin prices have been all over the place after reaching an all-time high of nearly $12,000 per coin. And while the prospects of profiting from this boom might be tempting to many casual observers who are just now learning about Bitcoin, some financial experts warn that the risks are simply too great.\n\nAccording to CNBC‘s Vitor Constancio, for instance, the price fluctuations of Bitcoin make it “a speculative asset by definition.” He also says that anyone who invests in Bitcoin is “taking that risk of buying at such high prices.”\n\n“We don’t have responsibility or even instruments that point to particular prices of particular assets, that is certainly not the role of central banks,” he claims.\n\nOthers, however, insist that Bitcoin is only heading “to the moon,” at this point. Famed stock picker Ronnie Moas is convinced that Bitcoin will reach a price of $20,000 per coin by 2018, even despite split-adjusted price changes resulting from splits and forks.\n\nSources for this article include:\n\nFederalReserve.gov\n\nNaturalNews.com\n\nBitcoin.com\n\nCoinTelegraph.com Federal Reserve vice chairman declares Bitcoin a serious risk to financial stability… crypto markets PLUNGE"}