{"https://www.naturalnews.com/2017-11-16-have-scientists-programmed-gmo-food-to-reduce-the-population-evidence-suggests-reduced-sperm-counts-especially-in-black-men-are-a-result-of-weaponized-food.html": "(Natural News) Could a new technology for weaponizing food known as RNA interference be used for population control?\n\nGenetic engineers found a way to make food crops grow fragments of RNA that they can use bioweapon-style to interfere with the physiological properties of any species eating the food. For example, it can cause corn to grow characteristics that will kill pests when they eat it so pesticides won’t be needed at all. This, of course, is presented as good news for humanity as it could eliminate the need for pesticides, but there is a huge caveat: This same technology could also be used to target not just pests but also human beings.\n\nThere are lots of possibilities here. For example, crops of food can be engineered to cause infertility in humans and some suspect it’s already being done; dropping sperm counts seem to indicate that something is indeed going on.\n\nA recent study from the Hebrew University of Jerusalem that was published in the Human Reproduction Journal Update revealed that human sperm production dropped by 59.3 percent between 1973 and 2011, which is a huge decline that could have serious implications. Much of it has been blamed on chemical exposure, specifically chemical castrators like atrazine. After all, the sperm drops are particularly prevalent in Western nations like the U.S. where GMO foods are widely consumed.\n\nThis statistic is something that population control proponents are surely pleased about. Many believe it’s being done intentionally, and it shows just how possible these frightening scenarios are. Just how far does this population control agenda go?\n\nBlack people have long been targeted in population reduction experiments\n\nThere have been lots of horrifying incidents in recent years in which blacks were targeted for experimentation and population reduction – and there could be many more that have yet to be exposed, so it’s not too far-fetched to imagine they’re being targeted right now by such technology. This is the topic of a new video lecture by Mike Adams, the Health Ranger, called “The Science Agenda to Exterminate Blacks.” In the video, he talks about the “concerted, organized and longstanding effort to eliminate African Americans from the gene pool” and Africans in general.\n\nIn the video, he looks at how blacks have been targeted throughout the years. One of the more recent high-profile incidents was the lead poisoning in Flint, Michigan’s water supply, an area largely populated by African Americans.\n\nIn another example, Pfizer officials were arrested in Nigeria a few years ago for illegally testing experimental antibiotics on children there. Eleven kids died and dozens of others were harmed in the incident.\n\nAdams believes that in the recent Ebola outbreak that gripped Africa, weaponized strains of the disease were allowed to escape there to test their epidemiological impact and try out new drugs and also to encourage more funding.\n\nThen there are the groups giving young African women vaccines like tetanus shots in the “Eliminate project” that analysis showed had a high percentage of covert sterilization chemicals.\n\nVaccines are even believed to be used to target black babies. While everyone is susceptible to vaccine damage, they cause more damage in black babies than white ones. The genetic differences between black and white babies make it harder for black babies’ bodies to clear mercury from vaccines out of their bodies. Interestingly, black boys who were given the MMR vaccine had a 340 percent higher risk of autism.\n\nOne of the most egregious examples, however, is the Tuskegee syphilis experiment in the U.S. back in the 1930s in which poor, illiterate black men were left to suffer from syphilis intentionally so doctors could study the disease’s progression and then dissect their bodies after they died.\n\nWith a track record like that, it’s only natural to wonder if the latest genetic engineering technology is being used for similar unethical experiments in our food supply.\n\nSources include:\n\nNaturalNews.com\n\nNatural.News Have scientists programmed GMO food to reduce the population? Evidence suggests reduced sperm counts, especially in black men, are a result of weaponized food", "https://newstarget.com/2017-11-07-now-north-korean-hackers-have-stolen-submarine-and-warship-blueprints-from-south-korea.html": "North Korean hackers have stolen submarine and warship blueprints from South Korea, claims lawmaker\n\nNorth Korean hackers have stolen blueprints for South Korean warships and submarine from the database of Daewoo Shipbuilding & Marine Engineering Co., Ltd, one of South Korea’s largest shipbuilders, in April of last year. Though the identity of the perpetrators remained a mystery up until recently, it’s now believed that North Korean hackers were responsible for the data breach.\n\n“We are almost 100 percent certain that North Korean hackers were behind the hacking and stole the company’s sensitive documents,” said Kyung Dae-soo, a South Korean lawmaker and member of the conservative Liberty Korea Party.\n\nAccording to DailyMail.co.uk, the Daewoo hacking was uncovered by a Ministry of Defense division tasked with investigating cybercrime cases. It’s believed that the hackers took around 40,000 documents, though the exact sensitivity of these documents has not been revealed by the investigators.\n\nWhat is known is that the hackers stole 60 classified military documents. Included in those documents are information regarding vessels equipped with the Aegis Combat System, an integrated naval weapons system that utilizes powerful computer and radar technology. Currently, South Korea is one of six nations operating the system, with three destroyers of the Republic of Korea Navy making use of it. (Related: North Korea’s nuclear missiles can now reach New York City, Boston and Los Angeles, analysts conclude… are you awake yet?)\n\nKyung, himself a member of the South Korean Parliament’s National Defense Committee, has stated that he learned of the hack at an intelligence briefing last week. The findings were verified by military investigators who had been on the case for six months leading up to October of this year. He added that the investigative team pinpointed North Korean hackers due to the hacking method being highly similar to other hack jobs linked to the hermit kingdom.\n\nNo further comments on the matter have been issued by the South Korean Defense Ministry. A spokesperson for Daewoo Shipbuilding & Marine Engineering stated that the company was unaware of the issue until Kyung addressed it, and that there were no immediate plans of releasing any statements concerning the hack.\n\nThough as per FoxBusiness.com, the company has begun to beef up its defenses after the hack came to light. Defense sources have criticized Daewoo Shipbuilding & Marine Engineering for failing to secure its business intranet from the public internet.\n\nNorth Korea has yet to comment. However, the nation has either denied or outright ignored past accusations.\n\nFast facts on Unit 121\n\nIf North Korea is indeed behind the hack, then the data breach was most likely pulled off by the enigmatic Unit 121, a North Korean cyberwarfare agency. The bureau first came to international attention in 2014 when they allegedly hacked into Sony Pictures’ computers prior to the release of “The Interview.” This action-comedy centered around Seth Rogen and James Franco interviewing current North Korean leader Kim Jong-un, as played by Randall Park.\n\nThough the information on Unit 121 has been relatively scarce until now, this is what we do know:\n\nThe agency is said to have been set up Kim Jong Il, Kim Jong-un’s father and predecessor, almost two decades ago.\n\nIt’s believed that Unit 121 consists of over 1,700 state-sponsored hackers who are backed by over 5,000 support staff.\n\nWhile Unit 121 became globally known in 2014, the agency gained South Korea’s attention as far back as 2004, when they supposedly tapped into the South Korean military’s wireless communication network.\n\nIn addition to performing military data breaches, Unit 121’s skills appear to be used for monetary gain as well. Back in 2011, South Korean police arrested five people who had been working with North Korean hackers to take in millions of dollars via online games. Just last October, North Korean hackers were linked to the theft of $60 million from Taiwan’s Far Eastern International Bank.\n\nVisit WWIII.news today to remain updated on any and all news revolving around North Korea.\n\nSources include:\n\nDailyMail.co.uk\n\nFoxBusiness.com\n\nBloomberg.com North Korean hackers have stolen submarine and warship blueprints from South Korea, claims lawmaker", "https://www.naturalnews.com/2017-12-04-how-relapses-from-illness-happen-researchers-discover-that-some-bacteria-hide-until-the-immune-system-calms-then-attack-again.html": "(Natural News) According to a study published in 2016, scientists have discovered a bacteria “alarm clock” that can wake dormant Salmonella in the body which enables the bug to trigger a relapse.\n\nThe researchers from Imperial College London say that the “alarm clock” is common among various types of bacteria, such as Salmonella and E. coli. Their discovery could explain why some people suffer repeated bouts of infections, like ear or urinary tract infections, even though they take antibiotics. The team aims to use these findings to look into “hard-to-treat infections.”\n\nDr. Sophie Helaine, the lead author of the research from the Department of Medicine at Imperial, said, “Whenever bacteria such as Salmonella invade the body, around a third of the bugs ‘cloak’ themselves as a defence mechanism against the body’s immune system. They enter a type of stand-by mode possibly to hide from the body’s immune system, that means they are not killed by antibiotics. The bacteria stop replicating and can remain in this dormant state for days, weeks or even months. When the immune system attack has passed, some bacterial cells spring back to life and trigger another infection.”\n\nDr. Helaine continued, “This is why, for instance, a woman may think she has recovered from a urinary tract infection – and yet days or weeks later it seems to return. Many patients may assume it’s a different infection – but actually it’s the same bug.” (Related: Boosting immune system with natural methods offers many health benefits.)\n\nShe adds that these so-called persistent bacteria also “fuel antibiotic resistance,” and this is why patients end up taking many courses of antibiotics for one infection. Taking this amount of antibiotics means that some bacteria are “developing resistance.”\n\nEarlier research from Dr. Helaine’s lab determined that Salmonella bacteria go into stand-by mode by “poisoning” themselves using toxins.\n\nIn the current study, the team showed a mechanism that Salmonella use “to detoxify themselves.” This wakes them from stand-by and lets them start growing again.\n\nDr. Helaine said it is possible that many bacteria use this same toxin, called TacT, to “switch into stand-by mode.” These bacteria include those that cause many intestinal, ear, throat, or urinary tract infections and even tuberculosis.\n\nDr. Helaine shares that if they can determine how to control this particular mechanism and “force the bacteria out of stand-by” they can then be treated with antibiotics, effectively killing them.\n\nFor the study, Dr. Helaine et al. used Salmonella cells in the laboratory to identify the bacterial alarm clock. The team tested a collection of over 4,000 proteins to look for those that wake the bacteria up. They isolated an enzyme called peptidyl-tRNA hydrolase (Pth) that was an effective alarm clock.\n\nThe scientists have determined that the toxin TacT “stops cell growth during times of attack by blocking protein production.” When the conditions are more suitable for cell growth, Pth molecules eliminate the block on protein production and lets the growth continue.\n\nDr. Helaine concluded, “When the bacteria are under attack they go to sleep and wait for better days. Then once the immune system attack has passed, the body is once again a favourable place to start an infection, and cell growth resumes.”\n\nBoost your immune system naturally\n\nDon’t wait until you need antibiotics to get better. Try these natural tips to boost your immune system instead:\n\nGet a good night’s rest and manage stress — Sleep deprivation and stress overload increase the hormone cortisol, prolonged elevation of which can suppress immune function.\n\n— Sleep deprivation and stress overload increase the hormone cortisol, prolonged elevation of which can suppress immune function. Quit smoking or avoid second-hand tobacco smoke — Smoking undermines basic immune defenses and increase raises the risk of bronchitis and pneumonia in everyone and middle ear infections in children.\n\n— Smoking undermines basic immune defenses and increase raises the risk of bronchitis and pneumonia in everyone and middle ear infections in children. Eat healthier — Add plenty of vegetables, fruits, nuts, and seeds to your diet so your body has all the nutrients your immune system needs.\n\nYou can read more articles about preventing infections and illness at Prevention.news.\n\nSources include:\n\nImperial.AC.uk\n\nEverydayHealth.com How relapses from illness happen: Researchers discover that some bacteria hide until the immune system calms, then attack again"}